PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:27 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru0_main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru0")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

      78        .dwattr $C$DW$4, DW_AT_decl_file("pru0_main.c")
      79        .dwattr $C$DW$4, DW_AT_decl_line(0x28)
      80        .dwattr $C$DW$4, DW_AT_decl_column(0x06)
      81        .dwattr $C$DW$4, DW_AT_TI_max_frame_size(0x02)
      82        .dwpsn  file "pru0_main.c",line 40,column 17,is_stmt,address ||main||,isa 0
      83
      84        .dwfde $C$DW$CIE, ||main||
      85;----------------------------------------------------------------------
      86;  40 | void main(void) {                                                      
      87;----------------------------------------------------------------------
      88
      89;***************************************************************
      90;* FNAME: main                          FR SIZE:   2           *
      91;*                                                             *
      92;* FUNCTION ENVIRONMENT                                        *
      93;*                                                             *
      94;* FUNCTION PROPERTIES                                         *
      95;*                            0 Auto,  2 SOE     *
      96;***************************************************************
      97
      98 00000000                 ||main||:
      99;* --------------------------------------------------------------------------*
     100        .dwcfi  cfa_offset, 0
     101;*** 43 -----------------------    *(&CT_CFG+4) &= 0xffffffefu;
     102;*** 47 -----------------------    pru0_dataout();
     103;***    -----------------------    return;
     104 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     105        .dwcfi  cfa_offset, 2
     106        .dwpsn  file "pru0_main.c",line 43,column 2,is_stmt,isa 0
     107;----------------------------------------------------------------------
     108;  43 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     109;  45 | // loop forever                                                        
     110;  46 | void pru0_dataout(void) ;                                              
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    3

     111;----------------------------------------------------------------------
     112 00000004 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |43| CT_CFG
     113 00000008 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     114        .dwcfi  save_reg_to_mem, 14, -2
     115        .dwcfi  save_reg_to_mem, 15, -1
     116 0000000c 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |43| 
     117 00000010 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |43| CT_CFG
     118        .dwpsn  file "pru0_main.c",line 47,column 2,is_stmt,isa 0
     119;----------------------------------------------------------------------
     120;  47 | pru0_dataout() ;                                                       
     121;  48 | #ifdef USED                                                            
     122;  49 | // old code using shared RAM mailbox,  not reached                     
     123;  50 | while(1) {                                                             
     124;  51 |         __R30 = pru_pru_mailbox.pru0_r30 ;                             
     125;  53 | #endif                                                                 
     126;----------------------------------------------------------------------
     127$C$DW$5 .dwtag  DW_TAG_TI_branch
     128        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     129        .dwattr $C$DW$5, DW_AT_name("pru0_dataout")
     130        .dwattr $C$DW$5, DW_AT_TI_call
     131
     132 00000014 000000230000C3!         JAL       r3.w2, ||pru0_dataout|| ; [ALU_PRU] |47| pru0_dataout
     133 00000018 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     134        .dwcfi  restore_reg, 14
     135        .dwcfi  restore_reg, 15
     136 0000001c 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     137        .dwcfi  cfa_offset, 0
     138$C$DW$6 .dwtag  DW_TAG_TI_branch
     139        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     140        .dwattr $C$DW$6, DW_AT_TI_return
     141
     142 00000020 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     143        .dwattr $C$DW$4, DW_AT_TI_end_file("pru0_main.c")
     144        .dwattr $C$DW$4, DW_AT_TI_end_line(0x37)
     145        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     146        .dwendentry
     147        .dwendtag $C$DW$4
     148
     149;*****************************************************************************
     150;* UNDEFINED EXTERNAL REFERENCES                                             *
     151;*****************************************************************************
     152        .global ||pru0_dataout||
     153
     154;******************************************************************************
     155;* TYPE INFORMATION                                                           *
     156;******************************************************************************
     157
     158$C$DW$T$19      .dwtag  DW_TAG_structure_type
     159        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     160$C$DW$7 .dwtag  DW_TAG_member
     161        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     162        .dwattr $C$DW$7, DW_AT_name("REVID")
     163        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     164        .dwattr $C$DW$7, DW_AT_bit_offset(0x00)
     165        .dwattr $C$DW$7, DW_AT_bit_size(0x20)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    4

     166        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     167        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     168        .dwattr $C$DW$7, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/
     169        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     170        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     171
     172        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     173        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     174        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     175        .dwendtag $C$DW$T$19
     176
     177$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     178        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     179
     180
     181$C$DW$T$20      .dwtag  DW_TAG_structure_type
     182        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     183$C$DW$8 .dwtag  DW_TAG_member
     184        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     185        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     186        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     187        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e)
     188        .dwattr $C$DW$8, DW_AT_bit_size(0x02)
     189        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     190        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     191        .dwattr $C$DW$8, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/
     192        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     193        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     194
     195$C$DW$9 .dwtag  DW_TAG_member
     196        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     197        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     198        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     199        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c)
     200        .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     201        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     202        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     203        .dwattr $C$DW$9, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/
     204        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     205        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     206
     207$C$DW$10        .dwtag  DW_TAG_member
     208        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     209        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     210        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     211        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b)
     212        .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     213        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     214        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     215        .dwattr $C$DW$10, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     216        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     217        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     218
     219$C$DW$11        .dwtag  DW_TAG_member
     220        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    5

     221        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     222        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     223        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a)
     224        .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     225        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     226        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     227        .dwattr $C$DW$11, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     228        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     229        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     230
     231$C$DW$12        .dwtag  DW_TAG_member
     232        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     233        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     234        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     235        .dwattr $C$DW$12, DW_AT_bit_offset(0x00)
     236        .dwattr $C$DW$12, DW_AT_bit_size(0x1a)
     237        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     238        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     239        .dwattr $C$DW$12, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     240        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     241        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     242
     243        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     244        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     245        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     246        .dwendtag $C$DW$T$20
     247
     248$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     249        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     250
     251
     252$C$DW$T$21      .dwtag  DW_TAG_structure_type
     253        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     254$C$DW$13        .dwtag  DW_TAG_member
     255        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     256        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     257        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     258        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e)
     259        .dwattr $C$DW$13, DW_AT_bit_size(0x02)
     260        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     261        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     262        .dwattr $C$DW$13, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     263        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     264        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     265
     266$C$DW$14        .dwtag  DW_TAG_member
     267        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     268        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     269        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     270        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d)
     271        .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     272        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     274        .dwattr $C$DW$14, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     275        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    6

     276        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     277
     278$C$DW$15        .dwtag  DW_TAG_member
     279        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     280        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     281        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     282        .dwattr $C$DW$15, DW_AT_bit_offset(0x18)
     283        .dwattr $C$DW$15, DW_AT_bit_size(0x05)
     284        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     286        .dwattr $C$DW$15, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     287        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     288        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     289
     290$C$DW$16        .dwtag  DW_TAG_member
     291        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     292        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     293        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     294        .dwattr $C$DW$16, DW_AT_bit_offset(0x13)
     295        .dwattr $C$DW$16, DW_AT_bit_size(0x05)
     296        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     298        .dwattr $C$DW$16, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     299        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     300        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     301
     302$C$DW$17        .dwtag  DW_TAG_member
     303        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     304        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     305        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     306        .dwattr $C$DW$17, DW_AT_bit_offset(0x12)
     307        .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     308        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     310        .dwattr $C$DW$17, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     311        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     312        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     313
     314$C$DW$18        .dwtag  DW_TAG_member
     315        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     316        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     317        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     318        .dwattr $C$DW$18, DW_AT_bit_offset(0x11)
     319        .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     320        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     321        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     322        .dwattr $C$DW$18, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     323        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     324        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     325
     326$C$DW$19        .dwtag  DW_TAG_member
     327        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     328        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     329        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     330        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    7

     331        .dwattr $C$DW$19, DW_AT_bit_size(0x05)
     332        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     334        .dwattr $C$DW$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     335        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     336        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     337
     338$C$DW$20        .dwtag  DW_TAG_member
     339        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     340        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     341        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     342        .dwattr $C$DW$20, DW_AT_bit_offset(0x07)
     343        .dwattr $C$DW$20, DW_AT_bit_size(0x05)
     344        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     345        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     346        .dwattr $C$DW$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     347        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     348        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     349
     350$C$DW$21        .dwtag  DW_TAG_member
     351        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     352        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     353        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     354        .dwattr $C$DW$21, DW_AT_bit_offset(0x06)
     355        .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     356        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     357        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     358        .dwattr $C$DW$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     359        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     360        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     361
     362$C$DW$22        .dwtag  DW_TAG_member
     363        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     364        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     365        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     366        .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     367        .dwattr $C$DW$22, DW_AT_bit_size(0x06)
     368        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     370        .dwattr $C$DW$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     371        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     372        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     373
     374        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     375        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     376        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     377        .dwendtag $C$DW$T$21
     378
     379$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     380        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     381
     382
     383$C$DW$T$22      .dwtag  DW_TAG_structure_type
     384        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     385$C$DW$23        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    8

     386        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     387        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     388        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     389        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e)
     390        .dwattr $C$DW$23, DW_AT_bit_size(0x02)
     391        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     392        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     393        .dwattr $C$DW$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     394        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     395        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     396
     397$C$DW$24        .dwtag  DW_TAG_member
     398        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     399        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     400        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     401        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d)
     402        .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     403        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     404        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     405        .dwattr $C$DW$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     406        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     407        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     408
     409$C$DW$25        .dwtag  DW_TAG_member
     410        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     411        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     412        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     413        .dwattr $C$DW$25, DW_AT_bit_offset(0x18)
     414        .dwattr $C$DW$25, DW_AT_bit_size(0x05)
     415        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     417        .dwattr $C$DW$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     418        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     419        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     420
     421$C$DW$26        .dwtag  DW_TAG_member
     422        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     423        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     424        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     425        .dwattr $C$DW$26, DW_AT_bit_offset(0x13)
     426        .dwattr $C$DW$26, DW_AT_bit_size(0x05)
     427        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     428        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     429        .dwattr $C$DW$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     430        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     431        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     432
     433$C$DW$27        .dwtag  DW_TAG_member
     434        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     435        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     436        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     437        .dwattr $C$DW$27, DW_AT_bit_offset(0x12)
     438        .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     439        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE    9

     441        .dwattr $C$DW$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     442        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     443        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     444
     445$C$DW$28        .dwtag  DW_TAG_member
     446        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     447        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     448        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     449        .dwattr $C$DW$28, DW_AT_bit_offset(0x11)
     450        .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     451        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     453        .dwattr $C$DW$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     454        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     455        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     456
     457$C$DW$29        .dwtag  DW_TAG_member
     458        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     459        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     460        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     461        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     462        .dwattr $C$DW$29, DW_AT_bit_size(0x05)
     463        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     465        .dwattr $C$DW$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     466        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     467        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     468
     469$C$DW$30        .dwtag  DW_TAG_member
     470        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     471        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     472        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     473        .dwattr $C$DW$30, DW_AT_bit_offset(0x07)
     474        .dwattr $C$DW$30, DW_AT_bit_size(0x05)
     475        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     477        .dwattr $C$DW$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     478        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     479        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     480
     481$C$DW$31        .dwtag  DW_TAG_member
     482        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     483        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     484        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     485        .dwattr $C$DW$31, DW_AT_bit_offset(0x06)
     486        .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     487        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     489        .dwattr $C$DW$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     490        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     491        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     492
     493$C$DW$32        .dwtag  DW_TAG_member
     494        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     495        .dwattr $C$DW$32, DW_AT_name("rsvd26")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   10

     496        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     497        .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     498        .dwattr $C$DW$32, DW_AT_bit_size(0x06)
     499        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     501        .dwattr $C$DW$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     502        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     503        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     504
     505        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     506        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     507        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     508        .dwendtag $C$DW$T$22
     509
     510$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     511        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     512
     513
     514$C$DW$T$23      .dwtag  DW_TAG_structure_type
     515        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     516$C$DW$33        .dwtag  DW_TAG_member
     517        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     518        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     519        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     520        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f)
     521        .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     522        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     524        .dwattr $C$DW$33, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     525        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     526        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     527
     528$C$DW$34        .dwtag  DW_TAG_member
     529        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     530        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     531        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     532        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e)
     533        .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     534        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     536        .dwattr $C$DW$34, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     537        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     538        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     539
     540$C$DW$35        .dwtag  DW_TAG_member
     541        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     542        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     543        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     544        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d)
     545        .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     546        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     548        .dwattr $C$DW$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     549        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     550        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   11

     551
     552$C$DW$36        .dwtag  DW_TAG_member
     553        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     554        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     555        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     556        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c)
     557        .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     558        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     560        .dwattr $C$DW$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     561        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     562        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     563
     564$C$DW$37        .dwtag  DW_TAG_member
     565        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     566        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     567        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     568        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b)
     569        .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     570        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     572        .dwattr $C$DW$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     573        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     574        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     575
     576$C$DW$38        .dwtag  DW_TAG_member
     577        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     578        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     579        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     580        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a)
     581        .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     582        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     584        .dwattr $C$DW$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     585        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     586        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     587
     588$C$DW$39        .dwtag  DW_TAG_member
     589        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     590        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     591        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     592        .dwattr $C$DW$39, DW_AT_bit_offset(0x19)
     593        .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     594        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     596        .dwattr $C$DW$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     597        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     598        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     599
     600$C$DW$40        .dwtag  DW_TAG_member
     601        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     602        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     603        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     604        .dwattr $C$DW$40, DW_AT_bit_offset(0x18)
     605        .dwattr $C$DW$40, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   12

     606        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     608        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     609        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     610        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     611
     612$C$DW$41        .dwtag  DW_TAG_member
     613        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     614        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     615        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     616        .dwattr $C$DW$41, DW_AT_bit_offset(0x17)
     617        .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     618        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     620        .dwattr $C$DW$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     621        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     622        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     623
     624$C$DW$42        .dwtag  DW_TAG_member
     625        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     626        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     627        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     628        .dwattr $C$DW$42, DW_AT_bit_offset(0x16)
     629        .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     630        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     631        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     632        .dwattr $C$DW$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     633        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     634        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     635
     636$C$DW$43        .dwtag  DW_TAG_member
     637        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     638        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     639        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     640        .dwattr $C$DW$43, DW_AT_bit_offset(0x15)
     641        .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     642        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     644        .dwattr $C$DW$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     645        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     646        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     647
     648$C$DW$44        .dwtag  DW_TAG_member
     649        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     650        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     651        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     652        .dwattr $C$DW$44, DW_AT_bit_offset(0x14)
     653        .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     654        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     656        .dwattr $C$DW$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     657        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     658        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     659
     660$C$DW$45        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   13

     661        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     662        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     663        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     664        .dwattr $C$DW$45, DW_AT_bit_offset(0x13)
     665        .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     666        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     668        .dwattr $C$DW$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     669        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     670        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     671
     672$C$DW$46        .dwtag  DW_TAG_member
     673        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     674        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     675        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     676        .dwattr $C$DW$46, DW_AT_bit_offset(0x12)
     677        .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     678        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     680        .dwattr $C$DW$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     681        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     682        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     683
     684$C$DW$47        .dwtag  DW_TAG_member
     685        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     686        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     687        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     688        .dwattr $C$DW$47, DW_AT_bit_offset(0x11)
     689        .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     690        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     692        .dwattr $C$DW$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     693        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     694        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     695
     696$C$DW$48        .dwtag  DW_TAG_member
     697        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     698        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     699        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     700        .dwattr $C$DW$48, DW_AT_bit_offset(0x10)
     701        .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     702        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     704        .dwattr $C$DW$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     705        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     706        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     707
     708$C$DW$49        .dwtag  DW_TAG_member
     709        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     710        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     711        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     712        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     713        .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     714        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   14

     716        .dwattr $C$DW$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     717        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     718        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     719
     720$C$DW$50        .dwtag  DW_TAG_member
     721        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     722        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     723        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     724        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     725        .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     726        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     728        .dwattr $C$DW$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     729        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     730        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     731
     732$C$DW$51        .dwtag  DW_TAG_member
     733        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     734        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     735        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     736        .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     737        .dwattr $C$DW$51, DW_AT_bit_size(0x0e)
     738        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     740        .dwattr $C$DW$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     741        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     742        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     743
     744        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     745        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     746        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     747        .dwendtag $C$DW$T$23
     748
     749$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     750        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     751
     752
     753$C$DW$T$24      .dwtag  DW_TAG_structure_type
     754        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     755$C$DW$52        .dwtag  DW_TAG_member
     756        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     757        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     758        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     759        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c)
     760        .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     761        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     763        .dwattr $C$DW$52, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     764        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     765        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     766
     767$C$DW$53        .dwtag  DW_TAG_member
     768        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     769        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     770        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   15

     771        .dwattr $C$DW$53, DW_AT_bit_offset(0x18)
     772        .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     773        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     775        .dwattr $C$DW$53, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     776        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     777        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     778
     779$C$DW$54        .dwtag  DW_TAG_member
     780        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     781        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     782        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     783        .dwattr $C$DW$54, DW_AT_bit_offset(0x14)
     784        .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     785        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     786        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     787        .dwattr $C$DW$54, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     788        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     789        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     790
     791$C$DW$55        .dwtag  DW_TAG_member
     792        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     793        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     794        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     795        .dwattr $C$DW$55, DW_AT_bit_offset(0x10)
     796        .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     797        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     799        .dwattr $C$DW$55, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     800        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     801        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     802
     803$C$DW$56        .dwtag  DW_TAG_member
     804        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     805        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     806        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     807        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c)
     808        .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     809        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     811        .dwattr $C$DW$56, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     812        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     813        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     814
     815$C$DW$57        .dwtag  DW_TAG_member
     816        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     817        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     818        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     819        .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     820        .dwattr $C$DW$57, DW_AT_bit_size(0x0c)
     821        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     823        .dwattr $C$DW$57, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     824        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     825        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   16

     826
     827        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     828        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     829        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     830        .dwendtag $C$DW$T$24
     831
     832$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     833        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     834
     835
     836$C$DW$T$25      .dwtag  DW_TAG_structure_type
     837        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     838$C$DW$58        .dwtag  DW_TAG_member
     839        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     840        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     841        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     842        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c)
     843        .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     844        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     846        .dwattr $C$DW$58, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     847        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     848        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     849
     850$C$DW$59        .dwtag  DW_TAG_member
     851        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     852        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     853        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     854        .dwattr $C$DW$59, DW_AT_bit_offset(0x18)
     855        .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     856        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     858        .dwattr $C$DW$59, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     859        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     860        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     861
     862$C$DW$60        .dwtag  DW_TAG_member
     863        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     864        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     865        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     866        .dwattr $C$DW$60, DW_AT_bit_offset(0x14)
     867        .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     868        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     870        .dwattr $C$DW$60, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     871        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     872        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     873
     874$C$DW$61        .dwtag  DW_TAG_member
     875        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     876        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     877        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     878        .dwattr $C$DW$61, DW_AT_bit_offset(0x10)
     879        .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     880        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   17

     881        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     882        .dwattr $C$DW$61, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     883        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     884        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     885
     886$C$DW$62        .dwtag  DW_TAG_member
     887        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     888        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     889        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     890        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
     891        .dwattr $C$DW$62, DW_AT_bit_size(0x04)
     892        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     894        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     895        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     896        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     897
     898$C$DW$63        .dwtag  DW_TAG_member
     899        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     900        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     901        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     902        .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     903        .dwattr $C$DW$63, DW_AT_bit_size(0x0c)
     904        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     906        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     907        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     908        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     909
     910        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     911        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     912        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     913        .dwendtag $C$DW$T$25
     914
     915$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     916        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     917
     918
     919$C$DW$T$26      .dwtag  DW_TAG_structure_type
     920        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     921$C$DW$64        .dwtag  DW_TAG_member
     922        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     923        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     924        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     925        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c)
     926        .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     927        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     929        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     930        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     931        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     932
     933$C$DW$65        .dwtag  DW_TAG_member
     934        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     935        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   18

     936        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     937        .dwattr $C$DW$65, DW_AT_bit_offset(0x18)
     938        .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     939        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     941        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     942        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     943        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     944
     945$C$DW$66        .dwtag  DW_TAG_member
     946        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     947        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     948        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     949        .dwattr $C$DW$66, DW_AT_bit_offset(0x14)
     950        .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     951        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     953        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     954        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     955        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     956
     957$C$DW$67        .dwtag  DW_TAG_member
     958        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     959        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     960        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     961        .dwattr $C$DW$67, DW_AT_bit_offset(0x10)
     962        .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     963        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     965        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     966        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     967        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     968
     969$C$DW$68        .dwtag  DW_TAG_member
     970        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     971        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     972        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     973        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
     974        .dwattr $C$DW$68, DW_AT_bit_size(0x04)
     975        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     977        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     978        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     979        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     980
     981$C$DW$69        .dwtag  DW_TAG_member
     982        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     983        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     984        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     985        .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     986        .dwattr $C$DW$69, DW_AT_bit_size(0x0c)
     987        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     989        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     990        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   19

     991        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     992
     993        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     994        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     995        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     996        .dwendtag $C$DW$T$26
     997
     998$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     999        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
    1000
    1001
    1002$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1003        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1004$C$DW$70        .dwtag  DW_TAG_member
    1005        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1006        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
    1007        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1008        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c)
    1009        .dwattr $C$DW$70, DW_AT_bit_size(0x04)
    1010        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1012        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1013        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
    1014        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1015
    1016$C$DW$71        .dwtag  DW_TAG_member
    1017        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1018        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
    1019        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1020        .dwattr $C$DW$71, DW_AT_bit_offset(0x18)
    1021        .dwattr $C$DW$71, DW_AT_bit_size(0x04)
    1022        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1024        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1025        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
    1026        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1027
    1028$C$DW$72        .dwtag  DW_TAG_member
    1029        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1030        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
    1031        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1032        .dwattr $C$DW$72, DW_AT_bit_offset(0x14)
    1033        .dwattr $C$DW$72, DW_AT_bit_size(0x04)
    1034        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1036        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1037        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
    1038        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1039
    1040$C$DW$73        .dwtag  DW_TAG_member
    1041        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1042        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
    1043        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1044        .dwattr $C$DW$73, DW_AT_bit_offset(0x10)
    1045        .dwattr $C$DW$73, DW_AT_bit_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   20

    1046        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1048        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1049        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
    1050        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1051
    1052$C$DW$74        .dwtag  DW_TAG_member
    1053        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1054        .dwattr $C$DW$74, DW_AT_name("rsvd16")
    1055        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
    1056        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1057        .dwattr $C$DW$74, DW_AT_bit_size(0x10)
    1058        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1060        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1061        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
    1062        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1063
    1064        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1065        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1066        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1067        .dwendtag $C$DW$T$27
    1068
    1069$C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1070        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
    1071
    1072
    1073$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1074        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1075$C$DW$75        .dwtag  DW_TAG_member
    1076        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1077        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
    1078        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
    1079        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f)
    1080        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1081        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1083        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1084        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
    1085        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1086
    1087$C$DW$76        .dwtag  DW_TAG_member
    1088        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1089        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
    1090        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
    1091        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e)
    1092        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1093        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1095        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1096        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
    1097        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1098
    1099$C$DW$77        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   21

    1101        .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1102        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
    1103        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1104        .dwattr $C$DW$77, DW_AT_bit_size(0x1e)
    1105        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1107        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1108        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
    1109        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1110
    1111        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1112        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1113        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1114        .dwendtag $C$DW$T$28
    1115
    1116$C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1117        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
    1118
    1119
    1120$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1121        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1122$C$DW$78        .dwtag  DW_TAG_member
    1123        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1124        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
    1125        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
    1126        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f)
    1127        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1128        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1130        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1131        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
    1132        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1133
    1134$C$DW$79        .dwtag  DW_TAG_member
    1135        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1136        .dwattr $C$DW$79, DW_AT_name("rsvd1")
    1137        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
    1138        .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1139        .dwattr $C$DW$79, DW_AT_bit_size(0x1f)
    1140        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1142        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1143        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
    1144        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1145
    1146        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1147        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1148        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1149        .dwendtag $C$DW$T$29
    1150
    1151$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1152        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1153
    1154
    1155$C$DW$T$30      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   22

    1156        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1157$C$DW$80        .dwtag  DW_TAG_member
    1158        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1159        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
    1160        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1161        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f)
    1162        .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1163        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1165        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1166        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1167        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1168
    1169$C$DW$81        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1171        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1172        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1173        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e)
    1174        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1175        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1177        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1178        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1179        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1180
    1181$C$DW$82        .dwtag  DW_TAG_member
    1182        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1183        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1184        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1185        .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1186        .dwattr $C$DW$82, DW_AT_bit_size(0x1e)
    1187        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1189        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1190        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1191        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1192
    1193        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1194        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1195        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1196        .dwendtag $C$DW$T$30
    1197
    1198$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1199        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1200
    1201
    1202$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1203        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1204$C$DW$83        .dwtag  DW_TAG_member
    1205        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1206        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1207        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1208        .dwattr $C$DW$83, DW_AT_bit_offset(0x18)
    1209        .dwattr $C$DW$83, DW_AT_bit_size(0x08)
    1210        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   23

    1211        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1212        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1213        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1214        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1215
    1216$C$DW$84        .dwtag  DW_TAG_member
    1217        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1218        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1219        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1220        .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1221        .dwattr $C$DW$84, DW_AT_bit_size(0x18)
    1222        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1224        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1225        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1226        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1227
    1228        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1229        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1230        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1231        .dwendtag $C$DW$T$31
    1232
    1233$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1234        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1235
    1236
    1237$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1238        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1239$C$DW$85        .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$38)
    1241        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1242        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1243        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1245        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1246        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1247        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1248
    1249$C$DW$86        .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$40)
    1251        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1252        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1253        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1254        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1255        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1256        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1257        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1258
    1259$C$DW$87        .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$42)
    1261        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1262        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1263        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1264        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1265        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   24

    1266        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1267        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1268
    1269$C$DW$88        .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$44)
    1271        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1272        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1273        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1274        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1275        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1276        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1277        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1278
    1279$C$DW$89        .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$46)
    1281        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1282        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1283        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1284        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1286        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1287        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1288
    1289$C$DW$90        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$48)
    1291        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1292        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1293        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1294        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1295        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1296        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1297        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1298
    1299$C$DW$91        .dwtag  DW_TAG_member
    1300        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$50)
    1301        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1302        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1303        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1304        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1305        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1306        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1307        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1308
    1309$C$DW$92        .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$52)
    1311        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1312        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1313        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1314        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1315        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1316        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1317        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1318
    1319$C$DW$93        .dwtag  DW_TAG_member
    1320        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$54)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   25

    1321        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1322        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1323        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1324        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1325        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1326        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1327        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1328
    1329$C$DW$94        .dwtag  DW_TAG_member
    1330        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1331        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1332        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1333        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1334        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1335        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1336        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1337        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1338
    1339$C$DW$95        .dwtag  DW_TAG_member
    1340        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$56)
    1341        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1342        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1343        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1344        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1346        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1347        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1348
    1349$C$DW$96        .dwtag  DW_TAG_member
    1350        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1351        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1352        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1353        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1354        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1355        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1356        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1357        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1358
    1359$C$DW$97        .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$58)
    1361        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1362        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1363        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1364        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1365        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1366        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1367        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1368
    1369$C$DW$98        .dwtag  DW_TAG_member
    1370        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$60)
    1371        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1372        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1373        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1374        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1375        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   26

    1376        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1377        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1378
    1379$C$DW$99        .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1381        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1382        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1383        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1384        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1385        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1386        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1387        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1388
    1389$C$DW$100       .dwtag  DW_TAG_member
    1390        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$62)
    1391        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1392        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1393        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1394        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1395        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1396        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1397        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1398
    1399        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1400        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1401        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1402        .dwendtag $C$DW$T$35
    1403
    1404$C$DW$T$68      .dwtag  DW_TAG_typedef
    1405        .dwattr $C$DW$T$68, DW_AT_name("pruCfg")
    1406        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1407        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1408        .dwattr $C$DW$T$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1409        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1410        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1411
    1412$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1413        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1414
    1415
    1416$C$DW$T$38      .dwtag  DW_TAG_union_type
    1417        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1418$C$DW$101       .dwtag  DW_TAG_member
    1419        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$36)
    1420        .dwattr $C$DW$101, DW_AT_name("REVID")
    1421        .dwattr $C$DW$101, DW_AT_TI_symbol_name("REVID")
    1422        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1424        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1425        .dwattr $C$DW$101, DW_AT_decl_line(0x2a)
    1426        .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1427
    1428$C$DW$102       .dwtag  DW_TAG_member
    1429        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$37)
    1430        .dwattr $C$DW$102, DW_AT_name("REVID_bit")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   27

    1431        .dwattr $C$DW$102, DW_AT_TI_symbol_name("REVID_bit")
    1432        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1434        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1435        .dwattr $C$DW$102, DW_AT_decl_line(0x2e)
    1436        .dwattr $C$DW$102, DW_AT_decl_column(0x05)
    1437
    1438        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1439        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1440        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1441        .dwendtag $C$DW$T$38
    1442
    1443
    1444$C$DW$T$40      .dwtag  DW_TAG_union_type
    1445        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1446$C$DW$103       .dwtag  DW_TAG_member
    1447        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1448        .dwattr $C$DW$103, DW_AT_name("SYSCFG")
    1449        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SYSCFG")
    1450        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1452        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1453        .dwattr $C$DW$103, DW_AT_decl_line(0x34)
    1454        .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1455
    1456$C$DW$104       .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$39)
    1458        .dwattr $C$DW$104, DW_AT_name("SYSCFG_bit")
    1459        .dwattr $C$DW$104, DW_AT_TI_symbol_name("SYSCFG_bit")
    1460        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1462        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1463        .dwattr $C$DW$104, DW_AT_decl_line(0x3c)
    1464        .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1465
    1466        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1467        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1468        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1469        .dwendtag $C$DW$T$40
    1470
    1471
    1472$C$DW$T$42      .dwtag  DW_TAG_union_type
    1473        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1474$C$DW$105       .dwtag  DW_TAG_member
    1475        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1476        .dwattr $C$DW$105, DW_AT_name("GPCFG0")
    1477        .dwattr $C$DW$105, DW_AT_TI_symbol_name("GPCFG0")
    1478        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1480        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1481        .dwattr $C$DW$105, DW_AT_decl_line(0x42)
    1482        .dwattr $C$DW$105, DW_AT_decl_column(0x15)
    1483
    1484$C$DW$106       .dwtag  DW_TAG_member
    1485        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   28

    1486        .dwattr $C$DW$106, DW_AT_name("GPCFG0_bit")
    1487        .dwattr $C$DW$106, DW_AT_TI_symbol_name("GPCFG0_bit")
    1488        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1490        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1491        .dwattr $C$DW$106, DW_AT_decl_line(0x4f)
    1492        .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1493
    1494        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1495        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1496        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1497        .dwendtag $C$DW$T$42
    1498
    1499
    1500$C$DW$T$44      .dwtag  DW_TAG_union_type
    1501        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1502$C$DW$107       .dwtag  DW_TAG_member
    1503        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1504        .dwattr $C$DW$107, DW_AT_name("GPCFG1")
    1505        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG1")
    1506        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1508        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1509        .dwattr $C$DW$107, DW_AT_decl_line(0x55)
    1510        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1511
    1512$C$DW$108       .dwtag  DW_TAG_member
    1513        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$43)
    1514        .dwattr $C$DW$108, DW_AT_name("GPCFG1_bit")
    1515        .dwattr $C$DW$108, DW_AT_TI_symbol_name("GPCFG1_bit")
    1516        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1518        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1519        .dwattr $C$DW$108, DW_AT_decl_line(0x62)
    1520        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1521
    1522        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1523        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1524        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1525        .dwendtag $C$DW$T$44
    1526
    1527
    1528$C$DW$T$46      .dwtag  DW_TAG_union_type
    1529        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1530$C$DW$109       .dwtag  DW_TAG_member
    1531        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1532        .dwattr $C$DW$109, DW_AT_name("CGR")
    1533        .dwattr $C$DW$109, DW_AT_TI_symbol_name("CGR")
    1534        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1536        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1537        .dwattr $C$DW$109, DW_AT_decl_line(0x68)
    1538        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1539
    1540$C$DW$110       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   29

    1541        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$45)
    1542        .dwattr $C$DW$110, DW_AT_name("CGR_bit")
    1543        .dwattr $C$DW$110, DW_AT_TI_symbol_name("CGR_bit")
    1544        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1546        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1547        .dwattr $C$DW$110, DW_AT_decl_line(0x7e)
    1548        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1549
    1550        .dwattr $C$DW$T$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1551        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1552        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1553        .dwendtag $C$DW$T$46
    1554
    1555
    1556$C$DW$T$48      .dwtag  DW_TAG_union_type
    1557        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1558$C$DW$111       .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1560        .dwattr $C$DW$111, DW_AT_name("ISRP")
    1561        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ISRP")
    1562        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1564        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1565        .dwattr $C$DW$111, DW_AT_decl_line(0x84)
    1566        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1567
    1568$C$DW$112       .dwtag  DW_TAG_member
    1569        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$47)
    1570        .dwattr $C$DW$112, DW_AT_name("ISRP_bit")
    1571        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISRP_bit")
    1572        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1574        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1575        .dwattr $C$DW$112, DW_AT_decl_line(0x8d)
    1576        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1577
    1578        .dwattr $C$DW$T$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1579        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1580        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1581        .dwendtag $C$DW$T$48
    1582
    1583
    1584$C$DW$T$50      .dwtag  DW_TAG_union_type
    1585        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1586$C$DW$113       .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1588        .dwattr $C$DW$113, DW_AT_name("ISP")
    1589        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISP")
    1590        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1592        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1593        .dwattr $C$DW$113, DW_AT_decl_line(0x93)
    1594        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1595
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:27 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru0_main.asm                                                        PAGE   30

    1596$C$DW$114       .dwtag  DW_TAG_member
    1597        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$49)
    1598        .dwattr $C$DW$114, DW_AT_name("ISP_bit")
    1599        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ISP_bit")
    1600        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1602        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1603        .dwattr $C$DW$114, DW_AT_decl_line(0x9c)
    1604        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1605
    1606        .dwattr $C$DW$T$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1607        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1608        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1609        .dwendtag $C$DW$T$50
    1610
    1611
    1612$C$DW$T$52      .dwtag  DW_TAG_union_type
    1613        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1614$C$DW$115       .dwtag  DW_TAG_member
    1615        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1616        .dwattr $C$DW$115, DW_AT_name("IESP")
    1617        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESP")
    1618        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1620        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1621        .dwattr $C$DW$115, DW_AT_decl_line(0xa1)
    1622        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1623
    1624$C$DW$116       .dwtag  DW_TAG_member
    1625        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$51)
    1626        .dwattr $C$DW$116, DW_AT_name("IESP_bit")
    1627        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IESP_bit")
    1628        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1630        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1631        .dwattr $C$DW$116, DW_AT_decl_line(0xaa)
    1632        .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    1633
