PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:38 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_powercycle.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

     943        .dwcfi  restore_reg, 24
     944        .dwcfi  restore_reg, 25
     945        .dwcfi  restore_reg, 26
     946        .dwcfi  restore_reg, 27
     947 00000090 000000010BE2E2          ADD       r2, r2, 0x0b          ; [ALU_PRU] 
     948        .dwcfi  cfa_offset, 0
     949$C$DW$46        .dwtag  DW_TAG_TI_branch
     950        .dwattr $C$DW$46, DW_AT_low_pc(0x00)
     951        .dwattr $C$DW$46, DW_AT_TI_return
     952
     953 00000094 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     954        .dwattr $C$DW$39, DW_AT_TI_end_file("pru1_statemachine_powercycle.c")
     955        .dwattr $C$DW$39, DW_AT_TI_end_line(0x52)
     956        .dwattr $C$DW$39, DW_AT_TI_end_column(0x01)
     957        .dwendentry
     958        .dwendtag $C$DW$39
     959
     960 00000000                         .sect   ".text:sm_powercycle_start"
     961        .clink
     962        .global ||sm_powercycle_start||
     963
     964$C$DW$47        .dwtag  DW_TAG_subprogram
     965        .dwattr $C$DW$47, DW_AT_name("sm_powercycle_start")
     966        .dwattr $C$DW$47, DW_AT_low_pc(||sm_powercycle_start||)
     967        .dwattr $C$DW$47, DW_AT_high_pc(0x00)
     968        .dwattr $C$DW$47, DW_AT_TI_symbol_name("sm_powercycle_start")
     969        .dwattr $C$DW$47, DW_AT_external
     970        .dwattr $C$DW$47, DW_AT_TI_begin_file("pru1_statemachine_powercycle.c")
     971        .dwattr $C$DW$47, DW_AT_TI_begin_line(0x41)
     972        .dwattr $C$DW$47, DW_AT_TI_begin_column(0x06)
     973        .dwattr $C$DW$47, DW_AT_decl_file("pru1_statemachine_powercycle.c")
     974        .dwattr $C$DW$47, DW_AT_decl_line(0x41)
     975        .dwattr $C$DW$47, DW_AT_decl_column(0x06)
     976        .dwattr $C$DW$47, DW_AT_TI_max_frame_size(0x00)
     977        .dwpsn  file "pru1_statemachine_powercycle.c",line 65,column 28,is_stmt,address ||sm_powercycl
     978
     979        .dwfde $C$DW$CIE, ||sm_powercycle_start||
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   19

     980;----------------------------------------------------------------------
     981;  65 | void sm_powercycle_start() {                                           
     982;----------------------------------------------------------------------
     983
     984;***************************************************************
     985;* FNAME: sm_powercycle_start           FR SIZE:   0           *
     986;*                                                             *
     987;* FUNCTION ENVIRONMENT                                        *
     988;*                                                             *
     989;* FUNCTION PROPERTIES                                         *
     990;*                            0 Auto,  0 SOE     *
     991;***************************************************************
     992
     993 00000000                 ||sm_powercycle_start||:
     994;* --------------------------------------------------------------------------*
     995        .dwcfi  cfa_offset, 0
     996;*** 66 -----------------------    sm_powercycle.state = &sm_powercycle_state_1;
     997;***    -----------------------    return;
     998        .dwpsn  file "pru1_statemachine_powercycle.c",line 66,column 2,is_stmt,isa 0
     999;----------------------------------------------------------------------
    1000;  66 | sm_powercycle.state = &sm_powercycle_state_1;                          
    1001;  67 | // next call to sm_slave.state() starts state machine                  
    1002;----------------------------------------------------------------------
    1003 00000000 000000240000E0!         LDI       r0, ||sm_powercycle|| ; [ALU_PRU] |66| sm_powercycle
    1004 00000004 00000024000081!         LDI       r1.w0, $CODE(||sm_powercycle_state_1||) ; [ALU_PRU] |66| sm_powercycle_state_1
    1005 00000008 000000E1000081          SBBO      &r1.w0, r0, 0, 2      ; [ALU_PRU] |66| 
    1006$C$DW$48        .dwtag  DW_TAG_TI_branch
    1007        .dwattr $C$DW$48, DW_AT_low_pc(0x00)
    1008        .dwattr $C$DW$48, DW_AT_TI_return
    1009
    1010 0000000c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1011        .dwattr $C$DW$47, DW_AT_TI_end_file("pru1_statemachine_powercycle.c")
    1012        .dwattr $C$DW$47, DW_AT_TI_end_line(0x44)
    1013        .dwattr $C$DW$47, DW_AT_TI_end_column(0x01)
    1014        .dwendentry
    1015        .dwendtag $C$DW$47
    1016
    1017;*****************************************************************************
    1018;* UNDEFINED EXTERNAL REFERENCES                                             *
    1019;*****************************************************************************
    1020        .global ||timeout_target||
    1021        .global ||buslatches||
    1022        .global ||buslatches_pru0_dataout||
    1023        .global ||do_event_initializationsignals||
    1024
    1025;******************************************************************************
    1026;* TYPE INFORMATION                                                           *
    1027;******************************************************************************
    1028
    1029$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1030        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1031$C$DW$49        .dwtag  DW_TAG_member
    1032        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
    1033        .dwattr $C$DW$49, DW_AT_name("REVID")
    1034        .dwattr $C$DW$49, DW_AT_TI_symbol_name("REVID")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   20

    1035        .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
    1036        .dwattr $C$DW$49, DW_AT_bit_size(0x20)
    1037        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1039        .dwattr $C$DW$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1040        .dwattr $C$DW$49, DW_AT_decl_line(0x2d)
    1041        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1042
    1043        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1044        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1045        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1046        .dwendtag $C$DW$T$19
    1047
    1048$C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1049        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$19)
    1050
    1051
    1052$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1053        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1054$C$DW$50        .dwtag  DW_TAG_member
    1055        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
    1056        .dwattr $C$DW$50, DW_AT_name("IDLE_MODE")
    1057        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IDLE_MODE")
    1058        .dwattr $C$DW$50, DW_AT_bit_offset(0x1e)
    1059        .dwattr $C$DW$50, DW_AT_bit_size(0x02)
    1060        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1062        .dwattr $C$DW$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1063        .dwattr $C$DW$50, DW_AT_decl_line(0x37)
    1064        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
    1065
    1066$C$DW$51        .dwtag  DW_TAG_member
    1067        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
    1068        .dwattr $C$DW$51, DW_AT_name("STANDBY_MODE")
    1069        .dwattr $C$DW$51, DW_AT_TI_symbol_name("STANDBY_MODE")
    1070        .dwattr $C$DW$51, DW_AT_bit_offset(0x1c)
    1071        .dwattr $C$DW$51, DW_AT_bit_size(0x02)
    1072        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1074        .dwattr $C$DW$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1075        .dwattr $C$DW$51, DW_AT_decl_line(0x38)
    1076        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
    1077
    1078$C$DW$52        .dwtag  DW_TAG_member
    1079        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
    1080        .dwattr $C$DW$52, DW_AT_name("STANDBY_INIT")
    1081        .dwattr $C$DW$52, DW_AT_TI_symbol_name("STANDBY_INIT")
    1082        .dwattr $C$DW$52, DW_AT_bit_offset(0x1b)
    1083        .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1084        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1086        .dwattr $C$DW$52, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1087        .dwattr $C$DW$52, DW_AT_decl_line(0x39)
    1088        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1089
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   21

    1090$C$DW$53        .dwtag  DW_TAG_member
    1091        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
    1092        .dwattr $C$DW$53, DW_AT_name("SUB_MWAIT")
    1093        .dwattr $C$DW$53, DW_AT_TI_symbol_name("SUB_MWAIT")
    1094        .dwattr $C$DW$53, DW_AT_bit_offset(0x1a)
    1095        .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1096        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1098        .dwattr $C$DW$53, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1099        .dwattr $C$DW$53, DW_AT_decl_line(0x3a)
    1100        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
    1101
    1102$C$DW$54        .dwtag  DW_TAG_member
    1103        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
    1104        .dwattr $C$DW$54, DW_AT_name("rsvd6")
    1105        .dwattr $C$DW$54, DW_AT_TI_symbol_name("rsvd6")
    1106        .dwattr $C$DW$54, DW_AT_bit_offset(0x00)
    1107        .dwattr $C$DW$54, DW_AT_bit_size(0x1a)
    1108        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1110        .dwattr $C$DW$54, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1111        .dwattr $C$DW$54, DW_AT_decl_line(0x3b)
    1112        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
    1113
    1114        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1115        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1116        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1117        .dwendtag $C$DW$T$20
    1118
    1119$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1120        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
    1121
    1122
    1123$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1124        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1125$C$DW$55        .dwtag  DW_TAG_member
    1126        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
    1127        .dwattr $C$DW$55, DW_AT_name("PRU0_GPI_MODE")
    1128        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1129        .dwattr $C$DW$55, DW_AT_bit_offset(0x1e)
    1130        .dwattr $C$DW$55, DW_AT_bit_size(0x02)
    1131        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1133        .dwattr $C$DW$55, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1134        .dwattr $C$DW$55, DW_AT_decl_line(0x45)
    1135        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1136
    1137$C$DW$56        .dwtag  DW_TAG_member
    1138        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1139        .dwattr $C$DW$56, DW_AT_name("PRU0_GPI_CLK_MODE")
    1140        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1141        .dwattr $C$DW$56, DW_AT_bit_offset(0x1d)
    1142        .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1143        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   22

    1145        .dwattr $C$DW$56, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1146        .dwattr $C$DW$56, DW_AT_decl_line(0x46)
    1147        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1148
    1149$C$DW$57        .dwtag  DW_TAG_member
    1150        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1151        .dwattr $C$DW$57, DW_AT_name("PRU0_GPI_DIV0")
    1152        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1153        .dwattr $C$DW$57, DW_AT_bit_offset(0x18)
    1154        .dwattr $C$DW$57, DW_AT_bit_size(0x05)
    1155        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1157        .dwattr $C$DW$57, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1158        .dwattr $C$DW$57, DW_AT_decl_line(0x47)
    1159        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1160
    1161$C$DW$58        .dwtag  DW_TAG_member
    1162        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1163        .dwattr $C$DW$58, DW_AT_name("PRU0_GPI_DIV1")
    1164        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1165        .dwattr $C$DW$58, DW_AT_bit_offset(0x13)
    1166        .dwattr $C$DW$58, DW_AT_bit_size(0x05)
    1167        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1169        .dwattr $C$DW$58, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1170        .dwattr $C$DW$58, DW_AT_decl_line(0x48)
    1171        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1172
    1173$C$DW$59        .dwtag  DW_TAG_member
    1174        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1175        .dwattr $C$DW$59, DW_AT_name("PRU0_GPI_SB")
    1176        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1177        .dwattr $C$DW$59, DW_AT_bit_offset(0x12)
    1178        .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1179        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1181        .dwattr $C$DW$59, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1182        .dwattr $C$DW$59, DW_AT_decl_line(0x49)
    1183        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1184
    1185$C$DW$60        .dwtag  DW_TAG_member
    1186        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1187        .dwattr $C$DW$60, DW_AT_name("PRU0_GPO_MODE")
    1188        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1189        .dwattr $C$DW$60, DW_AT_bit_offset(0x11)
    1190        .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1191        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$60, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1194        .dwattr $C$DW$60, DW_AT_decl_line(0x4a)
    1195        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1196
    1197$C$DW$61        .dwtag  DW_TAG_member
    1198        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1199        .dwattr $C$DW$61, DW_AT_name("PRU0_GPO_DIV0")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   23

    1200        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1201        .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
    1202        .dwattr $C$DW$61, DW_AT_bit_size(0x05)
    1203        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1205        .dwattr $C$DW$61, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1206        .dwattr $C$DW$61, DW_AT_decl_line(0x4b)
    1207        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1208
    1209$C$DW$62        .dwtag  DW_TAG_member
    1210        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1211        .dwattr $C$DW$62, DW_AT_name("PRU0_GPO_DIV1")
    1212        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1213        .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
    1214        .dwattr $C$DW$62, DW_AT_bit_size(0x05)
    1215        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1217        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1218        .dwattr $C$DW$62, DW_AT_decl_line(0x4c)
    1219        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1220
    1221$C$DW$63        .dwtag  DW_TAG_member
    1222        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1223        .dwattr $C$DW$63, DW_AT_name("PRU0_GPO_SH_SEL")
    1224        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1225        .dwattr $C$DW$63, DW_AT_bit_offset(0x06)
    1226        .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1227        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1229        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1230        .dwattr $C$DW$63, DW_AT_decl_line(0x4d)
    1231        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1232
    1233$C$DW$64        .dwtag  DW_TAG_member
    1234        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1235        .dwattr $C$DW$64, DW_AT_name("rsvd26")
    1236        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd26")
    1237        .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
    1238        .dwattr $C$DW$64, DW_AT_bit_size(0x06)
    1239        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1241        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1242        .dwattr $C$DW$64, DW_AT_decl_line(0x4e)
    1243        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1244
    1245        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1246        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1247        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1248        .dwendtag $C$DW$T$21
    1249
    1250$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1251        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$21)
    1252
    1253
    1254$C$DW$T$22      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   24

    1255        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1256$C$DW$65        .dwtag  DW_TAG_member
    1257        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1258        .dwattr $C$DW$65, DW_AT_name("PRU1_GPI_MODE")
    1259        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1260        .dwattr $C$DW$65, DW_AT_bit_offset(0x1e)
    1261        .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1262        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1264        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1265        .dwattr $C$DW$65, DW_AT_decl_line(0x58)
    1266        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1267
    1268$C$DW$66        .dwtag  DW_TAG_member
    1269        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1270        .dwattr $C$DW$66, DW_AT_name("PRU1_GPI_CLK_MODE")
    1271        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1272        .dwattr $C$DW$66, DW_AT_bit_offset(0x1d)
    1273        .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1274        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1277        .dwattr $C$DW$66, DW_AT_decl_line(0x59)
    1278        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1279
    1280$C$DW$67        .dwtag  DW_TAG_member
    1281        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1282        .dwattr $C$DW$67, DW_AT_name("PRU1_GPI_DIV0")
    1283        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1284        .dwattr $C$DW$67, DW_AT_bit_offset(0x18)
    1285        .dwattr $C$DW$67, DW_AT_bit_size(0x05)
    1286        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1288        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1289        .dwattr $C$DW$67, DW_AT_decl_line(0x5a)
    1290        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1291
    1292$C$DW$68        .dwtag  DW_TAG_member
    1293        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1294        .dwattr $C$DW$68, DW_AT_name("PRU1_GPI_DIV1")
    1295        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1296        .dwattr $C$DW$68, DW_AT_bit_offset(0x13)
    1297        .dwattr $C$DW$68, DW_AT_bit_size(0x05)
    1298        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1300        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1301        .dwattr $C$DW$68, DW_AT_decl_line(0x5b)
    1302        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1303
    1304$C$DW$69        .dwtag  DW_TAG_member
    1305        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1306        .dwattr $C$DW$69, DW_AT_name("PRU1_GPI_SB")
    1307        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1308        .dwattr $C$DW$69, DW_AT_bit_offset(0x12)
    1309        .dwattr $C$DW$69, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   25

    1310        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1312        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1313        .dwattr $C$DW$69, DW_AT_decl_line(0x5c)
    1314        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1315
    1316$C$DW$70        .dwtag  DW_TAG_member
    1317        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1318        .dwattr $C$DW$70, DW_AT_name("PRU1_GPO_MODE")
    1319        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1320        .dwattr $C$DW$70, DW_AT_bit_offset(0x11)
    1321        .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1322        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1324        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1325        .dwattr $C$DW$70, DW_AT_decl_line(0x5d)
    1326        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1327
    1328$C$DW$71        .dwtag  DW_TAG_member
    1329        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1330        .dwattr $C$DW$71, DW_AT_name("PRU1_GPO_DIV0")
    1331        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1332        .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
    1333        .dwattr $C$DW$71, DW_AT_bit_size(0x05)
    1334        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1336        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1337        .dwattr $C$DW$71, DW_AT_decl_line(0x5e)
    1338        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1339
    1340$C$DW$72        .dwtag  DW_TAG_member
    1341        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1342        .dwattr $C$DW$72, DW_AT_name("PRU1_GPO_DIV1")
    1343        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1344        .dwattr $C$DW$72, DW_AT_bit_offset(0x07)
    1345        .dwattr $C$DW$72, DW_AT_bit_size(0x05)
    1346        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1348        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1349        .dwattr $C$DW$72, DW_AT_decl_line(0x5f)
    1350        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1351
    1352$C$DW$73        .dwtag  DW_TAG_member
    1353        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1354        .dwattr $C$DW$73, DW_AT_name("PRU1_GPO_SH_SEL")
    1355        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1356        .dwattr $C$DW$73, DW_AT_bit_offset(0x06)
    1357        .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1358        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1360        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1361        .dwattr $C$DW$73, DW_AT_decl_line(0x60)
    1362        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1363
    1364$C$DW$74        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   26

    1365        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1366        .dwattr $C$DW$74, DW_AT_name("rsvd26")
    1367        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd26")
    1368        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1369        .dwattr $C$DW$74, DW_AT_bit_size(0x06)
    1370        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1372        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1373        .dwattr $C$DW$74, DW_AT_decl_line(0x61)
    1374        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1375
    1376        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1377        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1378        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1379        .dwendtag $C$DW$T$22
    1380
    1381$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1382        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$22)
    1383
    1384
    1385$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1386        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1387$C$DW$75        .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1389        .dwattr $C$DW$75, DW_AT_name("PRU0_CLK_STOP_REQ")
    1390        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1391        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f)
    1392        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1393        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1395        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1396        .dwattr $C$DW$75, DW_AT_decl_line(0x6b)
    1397        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1398
    1399$C$DW$76        .dwtag  DW_TAG_member
    1400        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1401        .dwattr $C$DW$76, DW_AT_name("PRU0_CLK_STOP_ACK")
    1402        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1403        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e)
    1404        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1405        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1407        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1408        .dwattr $C$DW$76, DW_AT_decl_line(0x6c)
    1409        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1410
    1411$C$DW$77        .dwtag  DW_TAG_member
    1412        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1413        .dwattr $C$DW$77, DW_AT_name("PRU0_CLK_EN")
    1414        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1415        .dwattr $C$DW$77, DW_AT_bit_offset(0x1d)
    1416        .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1417        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1419        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   27

    1420        .dwattr $C$DW$77, DW_AT_decl_line(0x6d)
    1421        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1422
    1423$C$DW$78        .dwtag  DW_TAG_member
    1424        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1425        .dwattr $C$DW$78, DW_AT_name("PRU1_CLK_STOP_REQ")
    1426        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1427        .dwattr $C$DW$78, DW_AT_bit_offset(0x1c)
    1428        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1429        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1431        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1432        .dwattr $C$DW$78, DW_AT_decl_line(0x6e)
    1433        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1434
    1435$C$DW$79        .dwtag  DW_TAG_member
    1436        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1437        .dwattr $C$DW$79, DW_AT_name("PRU1_CLK_STOP_ACK")
    1438        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1439        .dwattr $C$DW$79, DW_AT_bit_offset(0x1b)
    1440        .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1441        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1443        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1444        .dwattr $C$DW$79, DW_AT_decl_line(0x6f)
    1445        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1446
    1447$C$DW$80        .dwtag  DW_TAG_member
    1448        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1449        .dwattr $C$DW$80, DW_AT_name("PRU1_CLK_EN")
    1450        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1451        .dwattr $C$DW$80, DW_AT_bit_offset(0x1a)
    1452        .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1453        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1455        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1456        .dwattr $C$DW$80, DW_AT_decl_line(0x70)
    1457        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1458
    1459$C$DW$81        .dwtag  DW_TAG_member
    1460        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1461        .dwattr $C$DW$81, DW_AT_name("INTC_CLK_STOP_REQ")
    1462        .dwattr $C$DW$81, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1463        .dwattr $C$DW$81, DW_AT_bit_offset(0x19)
    1464        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1465        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1467        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1468        .dwattr $C$DW$81, DW_AT_decl_line(0x71)
    1469        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1470
    1471$C$DW$82        .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1473        .dwattr $C$DW$82, DW_AT_name("INTC_CLK_STOP_ACK")
    1474        .dwattr $C$DW$82, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   28

    1475        .dwattr $C$DW$82, DW_AT_bit_offset(0x18)
    1476        .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1477        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1479        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1480        .dwattr $C$DW$82, DW_AT_decl_line(0x72)
    1481        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1482
    1483$C$DW$83        .dwtag  DW_TAG_member
    1484        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1485        .dwattr $C$DW$83, DW_AT_name("INTC_CLK_EN")
    1486        .dwattr $C$DW$83, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1487        .dwattr $C$DW$83, DW_AT_bit_offset(0x17)
    1488        .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1489        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1491        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1492        .dwattr $C$DW$83, DW_AT_decl_line(0x73)
    1493        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1494
    1495$C$DW$84        .dwtag  DW_TAG_member
    1496        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1497        .dwattr $C$DW$84, DW_AT_name("UART_CLK_STOP_REQ")
    1498        .dwattr $C$DW$84, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1499        .dwattr $C$DW$84, DW_AT_bit_offset(0x16)
    1500        .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1501        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1503        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1504        .dwattr $C$DW$84, DW_AT_decl_line(0x74)
    1505        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1506
    1507$C$DW$85        .dwtag  DW_TAG_member
    1508        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1509        .dwattr $C$DW$85, DW_AT_name("UART_CLK_STOP_ACK")
    1510        .dwattr $C$DW$85, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1511        .dwattr $C$DW$85, DW_AT_bit_offset(0x15)
    1512        .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1513        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1515        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1516        .dwattr $C$DW$85, DW_AT_decl_line(0x75)
    1517        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1518
    1519$C$DW$86        .dwtag  DW_TAG_member
    1520        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1521        .dwattr $C$DW$86, DW_AT_name("UART_CLK_EN")
    1522        .dwattr $C$DW$86, DW_AT_TI_symbol_name("UART_CLK_EN")
    1523        .dwattr $C$DW$86, DW_AT_bit_offset(0x14)
    1524        .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1525        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1526        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1527        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1528        .dwattr $C$DW$86, DW_AT_decl_line(0x76)
    1529        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   29

    1530
    1531$C$DW$87        .dwtag  DW_TAG_member
    1532        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1533        .dwattr $C$DW$87, DW_AT_name("ECAP_CLK_STOP_REQ")
    1534        .dwattr $C$DW$87, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1535        .dwattr $C$DW$87, DW_AT_bit_offset(0x13)
    1536        .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1537        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1539        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1540        .dwattr $C$DW$87, DW_AT_decl_line(0x77)
    1541        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1542
    1543$C$DW$88        .dwtag  DW_TAG_member
    1544        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1545        .dwattr $C$DW$88, DW_AT_name("ECAP_CLK_STOP_ACK")
    1546        .dwattr $C$DW$88, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1547        .dwattr $C$DW$88, DW_AT_bit_offset(0x12)
    1548        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1549        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1551        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1552        .dwattr $C$DW$88, DW_AT_decl_line(0x78)
    1553        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1554
    1555$C$DW$89        .dwtag  DW_TAG_member
    1556        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1557        .dwattr $C$DW$89, DW_AT_name("ECAP_CLK_EN")
    1558        .dwattr $C$DW$89, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1559        .dwattr $C$DW$89, DW_AT_bit_offset(0x11)
    1560        .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1561        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1563        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1564        .dwattr $C$DW$89, DW_AT_decl_line(0x79)
    1565        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1566
    1567$C$DW$90        .dwtag  DW_TAG_member
    1568        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1569        .dwattr $C$DW$90, DW_AT_name("IEP_CLK_STOP_REQ")
    1570        .dwattr $C$DW$90, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1571        .dwattr $C$DW$90, DW_AT_bit_offset(0x10)
    1572        .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1573        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1575        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1576        .dwattr $C$DW$90, DW_AT_decl_line(0x7a)
    1577        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1578
    1579$C$DW$91        .dwtag  DW_TAG_member
    1580        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1581        .dwattr $C$DW$91, DW_AT_name("IEP_CLK_STOP_ACK")
    1582        .dwattr $C$DW$91, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1583        .dwattr $C$DW$91, DW_AT_bit_offset(0x0f)
    1584        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   30

    1585        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1587        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1588        .dwattr $C$DW$91, DW_AT_decl_line(0x7b)
    1589        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1590
    1591$C$DW$92        .dwtag  DW_TAG_member
    1592        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1593        .dwattr $C$DW$92, DW_AT_name("IEP_CLK_EN")
    1594        .dwattr $C$DW$92, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1595        .dwattr $C$DW$92, DW_AT_bit_offset(0x0e)
    1596        .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1597        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1599        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1600        .dwattr $C$DW$92, DW_AT_decl_line(0x7c)
    1601        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1602
    1603$C$DW$93        .dwtag  DW_TAG_member
    1604        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1605        .dwattr $C$DW$93, DW_AT_name("rsvd18")
    1606        .dwattr $C$DW$93, DW_AT_TI_symbol_name("rsvd18")
    1607        .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    1608        .dwattr $C$DW$93, DW_AT_bit_size(0x0e)
    1609        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1611        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1612        .dwattr $C$DW$93, DW_AT_decl_line(0x7d)
    1613        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1614
    1615        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1616        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1617        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1618        .dwendtag $C$DW$T$23
    1619
    1620$C$DW$T$63      .dwtag  DW_TAG_volatile_type
    1621        .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$23)
    1622
    1623
    1624$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1625        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1626$C$DW$94        .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$94, DW_AT_name("PRU0_IMEM_PE_RAW")
    1629        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1630        .dwattr $C$DW$94, DW_AT_bit_offset(0x1c)
    1631        .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1632        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1634        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1635        .dwattr $C$DW$94, DW_AT_decl_line(0x87)
    1636        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1637
    1638$C$DW$95        .dwtag  DW_TAG_member
    1639        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   31

    1640        .dwattr $C$DW$95, DW_AT_name("PRU0_DMEM_PE_RAW")
    1641        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1642        .dwattr $C$DW$95, DW_AT_bit_offset(0x18)
    1643        .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1644        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1646        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1647        .dwattr $C$DW$95, DW_AT_decl_line(0x88)
    1648        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1649
    1650$C$DW$96        .dwtag  DW_TAG_member
    1651        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1652        .dwattr $C$DW$96, DW_AT_name("PRU1_IMEM_PE_RAW")
    1653        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1654        .dwattr $C$DW$96, DW_AT_bit_offset(0x14)
    1655        .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1656        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1658        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1659        .dwattr $C$DW$96, DW_AT_decl_line(0x89)
    1660        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1661
    1662$C$DW$97        .dwtag  DW_TAG_member
    1663        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1664        .dwattr $C$DW$97, DW_AT_name("PRU1_DMEM_PE_RAW")
    1665        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1666        .dwattr $C$DW$97, DW_AT_bit_offset(0x10)
    1667        .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1668        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1670        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1671        .dwattr $C$DW$97, DW_AT_decl_line(0x8a)
    1672        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1673
    1674$C$DW$98        .dwtag  DW_TAG_member
    1675        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1676        .dwattr $C$DW$98, DW_AT_name("RAM_PE_RAW")
    1677        .dwattr $C$DW$98, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1678        .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1679        .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1680        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1682        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1683        .dwattr $C$DW$98, DW_AT_decl_line(0x8b)
    1684        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1685
    1686$C$DW$99        .dwtag  DW_TAG_member
    1687        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$99, DW_AT_name("rsvd20")
    1689        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd20")
    1690        .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1691        .dwattr $C$DW$99, DW_AT_bit_size(0x0c)
    1692        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1694        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   32

    1695        .dwattr $C$DW$99, DW_AT_decl_line(0x8c)
    1696        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1697
    1698        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1699        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1700        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1701        .dwendtag $C$DW$T$24
    1702
    1703$C$DW$T$65      .dwtag  DW_TAG_volatile_type
    1704        .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$24)
    1705
    1706
    1707$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1708        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1709$C$DW$100       .dwtag  DW_TAG_member
    1710        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1711        .dwattr $C$DW$100, DW_AT_name("PRU0_IMEM_PE")
    1712        .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1713        .dwattr $C$DW$100, DW_AT_bit_offset(0x1c)
    1714        .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1715        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1717        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1718        .dwattr $C$DW$100, DW_AT_decl_line(0x96)
    1719        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1720
    1721$C$DW$101       .dwtag  DW_TAG_member
    1722        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1723        .dwattr $C$DW$101, DW_AT_name("PRU0_DMEM_PE")
    1724        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1725        .dwattr $C$DW$101, DW_AT_bit_offset(0x18)
    1726        .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1727        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1729        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1730        .dwattr $C$DW$101, DW_AT_decl_line(0x97)
    1731        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1732
    1733$C$DW$102       .dwtag  DW_TAG_member
    1734        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1735        .dwattr $C$DW$102, DW_AT_name("PRU1_IMEM_PE")
    1736        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1737        .dwattr $C$DW$102, DW_AT_bit_offset(0x14)
    1738        .dwattr $C$DW$102, DW_AT_bit_size(0x04)
    1739        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1741        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1742        .dwattr $C$DW$102, DW_AT_decl_line(0x98)
    1743        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1744
    1745$C$DW$103       .dwtag  DW_TAG_member
    1746        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1747        .dwattr $C$DW$103, DW_AT_name("PRU1_DMEM_PE")
    1748        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1749        .dwattr $C$DW$103, DW_AT_bit_offset(0x10)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   33

    1750        .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1751        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1754        .dwattr $C$DW$103, DW_AT_decl_line(0x99)
    1755        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1756
    1757$C$DW$104       .dwtag  DW_TAG_member
    1758        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1759        .dwattr $C$DW$104, DW_AT_name("RAM_PE")
    1760        .dwattr $C$DW$104, DW_AT_TI_symbol_name("RAM_PE")
    1761        .dwattr $C$DW$104, DW_AT_bit_offset(0x0c)
    1762        .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1763        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1765        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1766        .dwattr $C$DW$104, DW_AT_decl_line(0x9a)
    1767        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1768
    1769$C$DW$105       .dwtag  DW_TAG_member
    1770        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1771        .dwattr $C$DW$105, DW_AT_name("rsvd20")
    1772        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd20")
    1773        .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1774        .dwattr $C$DW$105, DW_AT_bit_size(0x0c)
    1775        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1777        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1778        .dwattr $C$DW$105, DW_AT_decl_line(0x9b)
    1779        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1780
    1781        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1782        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1783        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1784        .dwendtag $C$DW$T$25
    1785
    1786$C$DW$T$67      .dwtag  DW_TAG_volatile_type
    1787        .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$25)
    1788
    1789
    1790$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1791        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1792$C$DW$106       .dwtag  DW_TAG_member
    1793        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1794        .dwattr $C$DW$106, DW_AT_name("PRU0_IMEM_PE_SET")
    1795        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1796        .dwattr $C$DW$106, DW_AT_bit_offset(0x1c)
    1797        .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1798        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1800        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1801        .dwattr $C$DW$106, DW_AT_decl_line(0xa4)
    1802        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1803
    1804$C$DW$107       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   34

    1805        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1806        .dwattr $C$DW$107, DW_AT_name("PRU0_DMEM_PE_SET")
    1807        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1808        .dwattr $C$DW$107, DW_AT_bit_offset(0x18)
    1809        .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1810        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1812        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1813        .dwattr $C$DW$107, DW_AT_decl_line(0xa5)
    1814        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1815
    1816$C$DW$108       .dwtag  DW_TAG_member
    1817        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1818        .dwattr $C$DW$108, DW_AT_name("PRU1_IMEM_PE_SET")
    1819        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1820        .dwattr $C$DW$108, DW_AT_bit_offset(0x14)
    1821        .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1822        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1823        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1824        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1825        .dwattr $C$DW$108, DW_AT_decl_line(0xa6)
    1826        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1827
    1828$C$DW$109       .dwtag  DW_TAG_member
    1829        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1830        .dwattr $C$DW$109, DW_AT_name("PRU1_DMEM_PE_SET")
    1831        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1832        .dwattr $C$DW$109, DW_AT_bit_offset(0x10)
    1833        .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1834        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1836        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1837        .dwattr $C$DW$109, DW_AT_decl_line(0xa7)
    1838        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1839
    1840$C$DW$110       .dwtag  DW_TAG_member
    1841        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1842        .dwattr $C$DW$110, DW_AT_name("RAM_PE_SET")
    1843        .dwattr $C$DW$110, DW_AT_TI_symbol_name("RAM_PE_SET")
    1844        .dwattr $C$DW$110, DW_AT_bit_offset(0x0c)
    1845        .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1846        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1847        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1848        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1849        .dwattr $C$DW$110, DW_AT_decl_line(0xa8)
    1850        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1851
    1852$C$DW$111       .dwtag  DW_TAG_member
    1853        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1854        .dwattr $C$DW$111, DW_AT_name("rsvd20")
    1855        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd20")
    1856        .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1857        .dwattr $C$DW$111, DW_AT_bit_size(0x0c)
    1858        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   35

    1860        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1861        .dwattr $C$DW$111, DW_AT_decl_line(0xa9)
    1862        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1863
    1864        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1865        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1866        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1867        .dwendtag $C$DW$T$26
    1868
    1869$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1870        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    1871
    1872
    1873$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1874        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1875$C$DW$112       .dwtag  DW_TAG_member
    1876        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1877        .dwattr $C$DW$112, DW_AT_name("PRU0_IMEM_PE_CLR")
    1878        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1879        .dwattr $C$DW$112, DW_AT_bit_offset(0x1c)
    1880        .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1881        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1883        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1884        .dwattr $C$DW$112, DW_AT_decl_line(0xb3)
    1885        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1886
    1887$C$DW$113       .dwtag  DW_TAG_member
    1888        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1889        .dwattr $C$DW$113, DW_AT_name("PRU0_DMEM_PE_CLR")
    1890        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1891        .dwattr $C$DW$113, DW_AT_bit_offset(0x18)
    1892        .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1893        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1895        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1896        .dwattr $C$DW$113, DW_AT_decl_line(0xb4)
    1897        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1898
    1899$C$DW$114       .dwtag  DW_TAG_member
    1900        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1901        .dwattr $C$DW$114, DW_AT_name("PRU1_IMEM_PE_CLR")
    1902        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1903        .dwattr $C$DW$114, DW_AT_bit_offset(0x14)
    1904        .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    1905        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1906        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1907        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1908        .dwattr $C$DW$114, DW_AT_decl_line(0xb5)
    1909        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1910
    1911$C$DW$115       .dwtag  DW_TAG_member
    1912        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1913        .dwattr $C$DW$115, DW_AT_name("PRU1_DMEM_PE_CLR")
    1914        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   36

    1915        .dwattr $C$DW$115, DW_AT_bit_offset(0x10)
    1916        .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1917        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1918        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1919        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1920        .dwattr $C$DW$115, DW_AT_decl_line(0xb6)
    1921        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1922
    1923$C$DW$116       .dwtag  DW_TAG_member
    1924        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1925        .dwattr $C$DW$116, DW_AT_name("rsvd16")
    1926        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd16")
    1927        .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1928        .dwattr $C$DW$116, DW_AT_bit_size(0x10)
    1929        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1931        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1932        .dwattr $C$DW$116, DW_AT_decl_line(0xb7)
    1933        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1934
    1935        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1936        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1937        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1938        .dwendtag $C$DW$T$27
    1939
    1940$C$DW$T$71      .dwtag  DW_TAG_volatile_type
    1941        .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$27)
    1942
    1943
    1944$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1945        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1946$C$DW$117       .dwtag  DW_TAG_member
    1947        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1948        .dwattr $C$DW$117, DW_AT_name("PMAO_PRU0")
    1949        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PMAO_PRU0")
    1950        .dwattr $C$DW$117, DW_AT_bit_offset(0x1f)
    1951        .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1952        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1954        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1955        .dwattr $C$DW$117, DW_AT_decl_line(0xc4)
    1956        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1957
    1958$C$DW$118       .dwtag  DW_TAG_member
    1959        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1960        .dwattr $C$DW$118, DW_AT_name("PMAO_PRU1")
    1961        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PMAO_PRU1")
    1962        .dwattr $C$DW$118, DW_AT_bit_offset(0x1e)
    1963        .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1964        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1966        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1967        .dwattr $C$DW$118, DW_AT_decl_line(0xc5)
    1968        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1969
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   37

    1970$C$DW$119       .dwtag  DW_TAG_member
    1971        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1972        .dwattr $C$DW$119, DW_AT_name("rsvd2")
    1973        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd2")
    1974        .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1975        .dwattr $C$DW$119, DW_AT_bit_size(0x1e)
    1976        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1978        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1979        .dwattr $C$DW$119, DW_AT_decl_line(0xc6)
    1980        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1981
    1982        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1983        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1984        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1985        .dwendtag $C$DW$T$28
    1986
    1987$C$DW$T$73      .dwtag  DW_TAG_volatile_type
    1988        .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$28)
    1989
    1990
    1991$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1992        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1993$C$DW$120       .dwtag  DW_TAG_member
    1994        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1995        .dwattr $C$DW$120, DW_AT_name("OCP_EN")
    1996        .dwattr $C$DW$120, DW_AT_TI_symbol_name("OCP_EN")
    1997        .dwattr $C$DW$120, DW_AT_bit_offset(0x1f)
    1998        .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1999        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2001        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2002        .dwattr $C$DW$120, DW_AT_decl_line(0xd3)
    2003        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2004
    2005$C$DW$121       .dwtag  DW_TAG_member
    2006        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2007        .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2008        .dwattr $C$DW$121, DW_AT_TI_symbol_name("rsvd1")
    2009        .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    2010        .dwattr $C$DW$121, DW_AT_bit_size(0x1f)
    2011        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2014        .dwattr $C$DW$121, DW_AT_decl_line(0xd4)
    2015        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2016
    2017        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2018        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2019        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2020        .dwendtag $C$DW$T$29
    2021
    2022$C$DW$T$75      .dwtag  DW_TAG_volatile_type
    2023        .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$29)
    2024
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   38

    2025
    2026$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2027        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2028$C$DW$122       .dwtag  DW_TAG_member
    2029        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2030        .dwattr $C$DW$122, DW_AT_name("PRU1_PAD_HP_EN")
    2031        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2032        .dwattr $C$DW$122, DW_AT_bit_offset(0x1f)
    2033        .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2034        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2036        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2037        .dwattr $C$DW$122, DW_AT_decl_line(0xde)
    2038        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2039
    2040$C$DW$123       .dwtag  DW_TAG_member
    2041        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2042        .dwattr $C$DW$123, DW_AT_name("XFR_SHIFT_EN")
    2043        .dwattr $C$DW$123, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2044        .dwattr $C$DW$123, DW_AT_bit_offset(0x1e)
    2045        .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2046        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2048        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2049        .dwattr $C$DW$123, DW_AT_decl_line(0xdf)
    2050        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2051
    2052$C$DW$124       .dwtag  DW_TAG_member
    2053        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2054        .dwattr $C$DW$124, DW_AT_name("rsvd2")
    2055        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd2")
    2056        .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2057        .dwattr $C$DW$124, DW_AT_bit_size(0x1e)
    2058        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2060        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2061        .dwattr $C$DW$124, DW_AT_decl_line(0xe0)
    2062        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2063
    2064        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2065        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2066        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2067        .dwendtag $C$DW$T$30
    2068
    2069$C$DW$T$77      .dwtag  DW_TAG_volatile_type
    2070        .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$30)
    2071
    2072
    2073$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2074        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2075$C$DW$125       .dwtag  DW_TAG_member
    2076        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2077        .dwattr $C$DW$125, DW_AT_name("PIN_MUX_SEL")
    2078        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2079        .dwattr $C$DW$125, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   39

    2080        .dwattr $C$DW$125, DW_AT_bit_size(0x08)
    2081        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2083        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2084        .dwattr $C$DW$125, DW_AT_decl_line(0xec)
    2085        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2086
    2087$C$DW$126       .dwtag  DW_TAG_member
    2088        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2089        .dwattr $C$DW$126, DW_AT_name("rsvd2")
    2090        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd2")
    2091        .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    2092        .dwattr $C$DW$126, DW_AT_bit_size(0x18)
    2093        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2095        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2096        .dwattr $C$DW$126, DW_AT_decl_line(0xed)
    2097        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2098
    2099        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2100        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2101        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2102        .dwendtag $C$DW$T$31
    2103
    2104$C$DW$T$79      .dwtag  DW_TAG_volatile_type
    2105        .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$31)
    2106
    2107
    2108$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2109        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2110$C$DW$127       .dwtag  DW_TAG_member
    2111        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$56)
    2112        .dwattr $C$DW$127, DW_AT_name("$P$T0")
    2113        .dwattr $C$DW$127, DW_AT_TI_symbol_name("$P$T0")
    2114        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2116        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2117        .dwattr $C$DW$127, DW_AT_decl_line(0x29)
    2118        .dwattr $C$DW$127, DW_AT_decl_column(0x02)
    2119
    2120$C$DW$128       .dwtag  DW_TAG_member
    2121        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$58)
    2122        .dwattr $C$DW$128, DW_AT_name("$P$T1")
    2123        .dwattr $C$DW$128, DW_AT_TI_symbol_name("$P$T1")
    2124        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2125        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2126        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2127        .dwattr $C$DW$128, DW_AT_decl_line(0x33)
    2128        .dwattr $C$DW$128, DW_AT_decl_column(0x02)
    2129
    2130$C$DW$129       .dwtag  DW_TAG_member
    2131        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$60)
    2132        .dwattr $C$DW$129, DW_AT_name("$P$T2")
    2133        .dwattr $C$DW$129, DW_AT_TI_symbol_name("$P$T2")
    2134        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   40

    2135        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2136        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2137        .dwattr $C$DW$129, DW_AT_decl_line(0x41)
    2138        .dwattr $C$DW$129, DW_AT_decl_column(0x02)
    2139
    2140$C$DW$130       .dwtag  DW_TAG_member
    2141        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$62)
    2142        .dwattr $C$DW$130, DW_AT_name("$P$T3")
    2143        .dwattr $C$DW$130, DW_AT_TI_symbol_name("$P$T3")
    2144        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2145        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2146        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2147        .dwattr $C$DW$130, DW_AT_decl_line(0x54)
    2148        .dwattr $C$DW$130, DW_AT_decl_column(0x02)
    2149
    2150$C$DW$131       .dwtag  DW_TAG_member
    2151        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$64)
    2152        .dwattr $C$DW$131, DW_AT_name("$P$T4")
    2153        .dwattr $C$DW$131, DW_AT_TI_symbol_name("$P$T4")
    2154        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2155        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2156        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2157        .dwattr $C$DW$131, DW_AT_decl_line(0x67)
    2158        .dwattr $C$DW$131, DW_AT_decl_column(0x02)
    2159
    2160$C$DW$132       .dwtag  DW_TAG_member
    2161        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$66)
    2162        .dwattr $C$DW$132, DW_AT_name("$P$T5")
    2163        .dwattr $C$DW$132, DW_AT_TI_symbol_name("$P$T5")
    2164        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2165        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2166        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2167        .dwattr $C$DW$132, DW_AT_decl_line(0x83)
    2168        .dwattr $C$DW$132, DW_AT_decl_column(0x02)
    2169
    2170$C$DW$133       .dwtag  DW_TAG_member
    2171        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$68)
    2172        .dwattr $C$DW$133, DW_AT_name("$P$T6")
    2173        .dwattr $C$DW$133, DW_AT_TI_symbol_name("$P$T6")
    2174        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2175        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2176        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2177        .dwattr $C$DW$133, DW_AT_decl_line(0x92)
    2178        .dwattr $C$DW$133, DW_AT_decl_column(0x02)
    2179
    2180$C$DW$134       .dwtag  DW_TAG_member
    2181        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$70)
    2182        .dwattr $C$DW$134, DW_AT_name("$P$T7")
    2183        .dwattr $C$DW$134, DW_AT_TI_symbol_name("$P$T7")
    2184        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2185        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2186        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2187        .dwattr $C$DW$134, DW_AT_decl_line(0xa0)
    2188        .dwattr $C$DW$134, DW_AT_decl_column(0x02)
    2189
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   41

    2190$C$DW$135       .dwtag  DW_TAG_member
    2191        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$72)
    2192        .dwattr $C$DW$135, DW_AT_name("$P$T8")
    2193        .dwattr $C$DW$135, DW_AT_TI_symbol_name("$P$T8")
    2194        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2195        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2196        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2197        .dwattr $C$DW$135, DW_AT_decl_line(0xaf)
    2198        .dwattr $C$DW$135, DW_AT_decl_column(0x02)
    2199
    2200$C$DW$136       .dwtag  DW_TAG_member
    2201        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
    2202        .dwattr $C$DW$136, DW_AT_name("rsvd24")
    2203        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd24")
    2204        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2205        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2206        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2207        .dwattr $C$DW$136, DW_AT_decl_line(0xbc)
    2208        .dwattr $C$DW$136, DW_AT_decl_column(0x0b)
    2209
    2210$C$DW$137       .dwtag  DW_TAG_member
    2211        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$74)
    2212        .dwattr $C$DW$137, DW_AT_name("$P$T9")
    2213        .dwattr $C$DW$137, DW_AT_TI_symbol_name("$P$T9")
    2214        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2215        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2216        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2217        .dwattr $C$DW$137, DW_AT_decl_line(0xc0)
    2218        .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2219
    2220$C$DW$138       .dwtag  DW_TAG_member
    2221        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    2222        .dwattr $C$DW$138, DW_AT_name("rsvd2c")
    2223        .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd2c")
    2224        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2225        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2226        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2227        .dwattr $C$DW$138, DW_AT_decl_line(0xcb)
    2228        .dwattr $C$DW$138, DW_AT_decl_column(0x0b)
    2229
    2230$C$DW$139       .dwtag  DW_TAG_member
    2231        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$76)
    2232        .dwattr $C$DW$139, DW_AT_name("$P$T10")
    2233        .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T10")
    2234        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2235        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2236        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2237        .dwattr $C$DW$139, DW_AT_decl_line(0xcf)
    2238        .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2239
    2240$C$DW$140       .dwtag  DW_TAG_member
    2241        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$78)
    2242        .dwattr $C$DW$140, DW_AT_name("$P$T11")
    2243        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T11")
    2244        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   42

    2245        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2246        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2247        .dwattr $C$DW$140, DW_AT_decl_line(0xda)
    2248        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2249
    2250$C$DW$141       .dwtag  DW_TAG_member
    2251        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$34)
    2252        .dwattr $C$DW$141, DW_AT_name("rsvd38")
    2253        .dwattr $C$DW$141, DW_AT_TI_symbol_name("rsvd38")
    2254        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2255        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2256        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2257        .dwattr $C$DW$141, DW_AT_decl_line(0xe5)
    2258        .dwattr $C$DW$141, DW_AT_decl_column(0x0b)
    2259
    2260$C$DW$142       .dwtag  DW_TAG_member
    2261        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$80)
    2262        .dwattr $C$DW$142, DW_AT_name("$P$T12")
    2263        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T12")
    2264        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2265        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2266        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2267        .dwattr $C$DW$142, DW_AT_decl_line(0xe8)
    2268        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2269
    2270        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2271        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2272        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2273        .dwendtag $C$DW$T$35
    2274
    2275$C$DW$T$99      .dwtag  DW_TAG_typedef
    2276        .dwattr $C$DW$T$99, DW_AT_name("pruCfg")
    2277        .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$35)
    2278        .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2279        .dwattr $C$DW$T$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2280        .dwattr $C$DW$T$99, DW_AT_decl_line(0xf0)
    2281        .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    2282
    2283$C$DW$T$100     .dwtag  DW_TAG_volatile_type
    2284        .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    2285
    2286
    2287$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2288        .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    2289$C$DW$143       .dwtag  DW_TAG_member
    2290        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$37)
    2291        .dwattr $C$DW$143, DW_AT_name("cur_reg_val")
    2292        .dwattr $C$DW$143, DW_AT_TI_symbol_name("cur_reg_val")
    2293        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2295        .dwattr $C$DW$143, DW_AT_decl_file("pru1_buslatches.h")
    2296        .dwattr $C$DW$143, DW_AT_decl_line(0x22)
    2297        .dwattr $C$DW$143, DW_AT_decl_column(0x0a)
    2298
    2299$C$DW$144       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   43

    2300        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$37)
    2301        .dwattr $C$DW$144, DW_AT_name("bidi_bitwidth")
    2302        .dwattr $C$DW$144, DW_AT_TI_symbol_name("bidi_bitwidth")
    2303        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2304        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$144, DW_AT_decl_file("pru1_buslatches.h")
    2306        .dwattr $C$DW$144, DW_AT_decl_line(0x26)
    2307        .dwattr $C$DW$144, DW_AT_decl_column(0x0a)
    2308
    2309        .dwattr $C$DW$T$38, DW_AT_decl_file("pru1_buslatches.h")
    2310        .dwattr $C$DW$T$38, DW_AT_decl_line(0x21)
    2311        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2312        .dwendtag $C$DW$T$38
    2313
    2314$C$DW$T$102     .dwtag  DW_TAG_typedef
    2315        .dwattr $C$DW$T$102, DW_AT_name("buslatches_t")
    2316        .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$38)
    2317        .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2318        .dwattr $C$DW$T$102, DW_AT_decl_file("pru1_buslatches.h")
    2319        .dwattr $C$DW$T$102, DW_AT_decl_line(0x2c)
    2320        .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    2321
    2322
    2323$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2324        .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2325$C$DW$145       .dwtag  DW_TAG_member
    2326        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
    2327        .dwattr $C$DW$145, DW_AT_name("state")
    2328        .dwattr $C$DW$145, DW_AT_TI_symbol_name("state")
    2329        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2331        .dwattr $C$DW$145, DW_AT_decl_file("pru1_statemachine_powercycle.h")
    2332        .dwattr $C$DW$145, DW_AT_decl_line(0x25)
    2333        .dwattr $C$DW$145, DW_AT_decl_column(0x1f)
    2334
    2335        .dwattr $C$DW$T$42, DW_AT_decl_file("pru1_statemachine_powercycle.h")
    2336        .dwattr $C$DW$T$42, DW_AT_decl_line(0x24)
    2337        .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2338        .dwendtag $C$DW$T$42
    2339
    2340$C$DW$T$103     .dwtag  DW_TAG_typedef
    2341        .dwattr $C$DW$T$103, DW_AT_name("statemachine_powercycle_t")
    2342        .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$42)
    2343        .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2344        .dwattr $C$DW$T$103, DW_AT_decl_file("pru1_statemachine_powercycle.h")
    2345        .dwattr $C$DW$T$103, DW_AT_decl_line(0x26)
    2346        .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    2347
    2348
    2349$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2350        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2351$C$DW$146       .dwtag  DW_TAG_member
    2352        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    2353        .dwattr $C$DW$146, DW_AT_name("SOFT_RST_N")
    2354        .dwattr $C$DW$146, DW_AT_TI_symbol_name("SOFT_RST_N")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   44

    2355        .dwattr $C$DW$146, DW_AT_bit_offset(0x1f)
    2356        .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2357        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2358        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2359        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2360        .dwattr $C$DW$146, DW_AT_decl_line(0x2d)
    2361        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2362
    2363$C$DW$147       .dwtag  DW_TAG_member
    2364        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    2365        .dwattr $C$DW$147, DW_AT_name("EN")
    2366        .dwattr $C$DW$147, DW_AT_TI_symbol_name("EN")
    2367        .dwattr $C$DW$147, DW_AT_bit_offset(0x1e)
    2368        .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2369        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2370        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2371        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2372        .dwattr $C$DW$147, DW_AT_decl_line(0x2e)
    2373        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    2374
    2375$C$DW$148       .dwtag  DW_TAG_member
    2376        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    2377        .dwattr $C$DW$148, DW_AT_name("SLEEPING")
    2378        .dwattr $C$DW$148, DW_AT_TI_symbol_name("SLEEPING")
    2379        .dwattr $C$DW$148, DW_AT_bit_offset(0x1d)
    2380        .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2381        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2383        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2384        .dwattr $C$DW$148, DW_AT_decl_line(0x2f)
    2385        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    2386
    2387$C$DW$149       .dwtag  DW_TAG_member
    2388        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    2389        .dwattr $C$DW$149, DW_AT_name("CTR_EN")
    2390        .dwattr $C$DW$149, DW_AT_TI_symbol_name("CTR_EN")
    2391        .dwattr $C$DW$149, DW_AT_bit_offset(0x1c)
    2392        .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2393        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2395        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2396        .dwattr $C$DW$149, DW_AT_decl_line(0x30)
    2397        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2398
    2399$C$DW$150       .dwtag  DW_TAG_member
    2400        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    2401        .dwattr $C$DW$150, DW_AT_name("rsvd4")
    2402        .dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd4")
    2403        .dwattr $C$DW$150, DW_AT_bit_offset(0x18)
    2404        .dwattr $C$DW$150, DW_AT_bit_size(0x04)
    2405        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2407        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2408        .dwattr $C$DW$150, DW_AT_decl_line(0x31)
    2409        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   45

    2410
    2411$C$DW$151       .dwtag  DW_TAG_member
    2412        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2413        .dwattr $C$DW$151, DW_AT_name("SINGLE_STEP")
    2414        .dwattr $C$DW$151, DW_AT_TI_symbol_name("SINGLE_STEP")
    2415        .dwattr $C$DW$151, DW_AT_bit_offset(0x17)
    2416        .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2417        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2418        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2419        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2420        .dwattr $C$DW$151, DW_AT_decl_line(0x32)
    2421        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2422
    2423$C$DW$152       .dwtag  DW_TAG_member
    2424        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2425        .dwattr $C$DW$152, DW_AT_name("rsvd9")
    2426        .dwattr $C$DW$152, DW_AT_TI_symbol_name("rsvd9")
    2427        .dwattr $C$DW$152, DW_AT_bit_offset(0x11)
    2428        .dwattr $C$DW$152, DW_AT_bit_size(0x06)
    2429        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2431        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2432        .dwattr $C$DW$152, DW_AT_decl_line(0x33)
    2433        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2434
    2435$C$DW$153       .dwtag  DW_TAG_member
    2436        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2437        .dwattr $C$DW$153, DW_AT_name("RUNSTATE")
    2438        .dwattr $C$DW$153, DW_AT_TI_symbol_name("RUNSTATE")
    2439        .dwattr $C$DW$153, DW_AT_bit_offset(0x10)
    2440        .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2441        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2443        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2444        .dwattr $C$DW$153, DW_AT_decl_line(0x34)
    2445        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2446
    2447$C$DW$154       .dwtag  DW_TAG_member
    2448        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2449        .dwattr $C$DW$154, DW_AT_name("PCTR_RST_VAL")
    2450        .dwattr $C$DW$154, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    2451        .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2452        .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    2453        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2454        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2455        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2456        .dwattr $C$DW$154, DW_AT_decl_line(0x35)
    2457        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2458
    2459        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2460        .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c)
    2461        .dwattr $C$DW$T$43, DW_AT_decl_column(0x13)
    2462        .dwendtag $C$DW$T$43
    2463
    2464$C$DW$T$81      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:38 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_powercycle.asm                                     PAGE   46

    2465        .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$43)
    2466
    2467$C$DW$T$104     .dwtag  DW_TAG_pointer_type
    2468        .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$81)
    2469        .dwattr $C$DW$T$104, DW_AT_address_class(0x20)
    2470
    2471
    2472$C$DW$T$44      .dwtag  DW_TAG_structure_type
    2473        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    2474$C$DW$155       .dwtag  DW_TAG_member
    2475        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2476        .dwattr $C$DW$155, DW_AT_name("PCTR")
    2477        .dwattr $C$DW$155, DW_AT_TI_symbol_name("PCTR")
    2478        .dwattr $C$DW$155, DW_AT_bit_offset(0x10)
    2479        .dwattr $C$DW$155, DW_AT_bit_size(0x10)
    2480        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2482        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2483        .dwattr $C$DW$155, DW_AT_decl_line(0x3f)
    2484        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2485
    2486$C$DW$156       .dwtag  DW_TAG_member
    2487        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2488        .dwattr $C$DW$156, DW_AT_name("rsvd16")
    2489        .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd16")
    2490        .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2491        .dwattr $C$DW$156, DW_AT_bit_size(0x10)
    2492        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2494        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2495        .dwattr $C$DW$156, DW_AT_decl_line(0x40)
    2496        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2497
    2498        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
