PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:36 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_init.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13$C$DW$1 .dwtag  DW_TAG_variable
      14        .dwattr $C$DW$1, DW_AT_name("mailbox")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("mailbox")
      16        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$128)
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external

     573$C$DW$29        .dwtag  DW_TAG_TI_branch
     574        .dwattr $C$DW$29, DW_AT_low_pc(0x00)
     575        .dwattr $C$DW$29, DW_AT_name("buslatches_pru0_dataout")
     576        .dwattr $C$DW$29, DW_AT_TI_call
     577
     578 00000054 000000230000C3!         JAL       r3.w2, ||buslatches_pru0_dataout|| ; [ALU_PRU] |74| buslatches_pru0_dataout
     579 00000058 000000240700FE          LDI       r30, 0x0700           ; [ALU_PRU] |74| 
     580 0000005c 000000E1000604          SBBO      &r4.b0, r6, 0, 1      ; [ALU_PRU] |74| $O$C1,_tmpval
     581        .newblock
     582 00000060 000185240000C5          LDI32    r5, 1
         00000067 00000000004024 
     583 00000068 0000000501E5E5  $1:     SUB      r5, r5, 1
     584 0000006c 0000006F00E5FF          QBNE     $1, r5, 0             ; [ALU_PRU] |74| 
     585        .dwpsn  file "pru1_statemachine_init.c",line 75,column 2,is_stmt,isa 0
     586;----------------------------------------------------------------------
     587;  75 | mailbox.events.initialization_signals_prev &= ~INITIALIZATIONSIGNAL_INI
     588;     | T ; // force INIT event                                                
     589;----------------------------------------------------------------------
     590 00000070 001680240000C0!         LDI32     r0, ||mailbox||+22    ; [ALU_PRU] |75| mailbox
         00000077 00000021004024 
     591        .dwpsn  file "pru1_statemachine_init.c",line 74,column 2,is_stmt,isa 0
     592 00000078 000000240F00FE          LDI       r30, 0x0f00           ; [ALU_PRU] |74| 
     593        .dwpsn  file "pru1_statemachine_init.c",line 75,column 2,is_stmt,isa 0
     594 0000007c 000000F1000001          LBBO      &r1.b0, r0, 0, 1      ; [ALU_PRU] |75| 
     595 00000080 00000011F70101          AND       r1.b0, r1.b0, 0xf7    ; [ALU_PRU] |75| 
     596 00000084 000000E1000001          SBBO      &r1.b0, r0, 0, 1      ; [ALU_PRU] |75| 
     597        .dwpsn  file "pru1_statemachine_init.c",line 76,column 2,is_stmt,isa 0
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   12

     598;----------------------------------------------------------------------
     599;  76 | do_event_initializationsignals() ;                                     
     600;----------------------------------------------------------------------
     601$C$DW$30        .dwtag  DW_TAG_TI_branch
     602        .dwattr $C$DW$30, DW_AT_low_pc(0x00)
     603        .dwattr $C$DW$30, DW_AT_name("do_event_initializationsignals")
     604        .dwattr $C$DW$30, DW_AT_TI_call
     605
     606 00000088 000000230000C3!         JAL       r3.w2, ||do_event_initializationsignals|| ; [ALU_PRU] |76| do_event_initializationsi
     607        .dwpsn  file "pru1_statemachine_init.c",line 77,column 2,is_stmt,isa 0
     608;----------------------------------------------------------------------
     609;  77 | sm_init.state = &sm_init_state_1;                                      
     610;----------------------------------------------------------------------
     611 0000008c 00000024000081!         LDI       r1.w0, $CODE(||sm_init_state_1||) ; [ALU_PRU] |77| sm_init_state_1
     612 00000090 000000240000E0!         LDI       r0, ||sm_init||       ; [ALU_PRU] |77| sm_init
     613 00000094 000000E1000081          SBBO      &r1.w0, r0, 0, 2      ; [ALU_PRU] |77| 
     614 00000098 000000F1002243          LBBO      &r3.b2, r2, 0, 3      ; [ALU_PRU] 
     615        .dwcfi  restore_reg, 14
     616        .dwcfi  restore_reg, 15
     617        .dwcfi  restore_reg, 16
     618 0000009c 000000F1036285          LBBO      &r5.b0, r2, 3, 8      ; [ALU_PRU] 
     619        .dwcfi  restore_reg, 20
     620        .dwcfi  restore_reg, 21
     621        .dwcfi  restore_reg, 22
     622        .dwcfi  restore_reg, 23
     623        .dwcfi  restore_reg, 24
     624        .dwcfi  restore_reg, 25
     625        .dwcfi  restore_reg, 26
     626        .dwcfi  restore_reg, 27
     627 000000a0 000000010BE2E2          ADD       r2, r2, 0x0b          ; [ALU_PRU] 
     628        .dwcfi  cfa_offset, 0
     629$C$DW$31        .dwtag  DW_TAG_TI_branch
     630        .dwattr $C$DW$31, DW_AT_low_pc(0x00)
     631        .dwattr $C$DW$31, DW_AT_TI_return
     632
     633 000000a4 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     634        .dwattr $C$DW$24, DW_AT_TI_end_file("pru1_statemachine_init.c")
     635        .dwattr $C$DW$24, DW_AT_TI_end_line(0x4e)
     636        .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     637        .dwendentry
     638        .dwendtag $C$DW$24
     639
     640;*****************************************************************************
     641;* UNDEFINED EXTERNAL REFERENCES                                             *
     642;*****************************************************************************
     643        .global ||mailbox||
     644        .global ||timeout_target||
     645        .global ||buslatches||
     646        .global ||buslatches_pru0_dataout||
     647
     648;******************************************************************************
     649;* TYPE INFORMATION                                                           *
     650;******************************************************************************
     651
     652$C$DW$T$19      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   13

     653        .dwattr $C$DW$T$19, DW_AT_byte_size(0x40000)
     654$C$DW$32        .dwtag  DW_TAG_member
     655        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$72)
     656        .dwattr $C$DW$32, DW_AT_name("$P$T0")
     657        .dwattr $C$DW$32, DW_AT_TI_symbol_name("$P$T0")
     658        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     660        .dwattr $C$DW$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     661        .dwattr $C$DW$32, DW_AT_decl_line(0x34)
     662        .dwattr $C$DW$32, DW_AT_decl_column(0x02)
     663
     664        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     665        .dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
     666        .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     667        .dwendtag $C$DW$T$19
     668
     669$C$DW$T$20      .dwtag  DW_TAG_typedef
     670        .dwattr $C$DW$T$20, DW_AT_name("unibus_memory_t")
     671        .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
     672        .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     673        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     674        .dwattr $C$DW$T$20, DW_AT_decl_line(0x38)
     675        .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
     676
     677
     678$C$DW$T$21      .dwtag  DW_TAG_structure_type
     679        .dwattr $C$DW$T$21, DW_AT_byte_size(0x40000)
     680$C$DW$33        .dwtag  DW_TAG_member
     681        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     682        .dwattr $C$DW$33, DW_AT_name("memory")
     683        .dwattr $C$DW$33, DW_AT_TI_symbol_name("memory")
     684        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     686        .dwattr $C$DW$33, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/dd
     687        .dwattr $C$DW$33, DW_AT_decl_line(0x17)
     688        .dwattr $C$DW$33, DW_AT_decl_column(0x12)
     689
     690        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     691        .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
     692        .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     693        .dwendtag $C$DW$T$21
     694
     695$C$DW$T$32      .dwtag  DW_TAG_typedef
     696        .dwattr $C$DW$T$32, DW_AT_name("ddrmem_t")
     697        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
     698        .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     699        .dwattr $C$DW$T$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     700        .dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
     701        .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
     702
     703$C$DW$T$33      .dwtag  DW_TAG_volatile_type
     704        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     705
     706$C$DW$T$34      .dwtag  DW_TAG_pointer_type
     707        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   14

     708        .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
     709
     710
     711$C$DW$T$25      .dwtag  DW_TAG_structure_type
     712        .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
     713$C$DW$34        .dwtag  DW_TAG_member
     714        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     715        .dwattr $C$DW$34, DW_AT_name("eventmask")
     716        .dwattr $C$DW$34, DW_AT_TI_symbol_name("eventmask")
     717        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     719        .dwattr $C$DW$34, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     720        .dwattr $C$DW$34, DW_AT_decl_line(0x7a)
     721        .dwattr $C$DW$34, DW_AT_decl_column(0x0a)
     722
     723$C$DW$35        .dwtag  DW_TAG_member
     724        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     725        .dwattr $C$DW$35, DW_AT_name("unibus_control")
     726        .dwattr $C$DW$35, DW_AT_TI_symbol_name("unibus_control")
     727        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     728        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     729        .dwattr $C$DW$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     730        .dwattr $C$DW$35, DW_AT_decl_line(0x7d)
     731        .dwattr $C$DW$35, DW_AT_decl_column(0x0a)
     732
     733$C$DW$36        .dwtag  DW_TAG_member
     734        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     735        .dwattr $C$DW$36, DW_AT_name("device_handle")
     736        .dwattr $C$DW$36, DW_AT_TI_symbol_name("device_handle")
     737        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     738        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     739        .dwattr $C$DW$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     740        .dwattr $C$DW$36, DW_AT_decl_line(0x7f)
     741        .dwattr $C$DW$36, DW_AT_decl_column(0x0a)
     742
     743$C$DW$37        .dwtag  DW_TAG_member
     744        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
     745        .dwattr $C$DW$37, DW_AT_name("device_register_idx")
     746        .dwattr $C$DW$37, DW_AT_TI_symbol_name("device_register_idx")
     747        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     748        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     749        .dwattr $C$DW$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     750        .dwattr $C$DW$37, DW_AT_decl_line(0x81)
     751        .dwattr $C$DW$37, DW_AT_decl_column(0x0a)
     752
     753$C$DW$38        .dwtag  DW_TAG_member
     754        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$23)
     755        .dwattr $C$DW$38, DW_AT_name("addr")
     756        .dwattr $C$DW$38, DW_AT_TI_symbol_name("addr")
     757        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     758        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     759        .dwattr $C$DW$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     760        .dwattr $C$DW$38, DW_AT_decl_line(0x83)
     761        .dwattr $C$DW$38, DW_AT_decl_column(0x0b)
     762
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   15

     763$C$DW$39        .dwtag  DW_TAG_member
     764        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$24)
     765        .dwattr $C$DW$39, DW_AT_name("data")
     766        .dwattr $C$DW$39, DW_AT_TI_symbol_name("data")
     767        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     768        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     769        .dwattr $C$DW$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     770        .dwattr $C$DW$39, DW_AT_decl_line(0x84)
     771        .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     772
     773$C$DW$40        .dwtag  DW_TAG_member
     774        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
     775        .dwattr $C$DW$40, DW_AT_name("initialization_signals_prev")
     776        .dwattr $C$DW$40, DW_AT_TI_symbol_name("initialization_signals_prev")
     777        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     778        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     779        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     780        .dwattr $C$DW$40, DW_AT_decl_line(0x87)
     781        .dwattr $C$DW$40, DW_AT_decl_column(0x0a)
     782
     783$C$DW$41        .dwtag  DW_TAG_member
     784        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     785        .dwattr $C$DW$41, DW_AT_name("initialization_signals_cur")
     786        .dwattr $C$DW$41, DW_AT_TI_symbol_name("initialization_signals_cur")
     787        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     788        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     789        .dwattr $C$DW$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     790        .dwattr $C$DW$41, DW_AT_decl_line(0x88)
     791        .dwattr $C$DW$41, DW_AT_decl_column(0x0a)
     792
     793        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     794        .dwattr $C$DW$T$25, DW_AT_decl_line(0x79)
     795        .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     796        .dwendtag $C$DW$T$25
     797
     798$C$DW$T$35      .dwtag  DW_TAG_typedef
     799        .dwattr $C$DW$T$35, DW_AT_name("mailbox_events_t")
     800        .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
     801        .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     802        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     803        .dwattr $C$DW$T$35, DW_AT_decl_line(0x8b)
     804        .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
     805
     806
     807$C$DW$T$26      .dwtag  DW_TAG_structure_type
     808        .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     809$C$DW$42        .dwtag  DW_TAG_member
     810        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     811        .dwattr $C$DW$42, DW_AT_name("addr")
     812        .dwattr $C$DW$42, DW_AT_TI_symbol_name("addr")
     813        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     815        .dwattr $C$DW$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     816        .dwattr $C$DW$42, DW_AT_decl_line(0x4c)
     817        .dwattr $C$DW$42, DW_AT_decl_column(0x0b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   16

     818
     819$C$DW$43        .dwtag  DW_TAG_member
     820        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$23)
     821        .dwattr $C$DW$43, DW_AT_name("val")
     822        .dwattr $C$DW$43, DW_AT_TI_symbol_name("val")
     823        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     824        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     825        .dwattr $C$DW$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     826        .dwattr $C$DW$43, DW_AT_decl_line(0x4d)
     827        .dwattr $C$DW$43, DW_AT_decl_column(0x0b)
     828
     829        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     830        .dwattr $C$DW$T$26, DW_AT_decl_line(0x4b)
     831        .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     832        .dwendtag $C$DW$T$26
     833
     834$C$DW$T$73      .dwtag  DW_TAG_typedef
     835        .dwattr $C$DW$T$73, DW_AT_name("mailbox_test_t")
     836        .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$26)
     837        .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     838        .dwattr $C$DW$T$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     839        .dwattr $C$DW$T$73, DW_AT_decl_line(0x4e)
     840        .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
     841
     842
     843$C$DW$T$27      .dwtag  DW_TAG_structure_type
     844        .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
     845$C$DW$44        .dwtag  DW_TAG_member
     846        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     847        .dwattr $C$DW$44, DW_AT_name("addr")
     848        .dwattr $C$DW$44, DW_AT_TI_symbol_name("addr")
     849        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     851        .dwattr $C$DW$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     852        .dwattr $C$DW$44, DW_AT_decl_line(0x51)
     853        .dwattr $C$DW$44, DW_AT_decl_column(0x0b)
     854
     855$C$DW$45        .dwtag  DW_TAG_member
     856        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     857        .dwattr $C$DW$45, DW_AT_name("bitmask")
     858        .dwattr $C$DW$45, DW_AT_TI_symbol_name("bitmask")
     859        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     860        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     861        .dwattr $C$DW$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     862        .dwattr $C$DW$45, DW_AT_decl_line(0x52)
     863        .dwattr $C$DW$45, DW_AT_decl_column(0x0b)
     864
     865$C$DW$46        .dwtag  DW_TAG_member
     866        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     867        .dwattr $C$DW$46, DW_AT_name("val")
     868        .dwattr $C$DW$46, DW_AT_TI_symbol_name("val")
     869        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     870        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     871        .dwattr $C$DW$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     872        .dwattr $C$DW$46, DW_AT_decl_line(0x53)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   17

     873        .dwattr $C$DW$46, DW_AT_decl_column(0x0b)
     874
     875        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     876        .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
     877        .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     878        .dwendtag $C$DW$T$27
     879
     880$C$DW$T$74      .dwtag  DW_TAG_typedef
     881        .dwattr $C$DW$T$74, DW_AT_name("mailbox_buslatch_t")
     882        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$27)
     883        .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
     884        .dwattr $C$DW$T$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     885        .dwattr $C$DW$T$74, DW_AT_decl_line(0x54)
     886        .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
     887
     888
     889$C$DW$T$28      .dwtag  DW_TAG_structure_type
     890        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     891$C$DW$47        .dwtag  DW_TAG_member
     892        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
     893        .dwattr $C$DW$47, DW_AT_name("addr_0_7")
     894        .dwattr $C$DW$47, DW_AT_TI_symbol_name("addr_0_7")
     895        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     897        .dwattr $C$DW$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     898        .dwattr $C$DW$47, DW_AT_decl_line(0x57)
     899        .dwattr $C$DW$47, DW_AT_decl_column(0x0a)
     900
     901$C$DW$48        .dwtag  DW_TAG_member
     902        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     903        .dwattr $C$DW$48, DW_AT_name("addr_8_15")
     904        .dwattr $C$DW$48, DW_AT_TI_symbol_name("addr_8_15")
     905        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     906        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     907        .dwattr $C$DW$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     908        .dwattr $C$DW$48, DW_AT_decl_line(0x58)
     909        .dwattr $C$DW$48, DW_AT_decl_column(0x0a)
     910
     911$C$DW$49        .dwtag  DW_TAG_member
     912        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
     913        .dwattr $C$DW$49, DW_AT_name("data_0_7")
     914        .dwattr $C$DW$49, DW_AT_TI_symbol_name("data_0_7")
     915        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     916        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     917        .dwattr $C$DW$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     918        .dwattr $C$DW$49, DW_AT_decl_line(0x59)
     919        .dwattr $C$DW$49, DW_AT_decl_column(0x0a)
     920
     921$C$DW$50        .dwtag  DW_TAG_member
     922        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
     923        .dwattr $C$DW$50, DW_AT_name("data_8_15")
     924        .dwattr $C$DW$50, DW_AT_TI_symbol_name("data_8_15")
     925        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     926        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     927        .dwattr $C$DW$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   18

     928        .dwattr $C$DW$50, DW_AT_decl_line(0x5a)
     929        .dwattr $C$DW$50, DW_AT_decl_column(0x0a)
     930
     931        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     932        .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
     933        .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     934        .dwendtag $C$DW$T$28
     935
     936$C$DW$T$75      .dwtag  DW_TAG_typedef
     937        .dwattr $C$DW$T$75, DW_AT_name("mailbox_buslatch_test_t")
     938        .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
     939        .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     940        .dwattr $C$DW$T$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     941        .dwattr $C$DW$T$75, DW_AT_decl_line(0x5b)
     942        .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
     943
     944
     945$C$DW$T$30      .dwtag  DW_TAG_structure_type
     946        .dwattr $C$DW$T$30, DW_AT_byte_size(0x40c)
     947$C$DW$51        .dwtag  DW_TAG_member
     948        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
     949        .dwattr $C$DW$51, DW_AT_name("cur_status")
     950        .dwattr $C$DW$51, DW_AT_TI_symbol_name("cur_status")
     951        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     953        .dwattr $C$DW$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     954        .dwattr $C$DW$51, DW_AT_decl_line(0x61)
     955        .dwattr $C$DW$51, DW_AT_decl_column(0x0a)
     956
     957$C$DW$52        .dwtag  DW_TAG_member
     958        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     959        .dwattr $C$DW$52, DW_AT_name("control")
     960        .dwattr $C$DW$52, DW_AT_TI_symbol_name("control")
     961        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     962        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     963        .dwattr $C$DW$52, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     964        .dwattr $C$DW$52, DW_AT_decl_line(0x62)
     965        .dwattr $C$DW$52, DW_AT_decl_column(0x0a)
     966
     967$C$DW$53        .dwtag  DW_TAG_member
     968        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     969        .dwattr $C$DW$53, DW_AT_name("wordcount")
     970        .dwattr $C$DW$53, DW_AT_TI_symbol_name("wordcount")
     971        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     972        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     973        .dwattr $C$DW$53, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     974        .dwattr $C$DW$53, DW_AT_decl_line(0x63)
     975        .dwattr $C$DW$53, DW_AT_decl_column(0x0b)
     976
     977$C$DW$54        .dwtag  DW_TAG_member
     978        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$23)
     979        .dwattr $C$DW$54, DW_AT_name("cur_addr")
     980        .dwattr $C$DW$54, DW_AT_TI_symbol_name("cur_addr")
     981        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     982        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   19

     983        .dwattr $C$DW$54, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     984        .dwattr $C$DW$54, DW_AT_decl_line(0x64)
     985        .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     986
     987$C$DW$55        .dwtag  DW_TAG_member
     988        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$23)
     989        .dwattr $C$DW$55, DW_AT_name("startaddr")
     990        .dwattr $C$DW$55, DW_AT_TI_symbol_name("startaddr")
     991        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     992        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     993        .dwattr $C$DW$55, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     994        .dwattr $C$DW$55, DW_AT_decl_line(0x65)
     995        .dwattr $C$DW$55, DW_AT_decl_column(0x0b)
     996
     997$C$DW$56        .dwtag  DW_TAG_member
     998        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$29)
     999        .dwattr $C$DW$56, DW_AT_name("words")
    1000        .dwattr $C$DW$56, DW_AT_TI_symbol_name("words")
    1001        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1002        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1003        .dwattr $C$DW$56, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1004        .dwattr $C$DW$56, DW_AT_decl_line(0x66)
    1005        .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
    1006
    1007        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1008        .dwattr $C$DW$T$30, DW_AT_decl_line(0x5f)
    1009        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1010        .dwendtag $C$DW$T$30
    1011
    1012$C$DW$T$76      .dwtag  DW_TAG_typedef
    1013        .dwattr $C$DW$T$76, DW_AT_name("mailbox_dma_t")
    1014        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
    1015        .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1016        .dwattr $C$DW$T$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1017        .dwattr $C$DW$T$76, DW_AT_decl_line(0x67)
    1018        .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1019
    1020
    1021$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1022        .dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
    1023$C$DW$57        .dwtag  DW_TAG_member
    1024        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$24)
    1025        .dwattr $C$DW$57, DW_AT_name("vector")
    1026        .dwattr $C$DW$57, DW_AT_TI_symbol_name("vector")
    1027        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1029        .dwattr $C$DW$57, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1030        .dwattr $C$DW$57, DW_AT_decl_line(0x6b)
    1031        .dwattr $C$DW$57, DW_AT_decl_column(0x0b)
    1032
    1033$C$DW$58        .dwtag  DW_TAG_member
    1034        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
    1035        .dwattr $C$DW$58, DW_AT_name("priority_bit")
    1036        .dwattr $C$DW$58, DW_AT_TI_symbol_name("priority_bit")
    1037        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   20

    1038        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1039        .dwattr $C$DW$58, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1040        .dwattr $C$DW$58, DW_AT_decl_line(0x6c)
    1041        .dwattr $C$DW$58, DW_AT_decl_column(0x0a)
    1042
    1043        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1044        .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
    1045        .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1046        .dwendtag $C$DW$T$31
    1047
    1048$C$DW$T$77      .dwtag  DW_TAG_typedef
    1049        .dwattr $C$DW$T$77, DW_AT_name("mailbox_intr_t")
    1050        .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$31)
    1051        .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1052        .dwattr $C$DW$T$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1053        .dwattr $C$DW$T$77, DW_AT_decl_line(0x6d)
    1054        .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1055
    1056
    1057$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1058        .dwattr $C$DW$T$36, DW_AT_byte_size(0x424)
    1059$C$DW$59        .dwtag  DW_TAG_member
    1060        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
    1061        .dwattr $C$DW$59, DW_AT_name("arm2pru_req")
    1062        .dwattr $C$DW$59, DW_AT_TI_symbol_name("arm2pru_req")
    1063        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1065        .dwattr $C$DW$59, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1066        .dwattr $C$DW$59, DW_AT_decl_line(0x90)
    1067        .dwattr $C$DW$59, DW_AT_decl_column(0x0b)
    1068
    1069$C$DW$60        .dwtag  DW_TAG_member
    1070        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
    1071        .dwattr $C$DW$60, DW_AT_name("arm2pru_resp")
    1072        .dwattr $C$DW$60, DW_AT_TI_symbol_name("arm2pru_resp")
    1073        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1074        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1075        .dwattr $C$DW$60, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1076        .dwattr $C$DW$60, DW_AT_decl_line(0x91)
    1077        .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
    1078
    1079$C$DW$61        .dwtag  DW_TAG_member
    1080        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$34)
    1081        .dwattr $C$DW$61, DW_AT_name("ddrmem_base_physical")
    1082        .dwattr $C$DW$61, DW_AT_TI_symbol_name("ddrmem_base_physical")
    1083        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1084        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$61, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1086        .dwattr $C$DW$61, DW_AT_decl_line(0x94)
    1087        .dwattr $C$DW$61, DW_AT_decl_column(0x15)
    1088
    1089$C$DW$62        .dwtag  DW_TAG_member
    1090        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$35)
    1091        .dwattr $C$DW$62, DW_AT_name("events")
    1092        .dwattr $C$DW$62, DW_AT_TI_symbol_name("events")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   21

    1093        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1094        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1095        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1096        .dwattr $C$DW$62, DW_AT_decl_line(0x97)
    1097        .dwattr $C$DW$62, DW_AT_decl_column(0x13)
    1098
    1099$C$DW$63        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$78)
    1101        .dwattr $C$DW$63, DW_AT_name("$P$T1")
    1102        .dwattr $C$DW$63, DW_AT_TI_symbol_name("$P$T1")
    1103        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1104        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1106        .dwattr $C$DW$63, DW_AT_decl_line(0x9a)
    1107        .dwattr $C$DW$63, DW_AT_decl_column(0x02)
    1108
    1109        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1110        .dwattr $C$DW$T$36, DW_AT_decl_line(0x8d)
    1111        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1112        .dwendtag $C$DW$T$36
    1113
    1114$C$DW$T$125     .dwtag  DW_TAG_volatile_type
    1115        .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$36)
    1116
    1117$C$DW$T$126     .dwtag  DW_TAG_pointer_type
    1118        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    1119        .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    1120
    1121$C$DW$T$127     .dwtag  DW_TAG_typedef
    1122        .dwattr $C$DW$T$127, DW_AT_name("mailbox_t")
    1123        .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$36)
    1124        .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    1125        .dwattr $C$DW$T$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared
    1126        .dwattr $C$DW$T$127, DW_AT_decl_line(0xa1)
    1127        .dwattr $C$DW$T$127, DW_AT_decl_column(0x03)
    1128
    1129$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1130        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    1131
    1132
    1133$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1134        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1135$C$DW$64        .dwtag  DW_TAG_member
    1136        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1137        .dwattr $C$DW$64, DW_AT_name("REVID")
    1138        .dwattr $C$DW$64, DW_AT_TI_symbol_name("REVID")
    1139        .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
    1140        .dwattr $C$DW$64, DW_AT_bit_size(0x20)
    1141        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1143        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1144        .dwattr $C$DW$64, DW_AT_decl_line(0x2d)
    1145        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1146
    1147        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   22

    1148        .dwattr $C$DW$T$37, DW_AT_decl_line(0x2c)
    1149        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1150        .dwendtag $C$DW$T$37
    1151
    1152$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1153        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$37)
    1154
    1155
    1156$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1157        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1158$C$DW$65        .dwtag  DW_TAG_member
    1159        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1160        .dwattr $C$DW$65, DW_AT_name("IDLE_MODE")
    1161        .dwattr $C$DW$65, DW_AT_TI_symbol_name("IDLE_MODE")
    1162        .dwattr $C$DW$65, DW_AT_bit_offset(0x1e)
    1163        .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1164        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1167        .dwattr $C$DW$65, DW_AT_decl_line(0x37)
    1168        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1169
    1170$C$DW$66        .dwtag  DW_TAG_member
    1171        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1172        .dwattr $C$DW$66, DW_AT_name("STANDBY_MODE")
    1173        .dwattr $C$DW$66, DW_AT_TI_symbol_name("STANDBY_MODE")
    1174        .dwattr $C$DW$66, DW_AT_bit_offset(0x1c)
    1175        .dwattr $C$DW$66, DW_AT_bit_size(0x02)
    1176        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1178        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1179        .dwattr $C$DW$66, DW_AT_decl_line(0x38)
    1180        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1181
    1182$C$DW$67        .dwtag  DW_TAG_member
    1183        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1184        .dwattr $C$DW$67, DW_AT_name("STANDBY_INIT")
    1185        .dwattr $C$DW$67, DW_AT_TI_symbol_name("STANDBY_INIT")
    1186        .dwattr $C$DW$67, DW_AT_bit_offset(0x1b)
    1187        .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1188        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1190        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1191        .dwattr $C$DW$67, DW_AT_decl_line(0x39)
    1192        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1193
    1194$C$DW$68        .dwtag  DW_TAG_member
    1195        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1196        .dwattr $C$DW$68, DW_AT_name("SUB_MWAIT")
    1197        .dwattr $C$DW$68, DW_AT_TI_symbol_name("SUB_MWAIT")
    1198        .dwattr $C$DW$68, DW_AT_bit_offset(0x1a)
    1199        .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1200        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   23

    1203        .dwattr $C$DW$68, DW_AT_decl_line(0x3a)
    1204        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1205
    1206$C$DW$69        .dwtag  DW_TAG_member
    1207        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1208        .dwattr $C$DW$69, DW_AT_name("rsvd6")
    1209        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd6")
    1210        .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
    1211        .dwattr $C$DW$69, DW_AT_bit_size(0x1a)
    1212        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1214        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1215        .dwattr $C$DW$69, DW_AT_decl_line(0x3b)
    1216        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1217
    1218        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1219        .dwattr $C$DW$T$38, DW_AT_decl_line(0x36)
    1220        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1221        .dwendtag $C$DW$T$38
    1222
    1223$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    1224        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$38)
    1225
    1226
    1227$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1228        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1229$C$DW$70        .dwtag  DW_TAG_member
    1230        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1231        .dwattr $C$DW$70, DW_AT_name("PRU0_GPI_MODE")
    1232        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1233        .dwattr $C$DW$70, DW_AT_bit_offset(0x1e)
    1234        .dwattr $C$DW$70, DW_AT_bit_size(0x02)
    1235        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1237        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1238        .dwattr $C$DW$70, DW_AT_decl_line(0x45)
    1239        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1240
    1241$C$DW$71        .dwtag  DW_TAG_member
    1242        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1243        .dwattr $C$DW$71, DW_AT_name("PRU0_GPI_CLK_MODE")
    1244        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1245        .dwattr $C$DW$71, DW_AT_bit_offset(0x1d)
    1246        .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1247        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1249        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1250        .dwattr $C$DW$71, DW_AT_decl_line(0x46)
    1251        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1252
    1253$C$DW$72        .dwtag  DW_TAG_member
    1254        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1255        .dwattr $C$DW$72, DW_AT_name("PRU0_GPI_DIV0")
    1256        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1257        .dwattr $C$DW$72, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   24

    1258        .dwattr $C$DW$72, DW_AT_bit_size(0x05)
    1259        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1261        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1262        .dwattr $C$DW$72, DW_AT_decl_line(0x47)
    1263        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1264
    1265$C$DW$73        .dwtag  DW_TAG_member
    1266        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1267        .dwattr $C$DW$73, DW_AT_name("PRU0_GPI_DIV1")
    1268        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1269        .dwattr $C$DW$73, DW_AT_bit_offset(0x13)
    1270        .dwattr $C$DW$73, DW_AT_bit_size(0x05)
    1271        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1273        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1274        .dwattr $C$DW$73, DW_AT_decl_line(0x48)
    1275        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1276
    1277$C$DW$74        .dwtag  DW_TAG_member
    1278        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1279        .dwattr $C$DW$74, DW_AT_name("PRU0_GPI_SB")
    1280        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1281        .dwattr $C$DW$74, DW_AT_bit_offset(0x12)
    1282        .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1283        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1286        .dwattr $C$DW$74, DW_AT_decl_line(0x49)
    1287        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1288
    1289$C$DW$75        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$75, DW_AT_name("PRU0_GPO_MODE")
    1292        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1293        .dwattr $C$DW$75, DW_AT_bit_offset(0x11)
    1294        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1295        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1297        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1298        .dwattr $C$DW$75, DW_AT_decl_line(0x4a)
    1299        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1300
    1301$C$DW$76        .dwtag  DW_TAG_member
    1302        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1303        .dwattr $C$DW$76, DW_AT_name("PRU0_GPO_DIV0")
    1304        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1305        .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
    1306        .dwattr $C$DW$76, DW_AT_bit_size(0x05)
    1307        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1309        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1310        .dwattr $C$DW$76, DW_AT_decl_line(0x4b)
    1311        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1312
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   25

    1313$C$DW$77        .dwtag  DW_TAG_member
    1314        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1315        .dwattr $C$DW$77, DW_AT_name("PRU0_GPO_DIV1")
    1316        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1317        .dwattr $C$DW$77, DW_AT_bit_offset(0x07)
    1318        .dwattr $C$DW$77, DW_AT_bit_size(0x05)
    1319        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1321        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1322        .dwattr $C$DW$77, DW_AT_decl_line(0x4c)
    1323        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1324
    1325$C$DW$78        .dwtag  DW_TAG_member
    1326        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1327        .dwattr $C$DW$78, DW_AT_name("PRU0_GPO_SH_SEL")
    1328        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1329        .dwattr $C$DW$78, DW_AT_bit_offset(0x06)
    1330        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1331        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1334        .dwattr $C$DW$78, DW_AT_decl_line(0x4d)
    1335        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1336
    1337$C$DW$79        .dwtag  DW_TAG_member
    1338        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1339        .dwattr $C$DW$79, DW_AT_name("rsvd26")
    1340        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd26")
    1341        .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1342        .dwattr $C$DW$79, DW_AT_bit_size(0x06)
    1343        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1346        .dwattr $C$DW$79, DW_AT_decl_line(0x4e)
    1347        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1348
    1349        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1350        .dwattr $C$DW$T$39, DW_AT_decl_line(0x44)
    1351        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1352        .dwendtag $C$DW$T$39
    1353
    1354$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1355        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$39)
    1356
    1357
    1358$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1359        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1360$C$DW$80        .dwtag  DW_TAG_member
    1361        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1362        .dwattr $C$DW$80, DW_AT_name("PRU1_GPI_MODE")
    1363        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1364        .dwattr $C$DW$80, DW_AT_bit_offset(0x1e)
    1365        .dwattr $C$DW$80, DW_AT_bit_size(0x02)
    1366        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   26

    1368        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1369        .dwattr $C$DW$80, DW_AT_decl_line(0x58)
    1370        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1371
    1372$C$DW$81        .dwtag  DW_TAG_member
    1373        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1374        .dwattr $C$DW$81, DW_AT_name("PRU1_GPI_CLK_MODE")
    1375        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1376        .dwattr $C$DW$81, DW_AT_bit_offset(0x1d)
    1377        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1378        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1380        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1381        .dwattr $C$DW$81, DW_AT_decl_line(0x59)
    1382        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1383
    1384$C$DW$82        .dwtag  DW_TAG_member
    1385        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1386        .dwattr $C$DW$82, DW_AT_name("PRU1_GPI_DIV0")
    1387        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1388        .dwattr $C$DW$82, DW_AT_bit_offset(0x18)
    1389        .dwattr $C$DW$82, DW_AT_bit_size(0x05)
    1390        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1392        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1393        .dwattr $C$DW$82, DW_AT_decl_line(0x5a)
    1394        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1395
    1396$C$DW$83        .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1398        .dwattr $C$DW$83, DW_AT_name("PRU1_GPI_DIV1")
    1399        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1400        .dwattr $C$DW$83, DW_AT_bit_offset(0x13)
    1401        .dwattr $C$DW$83, DW_AT_bit_size(0x05)
    1402        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1404        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1405        .dwattr $C$DW$83, DW_AT_decl_line(0x5b)
    1406        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1407
    1408$C$DW$84        .dwtag  DW_TAG_member
    1409        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1410        .dwattr $C$DW$84, DW_AT_name("PRU1_GPI_SB")
    1411        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1412        .dwattr $C$DW$84, DW_AT_bit_offset(0x12)
    1413        .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1414        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1416        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1417        .dwattr $C$DW$84, DW_AT_decl_line(0x5c)
    1418        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1419
    1420$C$DW$85        .dwtag  DW_TAG_member
    1421        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1422        .dwattr $C$DW$85, DW_AT_name("PRU1_GPO_MODE")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   27

    1423        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1424        .dwattr $C$DW$85, DW_AT_bit_offset(0x11)
    1425        .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1426        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1428        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1429        .dwattr $C$DW$85, DW_AT_decl_line(0x5d)
    1430        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1431
    1432$C$DW$86        .dwtag  DW_TAG_member
    1433        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1434        .dwattr $C$DW$86, DW_AT_name("PRU1_GPO_DIV0")
    1435        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1436        .dwattr $C$DW$86, DW_AT_bit_offset(0x0c)
    1437        .dwattr $C$DW$86, DW_AT_bit_size(0x05)
    1438        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1440        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1441        .dwattr $C$DW$86, DW_AT_decl_line(0x5e)
    1442        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1443
    1444$C$DW$87        .dwtag  DW_TAG_member
    1445        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1446        .dwattr $C$DW$87, DW_AT_name("PRU1_GPO_DIV1")
    1447        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1448        .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
    1449        .dwattr $C$DW$87, DW_AT_bit_size(0x05)
    1450        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1452        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1453        .dwattr $C$DW$87, DW_AT_decl_line(0x5f)
    1454        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1455
    1456$C$DW$88        .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1458        .dwattr $C$DW$88, DW_AT_name("PRU1_GPO_SH_SEL")
    1459        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1460        .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
    1461        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1462        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1464        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1465        .dwattr $C$DW$88, DW_AT_decl_line(0x60)
    1466        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1467
    1468$C$DW$89        .dwtag  DW_TAG_member
    1469        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1470        .dwattr $C$DW$89, DW_AT_name("rsvd26")
    1471        .dwattr $C$DW$89, DW_AT_TI_symbol_name("rsvd26")
    1472        .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1473        .dwattr $C$DW$89, DW_AT_bit_size(0x06)
    1474        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1476        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1477        .dwattr $C$DW$89, DW_AT_decl_line(0x61)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   28

    1478        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1479
    1480        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1481        .dwattr $C$DW$T$40, DW_AT_decl_line(0x57)
    1482        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1483        .dwendtag $C$DW$T$40
    1484
    1485$C$DW$T$86      .dwtag  DW_TAG_volatile_type
    1486        .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$40)
    1487
    1488
    1489$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1490        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1491$C$DW$90        .dwtag  DW_TAG_member
    1492        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1493        .dwattr $C$DW$90, DW_AT_name("PRU0_CLK_STOP_REQ")
    1494        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1495        .dwattr $C$DW$90, DW_AT_bit_offset(0x1f)
    1496        .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1497        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1499        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1500        .dwattr $C$DW$90, DW_AT_decl_line(0x6b)
    1501        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1502
    1503$C$DW$91        .dwtag  DW_TAG_member
    1504        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1505        .dwattr $C$DW$91, DW_AT_name("PRU0_CLK_STOP_ACK")
    1506        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1507        .dwattr $C$DW$91, DW_AT_bit_offset(0x1e)
    1508        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1509        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1511        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1512        .dwattr $C$DW$91, DW_AT_decl_line(0x6c)
    1513        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1514
    1515$C$DW$92        .dwtag  DW_TAG_member
    1516        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1517        .dwattr $C$DW$92, DW_AT_name("PRU0_CLK_EN")
    1518        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1519        .dwattr $C$DW$92, DW_AT_bit_offset(0x1d)
    1520        .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1521        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1523        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1524        .dwattr $C$DW$92, DW_AT_decl_line(0x6d)
    1525        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1526
    1527$C$DW$93        .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$93, DW_AT_name("PRU1_CLK_STOP_REQ")
    1530        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1531        .dwattr $C$DW$93, DW_AT_bit_offset(0x1c)
    1532        .dwattr $C$DW$93, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   29

    1533        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1535        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1536        .dwattr $C$DW$93, DW_AT_decl_line(0x6e)
    1537        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1538
    1539$C$DW$94        .dwtag  DW_TAG_member
    1540        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1541        .dwattr $C$DW$94, DW_AT_name("PRU1_CLK_STOP_ACK")
    1542        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1543        .dwattr $C$DW$94, DW_AT_bit_offset(0x1b)
    1544        .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1545        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1547        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1548        .dwattr $C$DW$94, DW_AT_decl_line(0x6f)
    1549        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1550
    1551$C$DW$95        .dwtag  DW_TAG_member
    1552        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1553        .dwattr $C$DW$95, DW_AT_name("PRU1_CLK_EN")
    1554        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1555        .dwattr $C$DW$95, DW_AT_bit_offset(0x1a)
    1556        .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1557        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1559        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1560        .dwattr $C$DW$95, DW_AT_decl_line(0x70)
    1561        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1562
    1563$C$DW$96        .dwtag  DW_TAG_member
    1564        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1565        .dwattr $C$DW$96, DW_AT_name("INTC_CLK_STOP_REQ")
    1566        .dwattr $C$DW$96, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1567        .dwattr $C$DW$96, DW_AT_bit_offset(0x19)
    1568        .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1569        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1571        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1572        .dwattr $C$DW$96, DW_AT_decl_line(0x71)
    1573        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1574
    1575$C$DW$97        .dwtag  DW_TAG_member
    1576        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1577        .dwattr $C$DW$97, DW_AT_name("INTC_CLK_STOP_ACK")
    1578        .dwattr $C$DW$97, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1579        .dwattr $C$DW$97, DW_AT_bit_offset(0x18)
    1580        .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1581        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1584        .dwattr $C$DW$97, DW_AT_decl_line(0x72)
    1585        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1586
    1587$C$DW$98        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   30

    1588        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1589        .dwattr $C$DW$98, DW_AT_name("INTC_CLK_EN")
    1590        .dwattr $C$DW$98, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1591        .dwattr $C$DW$98, DW_AT_bit_offset(0x17)
    1592        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1593        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1595        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1596        .dwattr $C$DW$98, DW_AT_decl_line(0x73)
    1597        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1598
    1599$C$DW$99        .dwtag  DW_TAG_member
    1600        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1601        .dwattr $C$DW$99, DW_AT_name("UART_CLK_STOP_REQ")
    1602        .dwattr $C$DW$99, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1603        .dwattr $C$DW$99, DW_AT_bit_offset(0x16)
    1604        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1605        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1607        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1608        .dwattr $C$DW$99, DW_AT_decl_line(0x74)
    1609        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1610
    1611$C$DW$100       .dwtag  DW_TAG_member
    1612        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1613        .dwattr $C$DW$100, DW_AT_name("UART_CLK_STOP_ACK")
    1614        .dwattr $C$DW$100, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1615        .dwattr $C$DW$100, DW_AT_bit_offset(0x15)
    1616        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1617        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1619        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1620        .dwattr $C$DW$100, DW_AT_decl_line(0x75)
    1621        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1622
    1623$C$DW$101       .dwtag  DW_TAG_member
    1624        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1625        .dwattr $C$DW$101, DW_AT_name("UART_CLK_EN")
    1626        .dwattr $C$DW$101, DW_AT_TI_symbol_name("UART_CLK_EN")
    1627        .dwattr $C$DW$101, DW_AT_bit_offset(0x14)
    1628        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1629        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1631        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1632        .dwattr $C$DW$101, DW_AT_decl_line(0x76)
    1633        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1634
    1635$C$DW$102       .dwtag  DW_TAG_member
    1636        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1637        .dwattr $C$DW$102, DW_AT_name("ECAP_CLK_STOP_REQ")
    1638        .dwattr $C$DW$102, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1639        .dwattr $C$DW$102, DW_AT_bit_offset(0x13)
    1640        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1641        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   31

    1643        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1644        .dwattr $C$DW$102, DW_AT_decl_line(0x77)
    1645        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1646
    1647$C$DW$103       .dwtag  DW_TAG_member
    1648        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1649        .dwattr $C$DW$103, DW_AT_name("ECAP_CLK_STOP_ACK")
    1650        .dwattr $C$DW$103, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1651        .dwattr $C$DW$103, DW_AT_bit_offset(0x12)
    1652        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1653        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1655        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1656        .dwattr $C$DW$103, DW_AT_decl_line(0x78)
    1657        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1658
    1659$C$DW$104       .dwtag  DW_TAG_member
    1660        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1661        .dwattr $C$DW$104, DW_AT_name("ECAP_CLK_EN")
    1662        .dwattr $C$DW$104, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1663        .dwattr $C$DW$104, DW_AT_bit_offset(0x11)
    1664        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1665        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1667        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1668        .dwattr $C$DW$104, DW_AT_decl_line(0x79)
    1669        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1670
    1671$C$DW$105       .dwtag  DW_TAG_member
    1672        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1673        .dwattr $C$DW$105, DW_AT_name("IEP_CLK_STOP_REQ")
    1674        .dwattr $C$DW$105, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1675        .dwattr $C$DW$105, DW_AT_bit_offset(0x10)
    1676        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1677        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1679        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1680        .dwattr $C$DW$105, DW_AT_decl_line(0x7a)
    1681        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1682
    1683$C$DW$106       .dwtag  DW_TAG_member
    1684        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1685        .dwattr $C$DW$106, DW_AT_name("IEP_CLK_STOP_ACK")
    1686        .dwattr $C$DW$106, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1687        .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1688        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1689        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1691        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1692        .dwattr $C$DW$106, DW_AT_decl_line(0x7b)
    1693        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1694
    1695$C$DW$107       .dwtag  DW_TAG_member
    1696        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1697        .dwattr $C$DW$107, DW_AT_name("IEP_CLK_EN")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   32

    1698        .dwattr $C$DW$107, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1699        .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1700        .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1701        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1703        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1704        .dwattr $C$DW$107, DW_AT_decl_line(0x7c)
    1705        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1706
    1707$C$DW$108       .dwtag  DW_TAG_member
    1708        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1709        .dwattr $C$DW$108, DW_AT_name("rsvd18")
    1710        .dwattr $C$DW$108, DW_AT_TI_symbol_name("rsvd18")
    1711        .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1712        .dwattr $C$DW$108, DW_AT_bit_size(0x0e)
    1713        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1715        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1716        .dwattr $C$DW$108, DW_AT_decl_line(0x7d)
    1717        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1718
    1719        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1720        .dwattr $C$DW$T$41, DW_AT_decl_line(0x6a)
    1721        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1722        .dwendtag $C$DW$T$41
    1723
    1724$C$DW$T$88      .dwtag  DW_TAG_volatile_type
    1725        .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$41)
    1726
    1727
    1728$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1729        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1730$C$DW$109       .dwtag  DW_TAG_member
    1731        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1732        .dwattr $C$DW$109, DW_AT_name("PRU0_IMEM_PE_RAW")
    1733        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1734        .dwattr $C$DW$109, DW_AT_bit_offset(0x1c)
    1735        .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1736        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1738        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1739        .dwattr $C$DW$109, DW_AT_decl_line(0x87)
    1740        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1741
    1742$C$DW$110       .dwtag  DW_TAG_member
    1743        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1744        .dwattr $C$DW$110, DW_AT_name("PRU0_DMEM_PE_RAW")
    1745        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1746        .dwattr $C$DW$110, DW_AT_bit_offset(0x18)
    1747        .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1748        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1750        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1751        .dwattr $C$DW$110, DW_AT_decl_line(0x88)
    1752        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   33

    1753
    1754$C$DW$111       .dwtag  DW_TAG_member
    1755        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1756        .dwattr $C$DW$111, DW_AT_name("PRU1_IMEM_PE_RAW")
    1757        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1758        .dwattr $C$DW$111, DW_AT_bit_offset(0x14)
    1759        .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1760        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1762        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1763        .dwattr $C$DW$111, DW_AT_decl_line(0x89)
    1764        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1765
    1766$C$DW$112       .dwtag  DW_TAG_member
    1767        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1768        .dwattr $C$DW$112, DW_AT_name("PRU1_DMEM_PE_RAW")
    1769        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1770        .dwattr $C$DW$112, DW_AT_bit_offset(0x10)
    1771        .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1772        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1774        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1775        .dwattr $C$DW$112, DW_AT_decl_line(0x8a)
    1776        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1777
    1778$C$DW$113       .dwtag  DW_TAG_member
    1779        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1780        .dwattr $C$DW$113, DW_AT_name("RAM_PE_RAW")
    1781        .dwattr $C$DW$113, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1782        .dwattr $C$DW$113, DW_AT_bit_offset(0x0c)
    1783        .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1784        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1786        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1787        .dwattr $C$DW$113, DW_AT_decl_line(0x8b)
    1788        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1789
    1790$C$DW$114       .dwtag  DW_TAG_member
    1791        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1792        .dwattr $C$DW$114, DW_AT_name("rsvd20")
    1793        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd20")
    1794        .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1795        .dwattr $C$DW$114, DW_AT_bit_size(0x0c)
    1796        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1797        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1798        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1799        .dwattr $C$DW$114, DW_AT_decl_line(0x8c)
    1800        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1801
    1802        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1803        .dwattr $C$DW$T$42, DW_AT_decl_line(0x86)
    1804        .dwattr $C$DW$T$42, DW_AT_decl_column(0x14)
    1805        .dwendtag $C$DW$T$42
    1806
    1807$C$DW$T$90      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   34

    1808        .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$42)
    1809
    1810
    1811$C$DW$T$43      .dwtag  DW_TAG_structure_type
    1812        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    1813$C$DW$115       .dwtag  DW_TAG_member
    1814        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1815        .dwattr $C$DW$115, DW_AT_name("PRU0_IMEM_PE")
    1816        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1817        .dwattr $C$DW$115, DW_AT_bit_offset(0x1c)
    1818        .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1819        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1821        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1822        .dwattr $C$DW$115, DW_AT_decl_line(0x96)
    1823        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1824
    1825$C$DW$116       .dwtag  DW_TAG_member
    1826        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1827        .dwattr $C$DW$116, DW_AT_name("PRU0_DMEM_PE")
    1828        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1829        .dwattr $C$DW$116, DW_AT_bit_offset(0x18)
    1830        .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1831        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1833        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1834        .dwattr $C$DW$116, DW_AT_decl_line(0x97)
    1835        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1836
    1837$C$DW$117       .dwtag  DW_TAG_member
    1838        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1839        .dwattr $C$DW$117, DW_AT_name("PRU1_IMEM_PE")
    1840        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1841        .dwattr $C$DW$117, DW_AT_bit_offset(0x14)
    1842        .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    1843        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1845        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1846        .dwattr $C$DW$117, DW_AT_decl_line(0x98)
    1847        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1848
    1849$C$DW$118       .dwtag  DW_TAG_member
    1850        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1851        .dwattr $C$DW$118, DW_AT_name("PRU1_DMEM_PE")
    1852        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1853        .dwattr $C$DW$118, DW_AT_bit_offset(0x10)
    1854        .dwattr $C$DW$118, DW_AT_bit_size(0x04)
    1855        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1857        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1858        .dwattr $C$DW$118, DW_AT_decl_line(0x99)
    1859        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1860
    1861$C$DW$119       .dwtag  DW_TAG_member
    1862        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   35

    1863        .dwattr $C$DW$119, DW_AT_name("RAM_PE")
    1864        .dwattr $C$DW$119, DW_AT_TI_symbol_name("RAM_PE")
    1865        .dwattr $C$DW$119, DW_AT_bit_offset(0x0c)
    1866        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1867        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1869        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1870        .dwattr $C$DW$119, DW_AT_decl_line(0x9a)
    1871        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1872
    1873$C$DW$120       .dwtag  DW_TAG_member
    1874        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1875        .dwattr $C$DW$120, DW_AT_name("rsvd20")
    1876        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd20")
    1877        .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1878        .dwattr $C$DW$120, DW_AT_bit_size(0x0c)
    1879        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1881        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1882        .dwattr $C$DW$120, DW_AT_decl_line(0x9b)
    1883        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1884
    1885        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1886        .dwattr $C$DW$T$43, DW_AT_decl_line(0x95)
    1887        .dwattr $C$DW$T$43, DW_AT_decl_column(0x14)
    1888        .dwendtag $C$DW$T$43
    1889
    1890$C$DW$T$92      .dwtag  DW_TAG_volatile_type
    1891        .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$43)
    1892
    1893
    1894$C$DW$T$44      .dwtag  DW_TAG_structure_type
    1895        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1896$C$DW$121       .dwtag  DW_TAG_member
    1897        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1898        .dwattr $C$DW$121, DW_AT_name("PRU0_IMEM_PE_SET")
    1899        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1900        .dwattr $C$DW$121, DW_AT_bit_offset(0x1c)
    1901        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    1902        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1904        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1905        .dwattr $C$DW$121, DW_AT_decl_line(0xa4)
    1906        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1907
    1908$C$DW$122       .dwtag  DW_TAG_member
    1909        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1910        .dwattr $C$DW$122, DW_AT_name("PRU0_DMEM_PE_SET")
    1911        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1912        .dwattr $C$DW$122, DW_AT_bit_offset(0x18)
    1913        .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1914        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1916        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1917        .dwattr $C$DW$122, DW_AT_decl_line(0xa5)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   36

    1918        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1919
    1920$C$DW$123       .dwtag  DW_TAG_member
    1921        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1922        .dwattr $C$DW$123, DW_AT_name("PRU1_IMEM_PE_SET")
    1923        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1924        .dwattr $C$DW$123, DW_AT_bit_offset(0x14)
    1925        .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    1926        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1928        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1929        .dwattr $C$DW$123, DW_AT_decl_line(0xa6)
    1930        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1931
    1932$C$DW$124       .dwtag  DW_TAG_member
    1933        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1934        .dwattr $C$DW$124, DW_AT_name("PRU1_DMEM_PE_SET")
    1935        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1936        .dwattr $C$DW$124, DW_AT_bit_offset(0x10)
    1937        .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    1938        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1940        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1941        .dwattr $C$DW$124, DW_AT_decl_line(0xa7)
    1942        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1943
    1944$C$DW$125       .dwtag  DW_TAG_member
    1945        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1946        .dwattr $C$DW$125, DW_AT_name("RAM_PE_SET")
    1947        .dwattr $C$DW$125, DW_AT_TI_symbol_name("RAM_PE_SET")
    1948        .dwattr $C$DW$125, DW_AT_bit_offset(0x0c)
    1949        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1950        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1952        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1953        .dwattr $C$DW$125, DW_AT_decl_line(0xa8)
    1954        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1955
    1956$C$DW$126       .dwtag  DW_TAG_member
    1957        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1958        .dwattr $C$DW$126, DW_AT_name("rsvd20")
    1959        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd20")
    1960        .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1961        .dwattr $C$DW$126, DW_AT_bit_size(0x0c)
    1962        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1964        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1965        .dwattr $C$DW$126, DW_AT_decl_line(0xa9)
    1966        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1967
    1968        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1969        .dwattr $C$DW$T$44, DW_AT_decl_line(0xa3)
    1970        .dwattr $C$DW$T$44, DW_AT_decl_column(0x13)
    1971        .dwendtag $C$DW$T$44
    1972
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   37

    1973$C$DW$T$94      .dwtag  DW_TAG_volatile_type
    1974        .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$44)
    1975
    1976
    1977$C$DW$T$45      .dwtag  DW_TAG_structure_type
    1978        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    1979$C$DW$127       .dwtag  DW_TAG_member
    1980        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1981        .dwattr $C$DW$127, DW_AT_name("PRU0_IMEM_PE_CLR")
    1982        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1983        .dwattr $C$DW$127, DW_AT_bit_offset(0x1c)
    1984        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    1985        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1987        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1988        .dwattr $C$DW$127, DW_AT_decl_line(0xb3)
    1989        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1990
    1991$C$DW$128       .dwtag  DW_TAG_member
    1992        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1993        .dwattr $C$DW$128, DW_AT_name("PRU0_DMEM_PE_CLR")
    1994        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1995        .dwattr $C$DW$128, DW_AT_bit_offset(0x18)
    1996        .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1997        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1999        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2000        .dwattr $C$DW$128, DW_AT_decl_line(0xb4)
    2001        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2002
    2003$C$DW$129       .dwtag  DW_TAG_member
    2004        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2005        .dwattr $C$DW$129, DW_AT_name("PRU1_IMEM_PE_CLR")
    2006        .dwattr $C$DW$129, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2007        .dwattr $C$DW$129, DW_AT_bit_offset(0x14)
    2008        .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    2009        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2011        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2012        .dwattr $C$DW$129, DW_AT_decl_line(0xb5)
    2013        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2014
    2015$C$DW$130       .dwtag  DW_TAG_member
    2016        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2017        .dwattr $C$DW$130, DW_AT_name("PRU1_DMEM_PE_CLR")
    2018        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2019        .dwattr $C$DW$130, DW_AT_bit_offset(0x10)
    2020        .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    2021        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2023        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2024        .dwattr $C$DW$130, DW_AT_decl_line(0xb6)
    2025        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2026
    2027$C$DW$131       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   38

    2028        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2029        .dwattr $C$DW$131, DW_AT_name("rsvd16")
    2030        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd16")
    2031        .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    2032        .dwattr $C$DW$131, DW_AT_bit_size(0x10)
    2033        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2035        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2036        .dwattr $C$DW$131, DW_AT_decl_line(0xb7)
    2037        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2038
    2039        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2040        .dwattr $C$DW$T$45, DW_AT_decl_line(0xb2)
    2041        .dwattr $C$DW$T$45, DW_AT_decl_column(0x13)
    2042        .dwendtag $C$DW$T$45
    2043
    2044$C$DW$T$96      .dwtag  DW_TAG_volatile_type
    2045        .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$45)
    2046
    2047
    2048$C$DW$T$46      .dwtag  DW_TAG_structure_type
    2049        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    2050$C$DW$132       .dwtag  DW_TAG_member
    2051        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2052        .dwattr $C$DW$132, DW_AT_name("PMAO_PRU0")
    2053        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PMAO_PRU0")
    2054        .dwattr $C$DW$132, DW_AT_bit_offset(0x1f)
    2055        .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2056        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2058        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2059        .dwattr $C$DW$132, DW_AT_decl_line(0xc4)
    2060        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2061
    2062$C$DW$133       .dwtag  DW_TAG_member
    2063        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2064        .dwattr $C$DW$133, DW_AT_name("PMAO_PRU1")
    2065        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PMAO_PRU1")
    2066        .dwattr $C$DW$133, DW_AT_bit_offset(0x1e)
    2067        .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2068        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2070        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2071        .dwattr $C$DW$133, DW_AT_decl_line(0xc5)
    2072        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2073
    2074$C$DW$134       .dwtag  DW_TAG_member
    2075        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2076        .dwattr $C$DW$134, DW_AT_name("rsvd2")
    2077        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd2")
    2078        .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2079        .dwattr $C$DW$134, DW_AT_bit_size(0x1e)
    2080        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:36 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_init.asm                                           PAGE   39

    2083        .dwattr $C$DW$134, DW_AT_decl_line(0xc6)
    2084        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2085
    2086        .dwattr $C$DW$T$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2087        .dwattr $C$DW$T$46, DW_AT_decl_line(0xc3)
    2088        .dwattr $C$DW$T$46, DW_AT_decl_column(0x13)
    2089        .dwendtag $C$DW$T$46
    2090
    2091$C$DW$T$98      .dwtag  DW_TAG_volatile_type
    2092        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$46)
    2093
    2094
    2095$C$DW$T$47      .dwtag  DW_TAG_structure_type
    2096        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2097$C$DW$135       .dwtag  DW_TAG_member
    2098        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2099        .dwattr $C$DW$135, DW_AT_name("OCP_EN")
    2100        .dwattr $C$DW$135, DW_AT_TI_symbol_name("OCP_EN")
    2101        .dwattr $C$DW$135, DW_AT_bit_offset(0x1f)
    2102        .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2103        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2105        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2106        .dwattr $C$DW$135, DW_AT_decl_line(0xd3)
    2107        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2108
    2109$C$DW$136       .dwtag  DW_TAG_member
    2110        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2111        .dwattr $C$DW$136, DW_AT_name("rsvd1")
    2112        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd1")
    2113        .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2114        .dwattr $C$DW$136, DW_AT_bit_size(0x1f)
    2115        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2117        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
