PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:30 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_buslatches.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

     873 000000a0 000188240000C8          LDI32    r8, 1
         000000a7 00000000004024 
     874 000000a8 0000000501E8E8  $1:     SUB      r8, r8, 1
     875 000000ac 0000006F00E8FF          QBNE     $1, r8, 0             ; [ALU_PRU] |169| 
     876 000000b0 000000240F00FE          LDI       r30, 0x0f00           ; [ALU_PRU] |169| 
     877        .dwpsn  file "pru1_buslatches.c",line 170,column 2,is_stmt,isa 0
     878;----------------------------------------------------------------------
     879; 170 | __delay_cycles(MILLISECS(250)); // "power supply stabilizing"          
     880;----------------------------------------------------------------------
     881        .newblock
     882 000000b4 783F8724017DC7          LDI32    r7, 24999999
         000000bb 00000000004024 
     883 000000bc 0000000501E7E7  $1:     SUB      r7, r7, 1
     884 000000c0 0000006F00E7FF          QBNE     $1, r7, 0             ; [ALU_PRU] |170| 
     885        .dwpsn  file "pru1_buslatches.c",line 171,column 2,is_stmt,isa 0
     886;----------------------------------------------------------------------
     887; 171 | buslatches_setbits(7, BIT(5), 0); // DCLO deasserted                   
     888; 172 | // CPU has to generate INIT and BBSY                                   
     889;----------------------------------------------------------------------
     890 000000c4 000000F1000500          LBBO      &r0.b0, r5, 0, 1      ; [ALU_PRU] |171| $O$C1
     891 000000c8 00000011DF0004          AND       r4.b0, r0.b0, 0xdf    ; [ALU_PRU] |171| $O$C2
     892 000000cc 000000100404EE          MOV       r14, r4.b0            ; [ALU_PRU] |171| $O$C2
     893$C$DW$37        .dwtag  DW_TAG_TI_branch
     894        .dwattr $C$DW$37, DW_AT_low_pc(0x00)
     895        .dwattr $C$DW$37, DW_AT_name("buslatches_pru0_dataout")
     896        .dwattr $C$DW$37, DW_AT_TI_call
     897
     898 000000d0 000000230000C3!         JAL       r3.w2, ||buslatches_pru0_dataout|| ; [ALU_PRU] |171| buslatches_pru0_dataout
     899 000000d4 000000240700FE          LDI       r30, 0x0700           ; [ALU_PRU] |171| 
     900 000000d8 000000E1000504          SBBO      &r4.b0, r5, 0, 1      ; [ALU_PRU] |171| $O$C1,_tmpval
     901        .newblock
     902 000000dc 000186240000C6          LDI32    r6, 1
         000000e3 00000000004024 
     903 000000e4 0000000501E6E6  $1:     SUB      r6, r6, 1
     904 000000e8 0000006F00E6FF          QBNE     $1, r6, 0             ; [ALU_PRU] |171| 
     905 000000ec 000000240F00FE          LDI       r30, 0x0f00           ; [ALU_PRU] |171| 
     906 000000f0 000000F1002243          LBBO      &r3.b2, r2, 0, 3      ; [ALU_PRU] 
     907        .dwcfi  restore_reg, 14
     908        .dwcfi  restore_reg, 15
     909        .dwcfi  restore_reg, 16
     910 000000f4 000000F303E285          LBBO      &r5.b0, r2, 3, 32     ; [ALU_PRU] 
     911        .dwcfi  restore_reg, 20
     912        .dwcfi  restore_reg, 21
     913        .dwcfi  restore_reg, 22
     914        .dwcfi  restore_reg, 23
     915        .dwcfi  restore_reg, 24
     916        .dwcfi  restore_reg, 25
     917        .dwcfi  restore_reg, 26
     918        .dwcfi  restore_reg, 27
     919        .dwcfi  restore_reg, 28
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   18

     920        .dwcfi  restore_reg, 29
     921        .dwcfi  restore_reg, 30
     922        .dwcfi  restore_reg, 31
     923        .dwcfi  restore_reg, 32
     924        .dwcfi  restore_reg, 33
     925        .dwcfi  restore_reg, 34
     926        .dwcfi  restore_reg, 35
     927        .dwcfi  restore_reg, 36
     928        .dwcfi  restore_reg, 37
     929        .dwcfi  restore_reg, 38
     930        .dwcfi  restore_reg, 39
     931        .dwcfi  restore_reg, 40
     932        .dwcfi  restore_reg, 41
     933        .dwcfi  restore_reg, 42
     934        .dwcfi  restore_reg, 43
     935        .dwcfi  restore_reg, 44
     936        .dwcfi  restore_reg, 45
     937        .dwcfi  restore_reg, 46
     938        .dwcfi  restore_reg, 47
     939        .dwcfi  restore_reg, 48
     940        .dwcfi  restore_reg, 49
     941        .dwcfi  restore_reg, 50
     942        .dwcfi  restore_reg, 51
     943 000000f8 0000000123E2E2          ADD       r2, r2, 0x23          ; [ALU_PRU] 
     944        .dwcfi  cfa_offset, 0
     945$C$DW$38        .dwtag  DW_TAG_TI_branch
     946        .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     947        .dwattr $C$DW$38, DW_AT_TI_return
     948
     949 000000fc 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     950        .dwattr $C$DW$24, DW_AT_TI_end_file("pru1_buslatches.c")
     951        .dwattr $C$DW$24, DW_AT_TI_end_line(0xad)
     952        .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     953        .dwendentry
     954        .dwendtag $C$DW$24
     955
     956;*****************************************************************************
     957;* UNDEFINED EXTERNAL REFERENCES                                             *
     958;*****************************************************************************
     959        .global ||buslatches_pru0_dataout||
     960
     961;******************************************************************************
     962;* TYPE INFORMATION                                                           *
     963;******************************************************************************
     964
     965$C$DW$T$19      .dwtag  DW_TAG_structure_type
     966        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     967$C$DW$39        .dwtag  DW_TAG_member
     968        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     969        .dwattr $C$DW$39, DW_AT_name("REVID")
     970        .dwattr $C$DW$39, DW_AT_TI_symbol_name("REVID")
     971        .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     972        .dwattr $C$DW$39, DW_AT_bit_size(0x20)
     973        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   19

     975        .dwattr $C$DW$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     976        .dwattr $C$DW$39, DW_AT_decl_line(0x2d)
     977        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     978
     979        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     980        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     981        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     982        .dwendtag $C$DW$T$19
     983
     984$C$DW$T$40      .dwtag  DW_TAG_volatile_type
     985        .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$19)
     986
     987
     988$C$DW$T$20      .dwtag  DW_TAG_structure_type
     989        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     990$C$DW$40        .dwtag  DW_TAG_member
     991        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     992        .dwattr $C$DW$40, DW_AT_name("IDLE_MODE")
     993        .dwattr $C$DW$40, DW_AT_TI_symbol_name("IDLE_MODE")
     994        .dwattr $C$DW$40, DW_AT_bit_offset(0x1e)
     995        .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     996        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     998        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
     999        .dwattr $C$DW$40, DW_AT_decl_line(0x37)
    1000        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
    1001
    1002$C$DW$41        .dwtag  DW_TAG_member
    1003        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
    1004        .dwattr $C$DW$41, DW_AT_name("STANDBY_MODE")
    1005        .dwattr $C$DW$41, DW_AT_TI_symbol_name("STANDBY_MODE")
    1006        .dwattr $C$DW$41, DW_AT_bit_offset(0x1c)
    1007        .dwattr $C$DW$41, DW_AT_bit_size(0x02)
    1008        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1010        .dwattr $C$DW$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1011        .dwattr $C$DW$41, DW_AT_decl_line(0x38)
    1012        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
    1013
    1014$C$DW$42        .dwtag  DW_TAG_member
    1015        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
    1016        .dwattr $C$DW$42, DW_AT_name("STANDBY_INIT")
    1017        .dwattr $C$DW$42, DW_AT_TI_symbol_name("STANDBY_INIT")
    1018        .dwattr $C$DW$42, DW_AT_bit_offset(0x1b)
    1019        .dwattr $C$DW$42, DW_AT_bit_size(0x01)
    1020        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1022        .dwattr $C$DW$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1023        .dwattr $C$DW$42, DW_AT_decl_line(0x39)
    1024        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
    1025
    1026$C$DW$43        .dwtag  DW_TAG_member
    1027        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
    1028        .dwattr $C$DW$43, DW_AT_name("SUB_MWAIT")
    1029        .dwattr $C$DW$43, DW_AT_TI_symbol_name("SUB_MWAIT")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   20

    1030        .dwattr $C$DW$43, DW_AT_bit_offset(0x1a)
    1031        .dwattr $C$DW$43, DW_AT_bit_size(0x01)
    1032        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1034        .dwattr $C$DW$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1035        .dwattr $C$DW$43, DW_AT_decl_line(0x3a)
    1036        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
    1037
    1038$C$DW$44        .dwtag  DW_TAG_member
    1039        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
    1040        .dwattr $C$DW$44, DW_AT_name("rsvd6")
    1041        .dwattr $C$DW$44, DW_AT_TI_symbol_name("rsvd6")
    1042        .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
    1043        .dwattr $C$DW$44, DW_AT_bit_size(0x1a)
    1044        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1046        .dwattr $C$DW$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1047        .dwattr $C$DW$44, DW_AT_decl_line(0x3b)
    1048        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1049
    1050        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1051        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1052        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1053        .dwendtag $C$DW$T$20
    1054
    1055$C$DW$T$42      .dwtag  DW_TAG_volatile_type
    1056        .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$20)
    1057
    1058
    1059$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1060        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1061$C$DW$45        .dwtag  DW_TAG_member
    1062        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
    1063        .dwattr $C$DW$45, DW_AT_name("PRU0_GPI_MODE")
    1064        .dwattr $C$DW$45, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1065        .dwattr $C$DW$45, DW_AT_bit_offset(0x1e)
    1066        .dwattr $C$DW$45, DW_AT_bit_size(0x02)
    1067        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1069        .dwattr $C$DW$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1070        .dwattr $C$DW$45, DW_AT_decl_line(0x45)
    1071        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1072
    1073$C$DW$46        .dwtag  DW_TAG_member
    1074        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
    1075        .dwattr $C$DW$46, DW_AT_name("PRU0_GPI_CLK_MODE")
    1076        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1077        .dwattr $C$DW$46, DW_AT_bit_offset(0x1d)
    1078        .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1079        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1081        .dwattr $C$DW$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1082        .dwattr $C$DW$46, DW_AT_decl_line(0x46)
    1083        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1084
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   21

    1085$C$DW$47        .dwtag  DW_TAG_member
    1086        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
    1087        .dwattr $C$DW$47, DW_AT_name("PRU0_GPI_DIV0")
    1088        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1089        .dwattr $C$DW$47, DW_AT_bit_offset(0x18)
    1090        .dwattr $C$DW$47, DW_AT_bit_size(0x05)
    1091        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1093        .dwattr $C$DW$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1094        .dwattr $C$DW$47, DW_AT_decl_line(0x47)
    1095        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
    1096
    1097$C$DW$48        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
    1099        .dwattr $C$DW$48, DW_AT_name("PRU0_GPI_DIV1")
    1100        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1101        .dwattr $C$DW$48, DW_AT_bit_offset(0x13)
    1102        .dwattr $C$DW$48, DW_AT_bit_size(0x05)
    1103        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1106        .dwattr $C$DW$48, DW_AT_decl_line(0x48)
    1107        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
    1108
    1109$C$DW$49        .dwtag  DW_TAG_member
    1110        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
    1111        .dwattr $C$DW$49, DW_AT_name("PRU0_GPI_SB")
    1112        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1113        .dwattr $C$DW$49, DW_AT_bit_offset(0x12)
    1114        .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1115        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1117        .dwattr $C$DW$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1118        .dwattr $C$DW$49, DW_AT_decl_line(0x49)
    1119        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1120
    1121$C$DW$50        .dwtag  DW_TAG_member
    1122        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
    1123        .dwattr $C$DW$50, DW_AT_name("PRU0_GPO_MODE")
    1124        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1125        .dwattr $C$DW$50, DW_AT_bit_offset(0x11)
    1126        .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1127        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1129        .dwattr $C$DW$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1130        .dwattr $C$DW$50, DW_AT_decl_line(0x4a)
    1131        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
    1132
    1133$C$DW$51        .dwtag  DW_TAG_member
    1134        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
    1135        .dwattr $C$DW$51, DW_AT_name("PRU0_GPO_DIV0")
    1136        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1137        .dwattr $C$DW$51, DW_AT_bit_offset(0x0c)
    1138        .dwattr $C$DW$51, DW_AT_bit_size(0x05)
    1139        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   22

    1140        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1141        .dwattr $C$DW$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1142        .dwattr $C$DW$51, DW_AT_decl_line(0x4b)
    1143        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
    1144
    1145$C$DW$52        .dwtag  DW_TAG_member
    1146        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
    1147        .dwattr $C$DW$52, DW_AT_name("PRU0_GPO_DIV1")
    1148        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1149        .dwattr $C$DW$52, DW_AT_bit_offset(0x07)
    1150        .dwattr $C$DW$52, DW_AT_bit_size(0x05)
    1151        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1153        .dwattr $C$DW$52, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1154        .dwattr $C$DW$52, DW_AT_decl_line(0x4c)
    1155        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1156
    1157$C$DW$53        .dwtag  DW_TAG_member
    1158        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
    1159        .dwattr $C$DW$53, DW_AT_name("PRU0_GPO_SH_SEL")
    1160        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1161        .dwattr $C$DW$53, DW_AT_bit_offset(0x06)
    1162        .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1163        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1165        .dwattr $C$DW$53, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1166        .dwattr $C$DW$53, DW_AT_decl_line(0x4d)
    1167        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
    1168
    1169$C$DW$54        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
    1171        .dwattr $C$DW$54, DW_AT_name("rsvd26")
    1172        .dwattr $C$DW$54, DW_AT_TI_symbol_name("rsvd26")
    1173        .dwattr $C$DW$54, DW_AT_bit_offset(0x00)
    1174        .dwattr $C$DW$54, DW_AT_bit_size(0x06)
    1175        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1177        .dwattr $C$DW$54, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1178        .dwattr $C$DW$54, DW_AT_decl_line(0x4e)
    1179        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
    1180
    1181        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1182        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1183        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1184        .dwendtag $C$DW$T$21
    1185
    1186$C$DW$T$44      .dwtag  DW_TAG_volatile_type
    1187        .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$21)
    1188
    1189
    1190$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1191        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1192$C$DW$55        .dwtag  DW_TAG_member
    1193        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
    1194        .dwattr $C$DW$55, DW_AT_name("PRU1_GPI_MODE")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   23

    1195        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1196        .dwattr $C$DW$55, DW_AT_bit_offset(0x1e)
    1197        .dwattr $C$DW$55, DW_AT_bit_size(0x02)
    1198        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1200        .dwattr $C$DW$55, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1201        .dwattr $C$DW$55, DW_AT_decl_line(0x58)
    1202        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1203
    1204$C$DW$56        .dwtag  DW_TAG_member
    1205        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1206        .dwattr $C$DW$56, DW_AT_name("PRU1_GPI_CLK_MODE")
    1207        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1208        .dwattr $C$DW$56, DW_AT_bit_offset(0x1d)
    1209        .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1210        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1212        .dwattr $C$DW$56, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1213        .dwattr $C$DW$56, DW_AT_decl_line(0x59)
    1214        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1215
    1216$C$DW$57        .dwtag  DW_TAG_member
    1217        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1218        .dwattr $C$DW$57, DW_AT_name("PRU1_GPI_DIV0")
    1219        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1220        .dwattr $C$DW$57, DW_AT_bit_offset(0x18)
    1221        .dwattr $C$DW$57, DW_AT_bit_size(0x05)
    1222        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1224        .dwattr $C$DW$57, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1225        .dwattr $C$DW$57, DW_AT_decl_line(0x5a)
    1226        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1227
    1228$C$DW$58        .dwtag  DW_TAG_member
    1229        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1230        .dwattr $C$DW$58, DW_AT_name("PRU1_GPI_DIV1")
    1231        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1232        .dwattr $C$DW$58, DW_AT_bit_offset(0x13)
    1233        .dwattr $C$DW$58, DW_AT_bit_size(0x05)
    1234        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1236        .dwattr $C$DW$58, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1237        .dwattr $C$DW$58, DW_AT_decl_line(0x5b)
    1238        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1239
    1240$C$DW$59        .dwtag  DW_TAG_member
    1241        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1242        .dwattr $C$DW$59, DW_AT_name("PRU1_GPI_SB")
    1243        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1244        .dwattr $C$DW$59, DW_AT_bit_offset(0x12)
    1245        .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1246        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1248        .dwattr $C$DW$59, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1249        .dwattr $C$DW$59, DW_AT_decl_line(0x5c)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   24

    1250        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1251
    1252$C$DW$60        .dwtag  DW_TAG_member
    1253        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1254        .dwattr $C$DW$60, DW_AT_name("PRU1_GPO_MODE")
    1255        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1256        .dwattr $C$DW$60, DW_AT_bit_offset(0x11)
    1257        .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1258        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1260        .dwattr $C$DW$60, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1261        .dwattr $C$DW$60, DW_AT_decl_line(0x5d)
    1262        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1263
    1264$C$DW$61        .dwtag  DW_TAG_member
    1265        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1266        .dwattr $C$DW$61, DW_AT_name("PRU1_GPO_DIV0")
    1267        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1268        .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
    1269        .dwattr $C$DW$61, DW_AT_bit_size(0x05)
    1270        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1272        .dwattr $C$DW$61, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1273        .dwattr $C$DW$61, DW_AT_decl_line(0x5e)
    1274        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1275
    1276$C$DW$62        .dwtag  DW_TAG_member
    1277        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1278        .dwattr $C$DW$62, DW_AT_name("PRU1_GPO_DIV1")
    1279        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1280        .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
    1281        .dwattr $C$DW$62, DW_AT_bit_size(0x05)
    1282        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1284        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1285        .dwattr $C$DW$62, DW_AT_decl_line(0x5f)
    1286        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1287
    1288$C$DW$63        .dwtag  DW_TAG_member
    1289        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1290        .dwattr $C$DW$63, DW_AT_name("PRU1_GPO_SH_SEL")
    1291        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1292        .dwattr $C$DW$63, DW_AT_bit_offset(0x06)
    1293        .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1294        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1296        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1297        .dwattr $C$DW$63, DW_AT_decl_line(0x60)
    1298        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1299
    1300$C$DW$64        .dwtag  DW_TAG_member
    1301        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1302        .dwattr $C$DW$64, DW_AT_name("rsvd26")
    1303        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd26")
    1304        .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   25

    1305        .dwattr $C$DW$64, DW_AT_bit_size(0x06)
    1306        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1308        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1309        .dwattr $C$DW$64, DW_AT_decl_line(0x61)
    1310        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1311
    1312        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1313        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1314        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1315        .dwendtag $C$DW$T$22
    1316
    1317$C$DW$T$46      .dwtag  DW_TAG_volatile_type
    1318        .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$22)
    1319
    1320
    1321$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1322        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1323$C$DW$65        .dwtag  DW_TAG_member
    1324        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1325        .dwattr $C$DW$65, DW_AT_name("PRU0_CLK_STOP_REQ")
    1326        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1327        .dwattr $C$DW$65, DW_AT_bit_offset(0x1f)
    1328        .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1329        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1331        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1332        .dwattr $C$DW$65, DW_AT_decl_line(0x6b)
    1333        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1334
    1335$C$DW$66        .dwtag  DW_TAG_member
    1336        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1337        .dwattr $C$DW$66, DW_AT_name("PRU0_CLK_STOP_ACK")
    1338        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1339        .dwattr $C$DW$66, DW_AT_bit_offset(0x1e)
    1340        .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1341        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1343        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1344        .dwattr $C$DW$66, DW_AT_decl_line(0x6c)
    1345        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1346
    1347$C$DW$67        .dwtag  DW_TAG_member
    1348        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1349        .dwattr $C$DW$67, DW_AT_name("PRU0_CLK_EN")
    1350        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1351        .dwattr $C$DW$67, DW_AT_bit_offset(0x1d)
    1352        .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1353        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1355        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1356        .dwattr $C$DW$67, DW_AT_decl_line(0x6d)
    1357        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1358
    1359$C$DW$68        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   26

    1360        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1361        .dwattr $C$DW$68, DW_AT_name("PRU1_CLK_STOP_REQ")
    1362        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1363        .dwattr $C$DW$68, DW_AT_bit_offset(0x1c)
    1364        .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1365        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1367        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1368        .dwattr $C$DW$68, DW_AT_decl_line(0x6e)
    1369        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1370
    1371$C$DW$69        .dwtag  DW_TAG_member
    1372        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1373        .dwattr $C$DW$69, DW_AT_name("PRU1_CLK_STOP_ACK")
    1374        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1375        .dwattr $C$DW$69, DW_AT_bit_offset(0x1b)
    1376        .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1377        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1379        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1380        .dwattr $C$DW$69, DW_AT_decl_line(0x6f)
    1381        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1382
    1383$C$DW$70        .dwtag  DW_TAG_member
    1384        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1385        .dwattr $C$DW$70, DW_AT_name("PRU1_CLK_EN")
    1386        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1387        .dwattr $C$DW$70, DW_AT_bit_offset(0x1a)
    1388        .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1389        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1391        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1392        .dwattr $C$DW$70, DW_AT_decl_line(0x70)
    1393        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1394
    1395$C$DW$71        .dwtag  DW_TAG_member
    1396        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1397        .dwattr $C$DW$71, DW_AT_name("INTC_CLK_STOP_REQ")
    1398        .dwattr $C$DW$71, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1399        .dwattr $C$DW$71, DW_AT_bit_offset(0x19)
    1400        .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1401        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1403        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1404        .dwattr $C$DW$71, DW_AT_decl_line(0x71)
    1405        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1406
    1407$C$DW$72        .dwtag  DW_TAG_member
    1408        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1409        .dwattr $C$DW$72, DW_AT_name("INTC_CLK_STOP_ACK")
    1410        .dwattr $C$DW$72, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1411        .dwattr $C$DW$72, DW_AT_bit_offset(0x18)
    1412        .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1413        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   27

    1415        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1416        .dwattr $C$DW$72, DW_AT_decl_line(0x72)
    1417        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1418
    1419$C$DW$73        .dwtag  DW_TAG_member
    1420        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1421        .dwattr $C$DW$73, DW_AT_name("INTC_CLK_EN")
    1422        .dwattr $C$DW$73, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1423        .dwattr $C$DW$73, DW_AT_bit_offset(0x17)
    1424        .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1425        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1427        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1428        .dwattr $C$DW$73, DW_AT_decl_line(0x73)
    1429        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1430
    1431$C$DW$74        .dwtag  DW_TAG_member
    1432        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1433        .dwattr $C$DW$74, DW_AT_name("UART_CLK_STOP_REQ")
    1434        .dwattr $C$DW$74, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1435        .dwattr $C$DW$74, DW_AT_bit_offset(0x16)
    1436        .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1437        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1439        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1440        .dwattr $C$DW$74, DW_AT_decl_line(0x74)
    1441        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1442
    1443$C$DW$75        .dwtag  DW_TAG_member
    1444        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1445        .dwattr $C$DW$75, DW_AT_name("UART_CLK_STOP_ACK")
    1446        .dwattr $C$DW$75, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1447        .dwattr $C$DW$75, DW_AT_bit_offset(0x15)
    1448        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1449        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1451        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1452        .dwattr $C$DW$75, DW_AT_decl_line(0x75)
    1453        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1454
    1455$C$DW$76        .dwtag  DW_TAG_member
    1456        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1457        .dwattr $C$DW$76, DW_AT_name("UART_CLK_EN")
    1458        .dwattr $C$DW$76, DW_AT_TI_symbol_name("UART_CLK_EN")
    1459        .dwattr $C$DW$76, DW_AT_bit_offset(0x14)
    1460        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1461        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1463        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1464        .dwattr $C$DW$76, DW_AT_decl_line(0x76)
    1465        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1466
    1467$C$DW$77        .dwtag  DW_TAG_member
    1468        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1469        .dwattr $C$DW$77, DW_AT_name("ECAP_CLK_STOP_REQ")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   28

    1470        .dwattr $C$DW$77, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1471        .dwattr $C$DW$77, DW_AT_bit_offset(0x13)
    1472        .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1473        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1475        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1476        .dwattr $C$DW$77, DW_AT_decl_line(0x77)
    1477        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1478
    1479$C$DW$78        .dwtag  DW_TAG_member
    1480        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1481        .dwattr $C$DW$78, DW_AT_name("ECAP_CLK_STOP_ACK")
    1482        .dwattr $C$DW$78, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1483        .dwattr $C$DW$78, DW_AT_bit_offset(0x12)
    1484        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1485        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1487        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1488        .dwattr $C$DW$78, DW_AT_decl_line(0x78)
    1489        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1490
    1491$C$DW$79        .dwtag  DW_TAG_member
    1492        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1493        .dwattr $C$DW$79, DW_AT_name("ECAP_CLK_EN")
    1494        .dwattr $C$DW$79, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1495        .dwattr $C$DW$79, DW_AT_bit_offset(0x11)
    1496        .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1497        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1499        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1500        .dwattr $C$DW$79, DW_AT_decl_line(0x79)
    1501        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1502
    1503$C$DW$80        .dwtag  DW_TAG_member
    1504        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1505        .dwattr $C$DW$80, DW_AT_name("IEP_CLK_STOP_REQ")
    1506        .dwattr $C$DW$80, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1507        .dwattr $C$DW$80, DW_AT_bit_offset(0x10)
    1508        .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1509        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1511        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1512        .dwattr $C$DW$80, DW_AT_decl_line(0x7a)
    1513        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1514
    1515$C$DW$81        .dwtag  DW_TAG_member
    1516        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1517        .dwattr $C$DW$81, DW_AT_name("IEP_CLK_STOP_ACK")
    1518        .dwattr $C$DW$81, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1519        .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
    1520        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1521        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1523        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1524        .dwattr $C$DW$81, DW_AT_decl_line(0x7b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   29

    1525        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1526
    1527$C$DW$82        .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$82, DW_AT_name("IEP_CLK_EN")
    1530        .dwattr $C$DW$82, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1531        .dwattr $C$DW$82, DW_AT_bit_offset(0x0e)
    1532        .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1533        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1535        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1536        .dwattr $C$DW$82, DW_AT_decl_line(0x7c)
    1537        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1538
    1539$C$DW$83        .dwtag  DW_TAG_member
    1540        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1541        .dwattr $C$DW$83, DW_AT_name("rsvd18")
    1542        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd18")
    1543        .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1544        .dwattr $C$DW$83, DW_AT_bit_size(0x0e)
    1545        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1547        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1548        .dwattr $C$DW$83, DW_AT_decl_line(0x7d)
    1549        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1550
    1551        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1552        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1553        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1554        .dwendtag $C$DW$T$23
    1555
    1556$C$DW$T$48      .dwtag  DW_TAG_volatile_type
    1557        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$23)
    1558
    1559
    1560$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1561        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1562$C$DW$84        .dwtag  DW_TAG_member
    1563        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1564        .dwattr $C$DW$84, DW_AT_name("PRU0_IMEM_PE_RAW")
    1565        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1566        .dwattr $C$DW$84, DW_AT_bit_offset(0x1c)
    1567        .dwattr $C$DW$84, DW_AT_bit_size(0x04)
    1568        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1570        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1571        .dwattr $C$DW$84, DW_AT_decl_line(0x87)
    1572        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1573
    1574$C$DW$85        .dwtag  DW_TAG_member
    1575        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1576        .dwattr $C$DW$85, DW_AT_name("PRU0_DMEM_PE_RAW")
    1577        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1578        .dwattr $C$DW$85, DW_AT_bit_offset(0x18)
    1579        .dwattr $C$DW$85, DW_AT_bit_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   30

    1580        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1582        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1583        .dwattr $C$DW$85, DW_AT_decl_line(0x88)
    1584        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1585
    1586$C$DW$86        .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1588        .dwattr $C$DW$86, DW_AT_name("PRU1_IMEM_PE_RAW")
    1589        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1590        .dwattr $C$DW$86, DW_AT_bit_offset(0x14)
    1591        .dwattr $C$DW$86, DW_AT_bit_size(0x04)
    1592        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1594        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1595        .dwattr $C$DW$86, DW_AT_decl_line(0x89)
    1596        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1597
    1598$C$DW$87        .dwtag  DW_TAG_member
    1599        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1600        .dwattr $C$DW$87, DW_AT_name("PRU1_DMEM_PE_RAW")
    1601        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1602        .dwattr $C$DW$87, DW_AT_bit_offset(0x10)
    1603        .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1604        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1606        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1607        .dwattr $C$DW$87, DW_AT_decl_line(0x8a)
    1608        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1609
    1610$C$DW$88        .dwtag  DW_TAG_member
    1611        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1612        .dwattr $C$DW$88, DW_AT_name("RAM_PE_RAW")
    1613        .dwattr $C$DW$88, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1614        .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1615        .dwattr $C$DW$88, DW_AT_bit_size(0x04)
    1616        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1618        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1619        .dwattr $C$DW$88, DW_AT_decl_line(0x8b)
    1620        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1621
    1622$C$DW$89        .dwtag  DW_TAG_member
    1623        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1624        .dwattr $C$DW$89, DW_AT_name("rsvd20")
    1625        .dwattr $C$DW$89, DW_AT_TI_symbol_name("rsvd20")
    1626        .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1627        .dwattr $C$DW$89, DW_AT_bit_size(0x0c)
    1628        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1630        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1631        .dwattr $C$DW$89, DW_AT_decl_line(0x8c)
    1632        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1633
    1634        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   31

    1635        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1636        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1637        .dwendtag $C$DW$T$24
    1638
    1639$C$DW$T$50      .dwtag  DW_TAG_volatile_type
    1640        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$24)
    1641
    1642
    1643$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1644        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1645$C$DW$90        .dwtag  DW_TAG_member
    1646        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1647        .dwattr $C$DW$90, DW_AT_name("PRU0_IMEM_PE")
    1648        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1649        .dwattr $C$DW$90, DW_AT_bit_offset(0x1c)
    1650        .dwattr $C$DW$90, DW_AT_bit_size(0x04)
    1651        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1654        .dwattr $C$DW$90, DW_AT_decl_line(0x96)
    1655        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1656
    1657$C$DW$91        .dwtag  DW_TAG_member
    1658        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1659        .dwattr $C$DW$91, DW_AT_name("PRU0_DMEM_PE")
    1660        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1661        .dwattr $C$DW$91, DW_AT_bit_offset(0x18)
    1662        .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1663        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1665        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1666        .dwattr $C$DW$91, DW_AT_decl_line(0x97)
    1667        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1668
    1669$C$DW$92        .dwtag  DW_TAG_member
    1670        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1671        .dwattr $C$DW$92, DW_AT_name("PRU1_IMEM_PE")
    1672        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1673        .dwattr $C$DW$92, DW_AT_bit_offset(0x14)
    1674        .dwattr $C$DW$92, DW_AT_bit_size(0x04)
    1675        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1677        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1678        .dwattr $C$DW$92, DW_AT_decl_line(0x98)
    1679        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1680
    1681$C$DW$93        .dwtag  DW_TAG_member
    1682        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1683        .dwattr $C$DW$93, DW_AT_name("PRU1_DMEM_PE")
    1684        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1685        .dwattr $C$DW$93, DW_AT_bit_offset(0x10)
    1686        .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1687        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1689        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   32

    1690        .dwattr $C$DW$93, DW_AT_decl_line(0x99)
    1691        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1692
    1693$C$DW$94        .dwtag  DW_TAG_member
    1694        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1695        .dwattr $C$DW$94, DW_AT_name("RAM_PE")
    1696        .dwattr $C$DW$94, DW_AT_TI_symbol_name("RAM_PE")
    1697        .dwattr $C$DW$94, DW_AT_bit_offset(0x0c)
    1698        .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1699        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1701        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1702        .dwattr $C$DW$94, DW_AT_decl_line(0x9a)
    1703        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1704
    1705$C$DW$95        .dwtag  DW_TAG_member
    1706        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1707        .dwattr $C$DW$95, DW_AT_name("rsvd20")
    1708        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd20")
    1709        .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1710        .dwattr $C$DW$95, DW_AT_bit_size(0x0c)
    1711        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1714        .dwattr $C$DW$95, DW_AT_decl_line(0x9b)
    1715        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1716
    1717        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1718        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1719        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1720        .dwendtag $C$DW$T$25
    1721
    1722$C$DW$T$52      .dwtag  DW_TAG_volatile_type
    1723        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$25)
    1724
    1725
    1726$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1727        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1728$C$DW$96        .dwtag  DW_TAG_member
    1729        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1730        .dwattr $C$DW$96, DW_AT_name("PRU0_IMEM_PE_SET")
    1731        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1732        .dwattr $C$DW$96, DW_AT_bit_offset(0x1c)
    1733        .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1734        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1736        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1737        .dwattr $C$DW$96, DW_AT_decl_line(0xa4)
    1738        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1739
    1740$C$DW$97        .dwtag  DW_TAG_member
    1741        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1742        .dwattr $C$DW$97, DW_AT_name("PRU0_DMEM_PE_SET")
    1743        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1744        .dwattr $C$DW$97, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   33

    1745        .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1746        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1748        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1749        .dwattr $C$DW$97, DW_AT_decl_line(0xa5)
    1750        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1751
    1752$C$DW$98        .dwtag  DW_TAG_member
    1753        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1754        .dwattr $C$DW$98, DW_AT_name("PRU1_IMEM_PE_SET")
    1755        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1756        .dwattr $C$DW$98, DW_AT_bit_offset(0x14)
    1757        .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1758        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1760        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1761        .dwattr $C$DW$98, DW_AT_decl_line(0xa6)
    1762        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1763
    1764$C$DW$99        .dwtag  DW_TAG_member
    1765        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1766        .dwattr $C$DW$99, DW_AT_name("PRU1_DMEM_PE_SET")
    1767        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1768        .dwattr $C$DW$99, DW_AT_bit_offset(0x10)
    1769        .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1770        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1772        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1773        .dwattr $C$DW$99, DW_AT_decl_line(0xa7)
    1774        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1775
    1776$C$DW$100       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1778        .dwattr $C$DW$100, DW_AT_name("RAM_PE_SET")
    1779        .dwattr $C$DW$100, DW_AT_TI_symbol_name("RAM_PE_SET")
    1780        .dwattr $C$DW$100, DW_AT_bit_offset(0x0c)
    1781        .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1782        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1784        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1785        .dwattr $C$DW$100, DW_AT_decl_line(0xa8)
    1786        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1787
    1788$C$DW$101       .dwtag  DW_TAG_member
    1789        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1790        .dwattr $C$DW$101, DW_AT_name("rsvd20")
    1791        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd20")
    1792        .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1793        .dwattr $C$DW$101, DW_AT_bit_size(0x0c)
    1794        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1796        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1797        .dwattr $C$DW$101, DW_AT_decl_line(0xa9)
    1798        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1799
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   34

    1800        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1801        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1802        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1803        .dwendtag $C$DW$T$26
    1804
    1805$C$DW$T$54      .dwtag  DW_TAG_volatile_type
    1806        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$26)
    1807
    1808
    1809$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1810        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1811$C$DW$102       .dwtag  DW_TAG_member
    1812        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1813        .dwattr $C$DW$102, DW_AT_name("PRU0_IMEM_PE_CLR")
    1814        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1815        .dwattr $C$DW$102, DW_AT_bit_offset(0x1c)
    1816        .dwattr $C$DW$102, DW_AT_bit_size(0x04)
    1817        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1819        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1820        .dwattr $C$DW$102, DW_AT_decl_line(0xb3)
    1821        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1822
    1823$C$DW$103       .dwtag  DW_TAG_member
    1824        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1825        .dwattr $C$DW$103, DW_AT_name("PRU0_DMEM_PE_CLR")
    1826        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1827        .dwattr $C$DW$103, DW_AT_bit_offset(0x18)
    1828        .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1829        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1831        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1832        .dwattr $C$DW$103, DW_AT_decl_line(0xb4)
    1833        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1834
    1835$C$DW$104       .dwtag  DW_TAG_member
    1836        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1837        .dwattr $C$DW$104, DW_AT_name("PRU1_IMEM_PE_CLR")
    1838        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1839        .dwattr $C$DW$104, DW_AT_bit_offset(0x14)
    1840        .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1841        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1843        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1844        .dwattr $C$DW$104, DW_AT_decl_line(0xb5)
    1845        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1846
    1847$C$DW$105       .dwtag  DW_TAG_member
    1848        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1849        .dwattr $C$DW$105, DW_AT_name("PRU1_DMEM_PE_CLR")
    1850        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1851        .dwattr $C$DW$105, DW_AT_bit_offset(0x10)
    1852        .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1853        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   35

    1855        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1856        .dwattr $C$DW$105, DW_AT_decl_line(0xb6)
    1857        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1858
    1859$C$DW$106       .dwtag  DW_TAG_member
    1860        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1861        .dwattr $C$DW$106, DW_AT_name("rsvd16")
    1862        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd16")
    1863        .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    1864        .dwattr $C$DW$106, DW_AT_bit_size(0x10)
    1865        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1867        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1868        .dwattr $C$DW$106, DW_AT_decl_line(0xb7)
    1869        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1870
    1871        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1872        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1873        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1874        .dwendtag $C$DW$T$27
    1875
    1876$C$DW$T$56      .dwtag  DW_TAG_volatile_type
    1877        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$27)
    1878
    1879
    1880$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1881        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1882$C$DW$107       .dwtag  DW_TAG_member
    1883        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1884        .dwattr $C$DW$107, DW_AT_name("PMAO_PRU0")
    1885        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PMAO_PRU0")
    1886        .dwattr $C$DW$107, DW_AT_bit_offset(0x1f)
    1887        .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1888        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1890        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1891        .dwattr $C$DW$107, DW_AT_decl_line(0xc4)
    1892        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1893
    1894$C$DW$108       .dwtag  DW_TAG_member
    1895        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1896        .dwattr $C$DW$108, DW_AT_name("PMAO_PRU1")
    1897        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PMAO_PRU1")
    1898        .dwattr $C$DW$108, DW_AT_bit_offset(0x1e)
    1899        .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1900        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1902        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1903        .dwattr $C$DW$108, DW_AT_decl_line(0xc5)
    1904        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1905
    1906$C$DW$109       .dwtag  DW_TAG_member
    1907        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1908        .dwattr $C$DW$109, DW_AT_name("rsvd2")
    1909        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd2")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   36

    1910        .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    1911        .dwattr $C$DW$109, DW_AT_bit_size(0x1e)
    1912        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1914        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1915        .dwattr $C$DW$109, DW_AT_decl_line(0xc6)
    1916        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1917
    1918        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1919        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1920        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1921        .dwendtag $C$DW$T$28
    1922
    1923$C$DW$T$58      .dwtag  DW_TAG_volatile_type
    1924        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$28)
    1925
    1926
    1927$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1928        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1929$C$DW$110       .dwtag  DW_TAG_member
    1930        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1931        .dwattr $C$DW$110, DW_AT_name("OCP_EN")
    1932        .dwattr $C$DW$110, DW_AT_TI_symbol_name("OCP_EN")
    1933        .dwattr $C$DW$110, DW_AT_bit_offset(0x1f)
    1934        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1935        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1937        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1938        .dwattr $C$DW$110, DW_AT_decl_line(0xd3)
    1939        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1940
    1941$C$DW$111       .dwtag  DW_TAG_member
    1942        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1943        .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1944        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd1")
    1945        .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1946        .dwattr $C$DW$111, DW_AT_bit_size(0x1f)
    1947        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1949        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1950        .dwattr $C$DW$111, DW_AT_decl_line(0xd4)
    1951        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1952
    1953        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1954        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1955        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1956        .dwendtag $C$DW$T$29
    1957
    1958$C$DW$T$60      .dwtag  DW_TAG_volatile_type
    1959        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$29)
    1960
    1961
    1962$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1963        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1964$C$DW$112       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   37

    1965        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1966        .dwattr $C$DW$112, DW_AT_name("PRU1_PAD_HP_EN")
    1967        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1968        .dwattr $C$DW$112, DW_AT_bit_offset(0x1f)
    1969        .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1970        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1972        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1973        .dwattr $C$DW$112, DW_AT_decl_line(0xde)
    1974        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1975
    1976$C$DW$113       .dwtag  DW_TAG_member
    1977        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1978        .dwattr $C$DW$113, DW_AT_name("XFR_SHIFT_EN")
    1979        .dwattr $C$DW$113, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1980        .dwattr $C$DW$113, DW_AT_bit_offset(0x1e)
    1981        .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1982        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1984        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1985        .dwattr $C$DW$113, DW_AT_decl_line(0xdf)
    1986        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1987
    1988$C$DW$114       .dwtag  DW_TAG_member
    1989        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1990        .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1991        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd2")
    1992        .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1993        .dwattr $C$DW$114, DW_AT_bit_size(0x1e)
    1994        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1996        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1997        .dwattr $C$DW$114, DW_AT_decl_line(0xe0)
    1998        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1999
    2000        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2001        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2002        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2003        .dwendtag $C$DW$T$30
    2004
    2005$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    2006        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$30)
    2007
    2008
    2009$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2010        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2011$C$DW$115       .dwtag  DW_TAG_member
    2012        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    2013        .dwattr $C$DW$115, DW_AT_name("PIN_MUX_SEL")
    2014        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2015        .dwattr $C$DW$115, DW_AT_bit_offset(0x18)
    2016        .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    2017        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2019        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   38

    2020        .dwattr $C$DW$115, DW_AT_decl_line(0xec)
    2021        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    2022
    2023$C$DW$116       .dwtag  DW_TAG_member
    2024        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    2025        .dwattr $C$DW$116, DW_AT_name("rsvd2")
    2026        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd2")
    2027        .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2028        .dwattr $C$DW$116, DW_AT_bit_size(0x18)
    2029        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2031        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2032        .dwattr $C$DW$116, DW_AT_decl_line(0xed)
    2033        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2034
    2035        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2036        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2037        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2038        .dwendtag $C$DW$T$31
    2039
    2040$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    2041        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)
    2042
    2043
    2044$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2045        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2046$C$DW$117       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$41)
    2048        .dwattr $C$DW$117, DW_AT_name("$P$T0")
    2049        .dwattr $C$DW$117, DW_AT_TI_symbol_name("$P$T0")
    2050        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2052        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2053        .dwattr $C$DW$117, DW_AT_decl_line(0x29)
    2054        .dwattr $C$DW$117, DW_AT_decl_column(0x02)
    2055
    2056$C$DW$118       .dwtag  DW_TAG_member
    2057        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$43)
    2058        .dwattr $C$DW$118, DW_AT_name("$P$T1")
    2059        .dwattr $C$DW$118, DW_AT_TI_symbol_name("$P$T1")
    2060        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2061        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2062        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2063        .dwattr $C$DW$118, DW_AT_decl_line(0x33)
    2064        .dwattr $C$DW$118, DW_AT_decl_column(0x02)
    2065
    2066$C$DW$119       .dwtag  DW_TAG_member
    2067        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$45)
    2068        .dwattr $C$DW$119, DW_AT_name("$P$T2")
    2069        .dwattr $C$DW$119, DW_AT_TI_symbol_name("$P$T2")
    2070        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2071        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2072        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2073        .dwattr $C$DW$119, DW_AT_decl_line(0x41)
    2074        .dwattr $C$DW$119, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   39

    2075
    2076$C$DW$120       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$47)
    2078        .dwattr $C$DW$120, DW_AT_name("$P$T3")
    2079        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T3")
    2080        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2081        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2083        .dwattr $C$DW$120, DW_AT_decl_line(0x54)
    2084        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    2085
    2086$C$DW$121       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$49)
    2088        .dwattr $C$DW$121, DW_AT_name("$P$T4")
    2089        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T4")
    2090        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2091        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2092        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2093        .dwattr $C$DW$121, DW_AT_decl_line(0x67)
    2094        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    2095
    2096$C$DW$122       .dwtag  DW_TAG_member
    2097        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$51)
    2098        .dwattr $C$DW$122, DW_AT_name("$P$T5")
    2099        .dwattr $C$DW$122, DW_AT_TI_symbol_name("$P$T5")
    2100        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2101        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2102        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2103        .dwattr $C$DW$122, DW_AT_decl_line(0x83)
    2104        .dwattr $C$DW$122, DW_AT_decl_column(0x02)
    2105
    2106$C$DW$123       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$53)
    2108        .dwattr $C$DW$123, DW_AT_name("$P$T6")
    2109        .dwattr $C$DW$123, DW_AT_TI_symbol_name("$P$T6")
    2110        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2111        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2112        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2113        .dwattr $C$DW$123, DW_AT_decl_line(0x92)
    2114        .dwattr $C$DW$123, DW_AT_decl_column(0x02)
    2115
    2116$C$DW$124       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$55)
    2118        .dwattr $C$DW$124, DW_AT_name("$P$T7")
    2119        .dwattr $C$DW$124, DW_AT_TI_symbol_name("$P$T7")
    2120        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2121        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2122        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2123        .dwattr $C$DW$124, DW_AT_decl_line(0xa0)
    2124        .dwattr $C$DW$124, DW_AT_decl_column(0x02)
    2125
    2126$C$DW$125       .dwtag  DW_TAG_member
    2127        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$57)
    2128        .dwattr $C$DW$125, DW_AT_name("$P$T8")
    2129        .dwattr $C$DW$125, DW_AT_TI_symbol_name("$P$T8")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   40

    2130        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2131        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2132        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2133        .dwattr $C$DW$125, DW_AT_decl_line(0xaf)
    2134        .dwattr $C$DW$125, DW_AT_decl_column(0x02)
    2135
    2136$C$DW$126       .dwtag  DW_TAG_member
    2137        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
    2138        .dwattr $C$DW$126, DW_AT_name("rsvd24")
    2139        .dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd24")
    2140        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2141        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2142        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2143        .dwattr $C$DW$126, DW_AT_decl_line(0xbc)
    2144        .dwattr $C$DW$126, DW_AT_decl_column(0x0b)
    2145
    2146$C$DW$127       .dwtag  DW_TAG_member
    2147        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$59)
    2148        .dwattr $C$DW$127, DW_AT_name("$P$T9")
    2149        .dwattr $C$DW$127, DW_AT_TI_symbol_name("$P$T9")
    2150        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2151        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2152        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2153        .dwattr $C$DW$127, DW_AT_decl_line(0xc0)
    2154        .dwattr $C$DW$127, DW_AT_decl_column(0x02)
    2155
    2156$C$DW$128       .dwtag  DW_TAG_member
    2157        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$33)
    2158        .dwattr $C$DW$128, DW_AT_name("rsvd2c")
    2159        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd2c")
    2160        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2161        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2162        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2163        .dwattr $C$DW$128, DW_AT_decl_line(0xcb)
    2164        .dwattr $C$DW$128, DW_AT_decl_column(0x0b)
    2165
    2166$C$DW$129       .dwtag  DW_TAG_member
    2167        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$61)
    2168        .dwattr $C$DW$129, DW_AT_name("$P$T10")
    2169        .dwattr $C$DW$129, DW_AT_TI_symbol_name("$P$T10")
    2170        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2171        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2172        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2173        .dwattr $C$DW$129, DW_AT_decl_line(0xcf)
    2174        .dwattr $C$DW$129, DW_AT_decl_column(0x02)
    2175
    2176$C$DW$130       .dwtag  DW_TAG_member
    2177        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$63)
    2178        .dwattr $C$DW$130, DW_AT_name("$P$T11")
    2179        .dwattr $C$DW$130, DW_AT_TI_symbol_name("$P$T11")
    2180        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2181        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2182        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2183        .dwattr $C$DW$130, DW_AT_decl_line(0xda)
    2184        .dwattr $C$DW$130, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   41

    2185
    2186$C$DW$131       .dwtag  DW_TAG_member
    2187        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$34)
    2188        .dwattr $C$DW$131, DW_AT_name("rsvd38")
    2189        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd38")
    2190        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2191        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2192        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2193        .dwattr $C$DW$131, DW_AT_decl_line(0xe5)
    2194        .dwattr $C$DW$131, DW_AT_decl_column(0x0b)
    2195
    2196$C$DW$132       .dwtag  DW_TAG_member
    2197        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$65)
    2198        .dwattr $C$DW$132, DW_AT_name("$P$T12")
    2199        .dwattr $C$DW$132, DW_AT_TI_symbol_name("$P$T12")
    2200        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2201        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2202        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2203        .dwattr $C$DW$132, DW_AT_decl_line(0xe8)
    2204        .dwattr $C$DW$132, DW_AT_decl_column(0x02)
    2205
    2206        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2207        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2208        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2209        .dwendtag $C$DW$T$35
    2210
    2211$C$DW$T$69      .dwtag  DW_TAG_typedef
    2212        .dwattr $C$DW$T$69, DW_AT_name("pruCfg")
    2213        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$35)
    2214        .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2215        .dwattr $C$DW$T$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2216        .dwattr $C$DW$T$69, DW_AT_decl_line(0xf0)
    2217        .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    2218
    2219$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    2220        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2221
    2222
    2223$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2224        .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    2225$C$DW$133       .dwtag  DW_TAG_member
    2226        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    2227        .dwattr $C$DW$133, DW_AT_name("cur_reg_val")
    2228        .dwattr $C$DW$133, DW_AT_TI_symbol_name("cur_reg_val")
    2229        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2231        .dwattr $C$DW$133, DW_AT_decl_file("pru1_buslatches.h")
    2232        .dwattr $C$DW$133, DW_AT_decl_line(0x22)
    2233        .dwattr $C$DW$133, DW_AT_decl_column(0x0a)
    2234
    2235$C$DW$134       .dwtag  DW_TAG_member
    2236        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$37)
    2237        .dwattr $C$DW$134, DW_AT_name("bidi_bitwidth")
    2238        .dwattr $C$DW$134, DW_AT_TI_symbol_name("bidi_bitwidth")
    2239        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   42

    2240        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2241        .dwattr $C$DW$134, DW_AT_decl_file("pru1_buslatches.h")
    2242        .dwattr $C$DW$134, DW_AT_decl_line(0x26)
    2243        .dwattr $C$DW$134, DW_AT_decl_column(0x0a)
    2244
    2245        .dwattr $C$DW$T$38, DW_AT_decl_file("pru1_buslatches.h")
    2246        .dwattr $C$DW$T$38, DW_AT_decl_line(0x21)
    2247        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2248        .dwendtag $C$DW$T$38
    2249
    2250$C$DW$T$72      .dwtag  DW_TAG_typedef
    2251        .dwattr $C$DW$T$72, DW_AT_name("buslatches_t")
    2252        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    2253        .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2254        .dwattr $C$DW$T$72, DW_AT_decl_file("pru1_buslatches.h")
    2255        .dwattr $C$DW$T$72, DW_AT_decl_line(0x2c)
    2256        .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2257
    2258
    2259$C$DW$T$41      .dwtag  DW_TAG_union_type
    2260        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2261$C$DW$135       .dwtag  DW_TAG_member
    2262        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$39)
    2263        .dwattr $C$DW$135, DW_AT_name("REVID")
    2264        .dwattr $C$DW$135, DW_AT_TI_symbol_name("REVID")
    2265        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2267        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2268        .dwattr $C$DW$135, DW_AT_decl_line(0x2a)
    2269        .dwattr $C$DW$135, DW_AT_decl_column(0x15)
    2270
    2271$C$DW$136       .dwtag  DW_TAG_member
    2272        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$40)
    2273        .dwattr $C$DW$136, DW_AT_name("REVID_bit")
    2274        .dwattr $C$DW$136, DW_AT_TI_symbol_name("REVID_bit")
    2275        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2277        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2278        .dwattr $C$DW$136, DW_AT_decl_line(0x2e)
    2279        .dwattr $C$DW$136, DW_AT_decl_column(0x05)
    2280
    2281        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2282        .dwattr $C$DW$T$41, DW_AT_decl_line(0x29)
    2283        .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
    2284        .dwendtag $C$DW$T$41
    2285
    2286
    2287$C$DW$T$43      .dwtag  DW_TAG_union_type
    2288        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    2289$C$DW$137       .dwtag  DW_TAG_member
    2290        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$39)
    2291        .dwattr $C$DW$137, DW_AT_name("SYSCFG")
    2292        .dwattr $C$DW$137, DW_AT_TI_symbol_name("SYSCFG")
    2293        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   43

    2295        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2296        .dwattr $C$DW$137, DW_AT_decl_line(0x34)
    2297        .dwattr $C$DW$137, DW_AT_decl_column(0x15)
    2298
    2299$C$DW$138       .dwtag  DW_TAG_member
    2300        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$42)
    2301        .dwattr $C$DW$138, DW_AT_name("SYSCFG_bit")
    2302        .dwattr $C$DW$138, DW_AT_TI_symbol_name("SYSCFG_bit")
    2303        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2306        .dwattr $C$DW$138, DW_AT_decl_line(0x3c)
    2307        .dwattr $C$DW$138, DW_AT_decl_column(0x05)
    2308
    2309        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2310        .dwattr $C$DW$T$43, DW_AT_decl_line(0x33)
    2311        .dwattr $C$DW$T$43, DW_AT_decl_column(0x08)
    2312        .dwendtag $C$DW$T$43
    2313
    2314
    2315$C$DW$T$45      .dwtag  DW_TAG_union_type
    2316        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    2317$C$DW$139       .dwtag  DW_TAG_member
    2318        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    2319        .dwattr $C$DW$139, DW_AT_name("GPCFG0")
    2320        .dwattr $C$DW$139, DW_AT_TI_symbol_name("GPCFG0")
    2321        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2323        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2324        .dwattr $C$DW$139, DW_AT_decl_line(0x42)
    2325        .dwattr $C$DW$139, DW_AT_decl_column(0x15)
    2326
    2327$C$DW$140       .dwtag  DW_TAG_member
    2328        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$44)
    2329        .dwattr $C$DW$140, DW_AT_name("GPCFG0_bit")
    2330        .dwattr $C$DW$140, DW_AT_TI_symbol_name("GPCFG0_bit")
    2331        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2333        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2334        .dwattr $C$DW$140, DW_AT_decl_line(0x4f)
    2335        .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2336
    2337        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2338        .dwattr $C$DW$T$45, DW_AT_decl_line(0x41)
    2339        .dwattr $C$DW$T$45, DW_AT_decl_column(0x08)
    2340        .dwendtag $C$DW$T$45
    2341
    2342
    2343$C$DW$T$47      .dwtag  DW_TAG_union_type
    2344        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2345$C$DW$141       .dwtag  DW_TAG_member
    2346        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$39)
    2347        .dwattr $C$DW$141, DW_AT_name("GPCFG1")
    2348        .dwattr $C$DW$141, DW_AT_TI_symbol_name("GPCFG1")
    2349        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   44

    2350        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2351        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2352        .dwattr $C$DW$141, DW_AT_decl_line(0x55)
    2353        .dwattr $C$DW$141, DW_AT_decl_column(0x15)
    2354
    2355$C$DW$142       .dwtag  DW_TAG_member
    2356        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$46)
    2357        .dwattr $C$DW$142, DW_AT_name("GPCFG1_bit")
    2358        .dwattr $C$DW$142, DW_AT_TI_symbol_name("GPCFG1_bit")
    2359        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2361        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2362        .dwattr $C$DW$142, DW_AT_decl_line(0x62)
    2363        .dwattr $C$DW$142, DW_AT_decl_column(0x05)
    2364
    2365        .dwattr $C$DW$T$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2366        .dwattr $C$DW$T$47, DW_AT_decl_line(0x54)
    2367        .dwattr $C$DW$T$47, DW_AT_decl_column(0x08)
    2368        .dwendtag $C$DW$T$47
    2369
    2370
    2371$C$DW$T$49      .dwtag  DW_TAG_union_type
    2372        .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    2373$C$DW$143       .dwtag  DW_TAG_member
    2374        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$39)
    2375        .dwattr $C$DW$143, DW_AT_name("CGR")
    2376        .dwattr $C$DW$143, DW_AT_TI_symbol_name("CGR")
    2377        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2378        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2379        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2380        .dwattr $C$DW$143, DW_AT_decl_line(0x68)
    2381        .dwattr $C$DW$143, DW_AT_decl_column(0x15)
    2382
    2383$C$DW$144       .dwtag  DW_TAG_member
    2384        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$48)
    2385        .dwattr $C$DW$144, DW_AT_name("CGR_bit")
    2386        .dwattr $C$DW$144, DW_AT_TI_symbol_name("CGR_bit")
    2387        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2389        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2390        .dwattr $C$DW$144, DW_AT_decl_line(0x7e)
    2391        .dwattr $C$DW$144, DW_AT_decl_column(0x05)
    2392
    2393        .dwattr $C$DW$T$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2394        .dwattr $C$DW$T$49, DW_AT_decl_line(0x67)
    2395        .dwattr $C$DW$T$49, DW_AT_decl_column(0x08)
    2396        .dwendtag $C$DW$T$49
    2397
    2398
    2399$C$DW$T$51      .dwtag  DW_TAG_union_type
    2400        .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    2401$C$DW$145       .dwtag  DW_TAG_member
    2402        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$39)
    2403        .dwattr $C$DW$145, DW_AT_name("ISRP")
    2404        .dwattr $C$DW$145, DW_AT_TI_symbol_name("ISRP")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:30 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_buslatches.asm                                                  PAGE   45

    2405        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2407        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2408        .dwattr $C$DW$145, DW_AT_decl_line(0x84)
    2409        .dwattr $C$DW$145, DW_AT_decl_column(0x15)
    2410
    2411$C$DW$146       .dwtag  DW_TAG_member
    2412        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$50)
    2413        .dwattr $C$DW$146, DW_AT_name("ISRP_bit")
    2414        .dwattr $C$DW$146, DW_AT_TI_symbol_name("ISRP_bit")
    2415        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2416        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2417        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2418        .dwattr $C$DW$146, DW_AT_decl_line(0x8d)
    2419        .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    2420
    2421        .dwattr $C$DW$T$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2422        .dwattr $C$DW$T$51, DW_AT_decl_line(0x83)
    2423        .dwattr $C$DW$T$51, DW_AT_decl_column(0x08)
    2424        .dwendtag $C$DW$T$51
    2425
    2426
    2427$C$DW$T$53      .dwtag  DW_TAG_union_type
    2428        .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    2429$C$DW$147       .dwtag  DW_TAG_member
    2430        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
    2431        .dwattr $C$DW$147, DW_AT_name("ISP")
    2432        .dwattr $C$DW$147, DW_AT_TI_symbol_name("ISP")
    2433        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
