PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:35 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_dma.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13$C$DW$1 .dwtag  DW_TAG_variable
      14        .dwattr $C$DW$1, DW_AT_name("mailbox")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("mailbox")
      16        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$132)
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external

    2576        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$138)
    2577        .dwattr $C$DW$126, DW_AT_location[DW_OP_reg4]
    2578
    2579        .dwcfi  cfa_offset, 0
    2580;*** 88 -----------------------    C$1 = &mailbox;
    2581;*** 88 -----------------------    (*C$1).$P$T1.dma.cur_addr = (*C$1).$P$T1.dma.startaddr;
    2582;*** 89 -----------------------    (*(C$2 = &sm_dma)).dataptr = (volatile unsigned short *)C$1+36;
    2583;*** 90 -----------------------    (*C$2).state = &sm_dma_state_1;
    2584;*** 91 -----------------------    (*C$2).cur_wordsleft = (*C$1).$P$T1.dma.wordcount;
    2585;*** 92 -----------------------    (*C$1).$P$T1.dma.cur_status = 2u;
    2586;***    -----------------------    return;
    2587        .dwpsn  file "pru1_statemachine_dma.c",line 88,column 2,is_stmt,isa 0
    2588;----------------------------------------------------------------------
    2589;  88 | mailbox.dma.cur_addr = mailbox.dma.startaddr;                          
    2590;----------------------------------------------------------------------
    2591 00000000 000080240000C0!         LDI32     r0, ||mailbox||       ; [ALU_PRU] |88| $O$C1,mailbox
         00000007 00000021004024 
    2592 00000008 000000F1202081          LBBO      &r1, r0, 32, 4        ; [ALU_PRU] |88| $O$C1
    2593 0000000c 000000E11C2081          SBBO      &r1, r0, 28, 4        ; [ALU_PRU] |88| $O$C1
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   49

    2594        .dwpsn  file "pru1_statemachine_dma.c",line 89,column 2,is_stmt,isa 0
    2595;----------------------------------------------------------------------
    2596;  89 | sm_dma.dataptr = (uint16_t *) mailbox.dma.words; // point to start of d
    2597;     | ata buffer                                                             
    2598;----------------------------------------------------------------------
    2599 00000010 000000240000E1!         LDI       r1, ||sm_dma||        ; [ALU_PRU] |89| $O$C2,sm_dma
    2600 00000014 0000000124E0EE          ADD       r14, r0, 0x24         ; [ALU_PRU] |89| $O$C1
    2601 00000018 000000E103218E          SBBO      &r14, r1, 3, 4        ; [ALU_PRU] |89| $O$C2
    2602        .dwpsn  file "pru1_statemachine_dma.c",line 90,column 2,is_stmt,isa 0
    2603;----------------------------------------------------------------------
    2604;  90 | sm_dma.state = &sm_dma_state_1;                                        
    2605;----------------------------------------------------------------------
    2606 0000001c 0000002400008E!         LDI       r14.w0, $CODE(||sm_dma_state_1||) ; [ALU_PRU] |90| sm_dma_state_1
    2607 00000020 000000E100018E          SBBO      &r14.w0, r1, 0, 2     ; [ALU_PRU] |90| $O$C2
    2608        .dwpsn  file "pru1_statemachine_dma.c",line 91,column 2,is_stmt,isa 0
    2609;----------------------------------------------------------------------
    2610;  91 | sm_dma.cur_wordsleft = mailbox.dma.wordcount;                          
    2611;----------------------------------------------------------------------
    2612 00000024 000000F11A008E          LBBO      &r14.w0, r0, 26, 2    ; [ALU_PRU] |91| $O$C1
    2613 00000028 000000E107018E          SBBO      &r14.w0, r1, 7, 2     ; [ALU_PRU] |91| $O$C2
    2614        .dwpsn  file "pru1_statemachine_dma.c",line 92,column 2,is_stmt,isa 0
    2615;----------------------------------------------------------------------
    2616;  92 | mailbox.dma.cur_status = DMA_STATE_RUNNING;                            
    2617;  93 | // next call to sm_dma.state() starts state machine                    
    2618;----------------------------------------------------------------------
    2619 0000002c 00000024000201          LDI       r1.b0, 0x02           ; [ALU_PRU] |92| 
    2620 00000030 000000E1180001          SBBO      &r1.b0, r0, 24, 1     ; [ALU_PRU] |92| $O$C1
    2621$C$DW$127       .dwtag  DW_TAG_TI_branch
    2622        .dwattr $C$DW$127, DW_AT_low_pc(0x00)
    2623        .dwattr $C$DW$127, DW_AT_TI_return
    2624
    2625 00000034 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    2626        .dwattr $C$DW$124, DW_AT_TI_end_file("pru1_statemachine_dma.c")
    2627        .dwattr $C$DW$124, DW_AT_TI_end_line(0x5e)
    2628        .dwattr $C$DW$124, DW_AT_TI_end_column(0x01)
    2629        .dwendentry
    2630        .dwendtag $C$DW$124
    2631
    2632;*****************************************************************************
    2633;* UNDEFINED EXTERNAL REFERENCES                                             *
    2634;*****************************************************************************
    2635        .global ||mailbox||
    2636        .global ||buslatches||
    2637        .global ||timeout_target||
    2638        .global ||sm_arb||
    2639        .global ||buslatches_pru0_dataout||
    2640        .global ||iopageregisters_write_w||
    2641        .global ||iopageregisters_write_b||
    2642        .global ||iopageregisters_read||
    2643        .global ||sm_arb_state_idle||
    2644
    2645;******************************************************************************
    2646;* TYPE INFORMATION                                                           *
    2647;******************************************************************************
    2648
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   50

    2649$C$DW$T$19      .dwtag  DW_TAG_structure_type
    2650        .dwattr $C$DW$T$19, DW_AT_byte_size(0x40000)
    2651$C$DW$128       .dwtag  DW_TAG_member
    2652        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$75)
    2653        .dwattr $C$DW$128, DW_AT_name("$P$T0")
    2654        .dwattr $C$DW$128, DW_AT_TI_symbol_name("$P$T0")
    2655        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2656        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2657        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/u
    2658        .dwattr $C$DW$128, DW_AT_decl_line(0x34)
    2659        .dwattr $C$DW$128, DW_AT_decl_column(0x02)
    2660
    2661        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2662        .dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
    2663        .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    2664        .dwendtag $C$DW$T$19
    2665
    2666$C$DW$T$20      .dwtag  DW_TAG_typedef
    2667        .dwattr $C$DW$T$20, DW_AT_name("unibus_memory_t")
    2668        .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    2669        .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2670        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2671        .dwattr $C$DW$T$20, DW_AT_decl_line(0x38)
    2672        .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
    2673
    2674
    2675$C$DW$T$21      .dwtag  DW_TAG_structure_type
    2676        .dwattr $C$DW$T$21, DW_AT_byte_size(0x40000)
    2677$C$DW$129       .dwtag  DW_TAG_member
    2678        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    2679        .dwattr $C$DW$129, DW_AT_name("memory")
    2680        .dwattr $C$DW$129, DW_AT_TI_symbol_name("memory")
    2681        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2682        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2683        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/d
    2684        .dwattr $C$DW$129, DW_AT_decl_line(0x17)
    2685        .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    2686
    2687        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2688        .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
    2689        .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2690        .dwendtag $C$DW$T$21
    2691
    2692$C$DW$T$32      .dwtag  DW_TAG_typedef
    2693        .dwattr $C$DW$T$32, DW_AT_name("ddrmem_t")
    2694        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
    2695        .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2696        .dwattr $C$DW$T$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2697        .dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
    2698        .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2699
    2700$C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2701        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2702
    2703$C$DW$T$34      .dwtag  DW_TAG_pointer_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   51

    2704        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2705        .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2706
    2707
    2708$C$DW$T$25      .dwtag  DW_TAG_structure_type
    2709        .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
    2710$C$DW$130       .dwtag  DW_TAG_member
    2711        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    2712        .dwattr $C$DW$130, DW_AT_name("eventmask")
    2713        .dwattr $C$DW$130, DW_AT_TI_symbol_name("eventmask")
    2714        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2716        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2717        .dwattr $C$DW$130, DW_AT_decl_line(0x7a)
    2718        .dwattr $C$DW$130, DW_AT_decl_column(0x0a)
    2719
    2720$C$DW$131       .dwtag  DW_TAG_member
    2721        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
    2722        .dwattr $C$DW$131, DW_AT_name("unibus_control")
    2723        .dwattr $C$DW$131, DW_AT_TI_symbol_name("unibus_control")
    2724        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2725        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2726        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2727        .dwattr $C$DW$131, DW_AT_decl_line(0x7d)
    2728        .dwattr $C$DW$131, DW_AT_decl_column(0x0a)
    2729
    2730$C$DW$132       .dwtag  DW_TAG_member
    2731        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$22)
    2732        .dwattr $C$DW$132, DW_AT_name("device_handle")
    2733        .dwattr $C$DW$132, DW_AT_TI_symbol_name("device_handle")
    2734        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2735        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2736        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2737        .dwattr $C$DW$132, DW_AT_decl_line(0x7f)
    2738        .dwattr $C$DW$132, DW_AT_decl_column(0x0a)
    2739
    2740$C$DW$133       .dwtag  DW_TAG_member
    2741        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
    2742        .dwattr $C$DW$133, DW_AT_name("device_register_idx")
    2743        .dwattr $C$DW$133, DW_AT_TI_symbol_name("device_register_idx")
    2744        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2745        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2746        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2747        .dwattr $C$DW$133, DW_AT_decl_line(0x81)
    2748        .dwattr $C$DW$133, DW_AT_decl_column(0x0a)
    2749
    2750$C$DW$134       .dwtag  DW_TAG_member
    2751        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
    2752        .dwattr $C$DW$134, DW_AT_name("addr")
    2753        .dwattr $C$DW$134, DW_AT_TI_symbol_name("addr")
    2754        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2755        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2756        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2757        .dwattr $C$DW$134, DW_AT_decl_line(0x83)
    2758        .dwattr $C$DW$134, DW_AT_decl_column(0x0b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   52

    2759
    2760$C$DW$135       .dwtag  DW_TAG_member
    2761        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$24)
    2762        .dwattr $C$DW$135, DW_AT_name("data")
    2763        .dwattr $C$DW$135, DW_AT_TI_symbol_name("data")
    2764        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2765        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2766        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2767        .dwattr $C$DW$135, DW_AT_decl_line(0x84)
    2768        .dwattr $C$DW$135, DW_AT_decl_column(0x0b)
    2769
    2770$C$DW$136       .dwtag  DW_TAG_member
    2771        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2772        .dwattr $C$DW$136, DW_AT_name("initialization_signals_prev")
    2773        .dwattr $C$DW$136, DW_AT_TI_symbol_name("initialization_signals_prev")
    2774        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2775        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2776        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2777        .dwattr $C$DW$136, DW_AT_decl_line(0x87)
    2778        .dwattr $C$DW$136, DW_AT_decl_column(0x0a)
    2779
    2780$C$DW$137       .dwtag  DW_TAG_member
    2781        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    2782        .dwattr $C$DW$137, DW_AT_name("initialization_signals_cur")
    2783        .dwattr $C$DW$137, DW_AT_TI_symbol_name("initialization_signals_cur")
    2784        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2785        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2786        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2787        .dwattr $C$DW$137, DW_AT_decl_line(0x88)
    2788        .dwattr $C$DW$137, DW_AT_decl_column(0x0a)
    2789
    2790        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2791        .dwattr $C$DW$T$25, DW_AT_decl_line(0x79)
    2792        .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2793        .dwendtag $C$DW$T$25
    2794
    2795$C$DW$T$35      .dwtag  DW_TAG_typedef
    2796        .dwattr $C$DW$T$35, DW_AT_name("mailbox_events_t")
    2797        .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
    2798        .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2799        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2800        .dwattr $C$DW$T$35, DW_AT_decl_line(0x8b)
    2801        .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2802
    2803
    2804$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2805        .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    2806$C$DW$138       .dwtag  DW_TAG_member
    2807        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2808        .dwattr $C$DW$138, DW_AT_name("addr")
    2809        .dwattr $C$DW$138, DW_AT_TI_symbol_name("addr")
    2810        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2812        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2813        .dwattr $C$DW$138, DW_AT_decl_line(0x4c)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   53

    2814        .dwattr $C$DW$138, DW_AT_decl_column(0x0b)
    2815
    2816$C$DW$139       .dwtag  DW_TAG_member
    2817        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    2818        .dwattr $C$DW$139, DW_AT_name("val")
    2819        .dwattr $C$DW$139, DW_AT_TI_symbol_name("val")
    2820        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2821        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2822        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2823        .dwattr $C$DW$139, DW_AT_decl_line(0x4d)
    2824        .dwattr $C$DW$139, DW_AT_decl_column(0x0b)
    2825
    2826        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2827        .dwattr $C$DW$T$26, DW_AT_decl_line(0x4b)
    2828        .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2829        .dwendtag $C$DW$T$26
    2830
    2831$C$DW$T$76      .dwtag  DW_TAG_typedef
    2832        .dwattr $C$DW$T$76, DW_AT_name("mailbox_test_t")
    2833        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$26)
    2834        .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2835        .dwattr $C$DW$T$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2836        .dwattr $C$DW$T$76, DW_AT_decl_line(0x4e)
    2837        .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    2838
    2839
    2840$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2841        .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
    2842$C$DW$140       .dwtag  DW_TAG_member
    2843        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    2844        .dwattr $C$DW$140, DW_AT_name("addr")
    2845        .dwattr $C$DW$140, DW_AT_TI_symbol_name("addr")
    2846        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2848        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2849        .dwattr $C$DW$140, DW_AT_decl_line(0x51)
    2850        .dwattr $C$DW$140, DW_AT_decl_column(0x0b)
    2851
    2852$C$DW$141       .dwtag  DW_TAG_member
    2853        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    2854        .dwattr $C$DW$141, DW_AT_name("bitmask")
    2855        .dwattr $C$DW$141, DW_AT_TI_symbol_name("bitmask")
    2856        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2857        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2858        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2859        .dwattr $C$DW$141, DW_AT_decl_line(0x52)
    2860        .dwattr $C$DW$141, DW_AT_decl_column(0x0b)
    2861
    2862$C$DW$142       .dwtag  DW_TAG_member
    2863        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$23)
    2864        .dwattr $C$DW$142, DW_AT_name("val")
    2865        .dwattr $C$DW$142, DW_AT_TI_symbol_name("val")
    2866        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2867        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2868        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   54

    2869        .dwattr $C$DW$142, DW_AT_decl_line(0x53)
    2870        .dwattr $C$DW$142, DW_AT_decl_column(0x0b)
    2871
    2872        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2873        .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
    2874        .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2875        .dwendtag $C$DW$T$27
    2876
    2877$C$DW$T$77      .dwtag  DW_TAG_typedef
    2878        .dwattr $C$DW$T$77, DW_AT_name("mailbox_buslatch_t")
    2879        .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    2880        .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2881        .dwattr $C$DW$T$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2882        .dwattr $C$DW$T$77, DW_AT_decl_line(0x54)
    2883        .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    2884
    2885
    2886$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2887        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2888$C$DW$143       .dwtag  DW_TAG_member
    2889        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    2890        .dwattr $C$DW$143, DW_AT_name("addr_0_7")
    2891        .dwattr $C$DW$143, DW_AT_TI_symbol_name("addr_0_7")
    2892        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2894        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2895        .dwattr $C$DW$143, DW_AT_decl_line(0x57)
    2896        .dwattr $C$DW$143, DW_AT_decl_column(0x0a)
    2897
    2898$C$DW$144       .dwtag  DW_TAG_member
    2899        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$22)
    2900        .dwattr $C$DW$144, DW_AT_name("addr_8_15")
    2901        .dwattr $C$DW$144, DW_AT_TI_symbol_name("addr_8_15")
    2902        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2903        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2904        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2905        .dwattr $C$DW$144, DW_AT_decl_line(0x58)
    2906        .dwattr $C$DW$144, DW_AT_decl_column(0x0a)
    2907
    2908$C$DW$145       .dwtag  DW_TAG_member
    2909        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2910        .dwattr $C$DW$145, DW_AT_name("data_0_7")
    2911        .dwattr $C$DW$145, DW_AT_TI_symbol_name("data_0_7")
    2912        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2913        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2914        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2915        .dwattr $C$DW$145, DW_AT_decl_line(0x59)
    2916        .dwattr $C$DW$145, DW_AT_decl_column(0x0a)
    2917
    2918$C$DW$146       .dwtag  DW_TAG_member
    2919        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
    2920        .dwattr $C$DW$146, DW_AT_name("data_8_15")
    2921        .dwattr $C$DW$146, DW_AT_TI_symbol_name("data_8_15")
    2922        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2923        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   55

    2924        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2925        .dwattr $C$DW$146, DW_AT_decl_line(0x5a)
    2926        .dwattr $C$DW$146, DW_AT_decl_column(0x0a)
    2927
    2928        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2929        .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
    2930        .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2931        .dwendtag $C$DW$T$28
    2932
    2933$C$DW$T$78      .dwtag  DW_TAG_typedef
    2934        .dwattr $C$DW$T$78, DW_AT_name("mailbox_buslatch_test_t")
    2935        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$28)
    2936        .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2937        .dwattr $C$DW$T$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2938        .dwattr $C$DW$T$78, DW_AT_decl_line(0x5b)
    2939        .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    2940
    2941
    2942$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2943        .dwattr $C$DW$T$30, DW_AT_byte_size(0x40c)
    2944$C$DW$147       .dwtag  DW_TAG_member
    2945        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    2946        .dwattr $C$DW$147, DW_AT_name("cur_status")
    2947        .dwattr $C$DW$147, DW_AT_TI_symbol_name("cur_status")
    2948        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2950        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2951        .dwattr $C$DW$147, DW_AT_decl_line(0x61)
    2952        .dwattr $C$DW$147, DW_AT_decl_column(0x0a)
    2953
    2954$C$DW$148       .dwtag  DW_TAG_member
    2955        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    2956        .dwattr $C$DW$148, DW_AT_name("control")
    2957        .dwattr $C$DW$148, DW_AT_TI_symbol_name("control")
    2958        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2959        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2960        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2961        .dwattr $C$DW$148, DW_AT_decl_line(0x62)
    2962        .dwattr $C$DW$148, DW_AT_decl_column(0x0a)
    2963
    2964$C$DW$149       .dwtag  DW_TAG_member
    2965        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$24)
    2966        .dwattr $C$DW$149, DW_AT_name("wordcount")
    2967        .dwattr $C$DW$149, DW_AT_TI_symbol_name("wordcount")
    2968        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2969        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2970        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2971        .dwattr $C$DW$149, DW_AT_decl_line(0x63)
    2972        .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    2973
    2974$C$DW$150       .dwtag  DW_TAG_member
    2975        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
    2976        .dwattr $C$DW$150, DW_AT_name("cur_addr")
    2977        .dwattr $C$DW$150, DW_AT_TI_symbol_name("cur_addr")
    2978        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   56

    2979        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2980        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2981        .dwattr $C$DW$150, DW_AT_decl_line(0x64)
    2982        .dwattr $C$DW$150, DW_AT_decl_column(0x0b)
    2983
    2984$C$DW$151       .dwtag  DW_TAG_member
    2985        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    2986        .dwattr $C$DW$151, DW_AT_name("startaddr")
    2987        .dwattr $C$DW$151, DW_AT_TI_symbol_name("startaddr")
    2988        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2989        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2990        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2991        .dwattr $C$DW$151, DW_AT_decl_line(0x65)
    2992        .dwattr $C$DW$151, DW_AT_decl_column(0x0b)
    2993
    2994$C$DW$152       .dwtag  DW_TAG_member
    2995        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$29)
    2996        .dwattr $C$DW$152, DW_AT_name("words")
    2997        .dwattr $C$DW$152, DW_AT_TI_symbol_name("words")
    2998        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2999        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3000        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3001        .dwattr $C$DW$152, DW_AT_decl_line(0x66)
    3002        .dwattr $C$DW$152, DW_AT_decl_column(0x0b)
    3003
    3004        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3005        .dwattr $C$DW$T$30, DW_AT_decl_line(0x5f)
    3006        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    3007        .dwendtag $C$DW$T$30
    3008
    3009$C$DW$T$79      .dwtag  DW_TAG_typedef
    3010        .dwattr $C$DW$T$79, DW_AT_name("mailbox_dma_t")
    3011        .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$30)
    3012        .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3013        .dwattr $C$DW$T$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3014        .dwattr $C$DW$T$79, DW_AT_decl_line(0x67)
    3015        .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3016
    3017
    3018$C$DW$T$31      .dwtag  DW_TAG_structure_type
    3019        .dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
    3020$C$DW$153       .dwtag  DW_TAG_member
    3021        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$24)
    3022        .dwattr $C$DW$153, DW_AT_name("vector")
    3023        .dwattr $C$DW$153, DW_AT_TI_symbol_name("vector")
    3024        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3026        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3027        .dwattr $C$DW$153, DW_AT_decl_line(0x6b)
    3028        .dwattr $C$DW$153, DW_AT_decl_column(0x0b)
    3029
    3030$C$DW$154       .dwtag  DW_TAG_member
    3031        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$22)
    3032        .dwattr $C$DW$154, DW_AT_name("priority_bit")
    3033        .dwattr $C$DW$154, DW_AT_TI_symbol_name("priority_bit")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   57

    3034        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3035        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3036        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3037        .dwattr $C$DW$154, DW_AT_decl_line(0x6c)
    3038        .dwattr $C$DW$154, DW_AT_decl_column(0x0a)
    3039
    3040        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3041        .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
    3042        .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3043        .dwendtag $C$DW$T$31
    3044
    3045$C$DW$T$80      .dwtag  DW_TAG_typedef
    3046        .dwattr $C$DW$T$80, DW_AT_name("mailbox_intr_t")
    3047        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$31)
    3048        .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3049        .dwattr $C$DW$T$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3050        .dwattr $C$DW$T$80, DW_AT_decl_line(0x6d)
    3051        .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    3052
    3053
    3054$C$DW$T$36      .dwtag  DW_TAG_structure_type
    3055        .dwattr $C$DW$T$36, DW_AT_byte_size(0x424)
    3056$C$DW$155       .dwtag  DW_TAG_member
    3057        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    3058        .dwattr $C$DW$155, DW_AT_name("arm2pru_req")
    3059        .dwattr $C$DW$155, DW_AT_TI_symbol_name("arm2pru_req")
    3060        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3062        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3063        .dwattr $C$DW$155, DW_AT_decl_line(0x90)
    3064        .dwattr $C$DW$155, DW_AT_decl_column(0x0b)
    3065
    3066$C$DW$156       .dwtag  DW_TAG_member
    3067        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    3068        .dwattr $C$DW$156, DW_AT_name("arm2pru_resp")
    3069        .dwattr $C$DW$156, DW_AT_TI_symbol_name("arm2pru_resp")
    3070        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3071        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3072        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3073        .dwattr $C$DW$156, DW_AT_decl_line(0x91)
    3074        .dwattr $C$DW$156, DW_AT_decl_column(0x0b)
    3075
    3076$C$DW$157       .dwtag  DW_TAG_member
    3077        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$34)
    3078        .dwattr $C$DW$157, DW_AT_name("ddrmem_base_physical")
    3079        .dwattr $C$DW$157, DW_AT_TI_symbol_name("ddrmem_base_physical")
    3080        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3081        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3082        .dwattr $C$DW$157, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3083        .dwattr $C$DW$157, DW_AT_decl_line(0x94)
    3084        .dwattr $C$DW$157, DW_AT_decl_column(0x15)
    3085
    3086$C$DW$158       .dwtag  DW_TAG_member
    3087        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$35)
    3088        .dwattr $C$DW$158, DW_AT_name("events")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   58

    3089        .dwattr $C$DW$158, DW_AT_TI_symbol_name("events")
    3090        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3091        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3092        .dwattr $C$DW$158, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3093        .dwattr $C$DW$158, DW_AT_decl_line(0x97)
    3094        .dwattr $C$DW$158, DW_AT_decl_column(0x13)
    3095
    3096$C$DW$159       .dwtag  DW_TAG_member
    3097        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$81)
    3098        .dwattr $C$DW$159, DW_AT_name("$P$T1")
    3099        .dwattr $C$DW$159, DW_AT_TI_symbol_name("$P$T1")
    3100        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3101        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3102        .dwattr $C$DW$159, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3103        .dwattr $C$DW$159, DW_AT_decl_line(0x9a)
    3104        .dwattr $C$DW$159, DW_AT_decl_column(0x02)
    3105
    3106        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3107        .dwattr $C$DW$T$36, DW_AT_decl_line(0x8d)
    3108        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3109        .dwendtag $C$DW$T$36
    3110
    3111$C$DW$T$129     .dwtag  DW_TAG_volatile_type
    3112        .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$36)
    3113
    3114$C$DW$T$130     .dwtag  DW_TAG_pointer_type
    3115        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    3116        .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    3117
    3118$C$DW$T$131     .dwtag  DW_TAG_typedef
    3119        .dwattr $C$DW$T$131, DW_AT_name("mailbox_t")
    3120        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$36)
    3121        .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    3122        .dwattr $C$DW$T$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared
    3123        .dwattr $C$DW$T$131, DW_AT_decl_line(0xa1)
    3124        .dwattr $C$DW$T$131, DW_AT_decl_column(0x03)
    3125
    3126$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    3127        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    3128
    3129
    3130$C$DW$T$38      .dwtag  DW_TAG_structure_type
    3131        .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    3132$C$DW$160       .dwtag  DW_TAG_member
    3133        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$37)
    3134        .dwattr $C$DW$160, DW_AT_name("cur_reg_val")
    3135        .dwattr $C$DW$160, DW_AT_TI_symbol_name("cur_reg_val")
    3136        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3138        .dwattr $C$DW$160, DW_AT_decl_file("pru1_buslatches.h")
    3139        .dwattr $C$DW$160, DW_AT_decl_line(0x22)
    3140        .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    3141
    3142$C$DW$161       .dwtag  DW_TAG_member
    3143        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$37)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   59

    3144        .dwattr $C$DW$161, DW_AT_name("bidi_bitwidth")
    3145        .dwattr $C$DW$161, DW_AT_TI_symbol_name("bidi_bitwidth")
    3146        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3147        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3148        .dwattr $C$DW$161, DW_AT_decl_file("pru1_buslatches.h")
    3149        .dwattr $C$DW$161, DW_AT_decl_line(0x26)
    3150        .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    3151
    3152        .dwattr $C$DW$T$38, DW_AT_decl_file("pru1_buslatches.h")
    3153        .dwattr $C$DW$T$38, DW_AT_decl_line(0x21)
    3154        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3155        .dwendtag $C$DW$T$38
    3156
    3157$C$DW$T$134     .dwtag  DW_TAG_typedef
    3158        .dwattr $C$DW$T$134, DW_AT_name("buslatches_t")
    3159        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$38)
    3160        .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3161        .dwattr $C$DW$T$134, DW_AT_decl_file("pru1_buslatches.h")
    3162        .dwattr $C$DW$T$134, DW_AT_decl_line(0x2c)
    3163        .dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
    3164
    3165
    3166$C$DW$T$39      .dwtag  DW_TAG_structure_type
    3167        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    3168$C$DW$162       .dwtag  DW_TAG_member
    3169        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    3170        .dwattr $C$DW$162, DW_AT_name("REVID")
    3171        .dwattr $C$DW$162, DW_AT_TI_symbol_name("REVID")
    3172        .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    3173        .dwattr $C$DW$162, DW_AT_bit_size(0x20)
    3174        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3175        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3176        .dwattr $C$DW$162, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3177        .dwattr $C$DW$162, DW_AT_decl_line(0x2d)
    3178        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    3179
    3180        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3181        .dwattr $C$DW$T$39, DW_AT_decl_line(0x2c)
    3182        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    3183        .dwendtag $C$DW$T$39
    3184
    3185$C$DW$T$83      .dwtag  DW_TAG_volatile_type
    3186        .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
    3187
    3188
    3189$C$DW$T$40      .dwtag  DW_TAG_structure_type
    3190        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    3191$C$DW$163       .dwtag  DW_TAG_member
    3192        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    3193        .dwattr $C$DW$163, DW_AT_name("IDLE_MODE")
    3194        .dwattr $C$DW$163, DW_AT_TI_symbol_name("IDLE_MODE")
    3195        .dwattr $C$DW$163, DW_AT_bit_offset(0x1e)
    3196        .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    3197        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3198        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   60

    3199        .dwattr $C$DW$163, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3200        .dwattr $C$DW$163, DW_AT_decl_line(0x37)
    3201        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    3202
    3203$C$DW$164       .dwtag  DW_TAG_member
    3204        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    3205        .dwattr $C$DW$164, DW_AT_name("STANDBY_MODE")
    3206        .dwattr $C$DW$164, DW_AT_TI_symbol_name("STANDBY_MODE")
    3207        .dwattr $C$DW$164, DW_AT_bit_offset(0x1c)
    3208        .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    3209        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3210        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3211        .dwattr $C$DW$164, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3212        .dwattr $C$DW$164, DW_AT_decl_line(0x38)
    3213        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    3214
    3215$C$DW$165       .dwtag  DW_TAG_member
    3216        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    3217        .dwattr $C$DW$165, DW_AT_name("STANDBY_INIT")
    3218        .dwattr $C$DW$165, DW_AT_TI_symbol_name("STANDBY_INIT")
    3219        .dwattr $C$DW$165, DW_AT_bit_offset(0x1b)
    3220        .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    3221        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3223        .dwattr $C$DW$165, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3224        .dwattr $C$DW$165, DW_AT_decl_line(0x39)
    3225        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    3226
    3227$C$DW$166       .dwtag  DW_TAG_member
    3228        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    3229        .dwattr $C$DW$166, DW_AT_name("SUB_MWAIT")
    3230        .dwattr $C$DW$166, DW_AT_TI_symbol_name("SUB_MWAIT")
    3231        .dwattr $C$DW$166, DW_AT_bit_offset(0x1a)
    3232        .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3233        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3234        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3235        .dwattr $C$DW$166, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3236        .dwattr $C$DW$166, DW_AT_decl_line(0x3a)
    3237        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    3238
    3239$C$DW$167       .dwtag  DW_TAG_member
    3240        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    3241        .dwattr $C$DW$167, DW_AT_name("rsvd6")
    3242        .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd6")
    3243        .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    3244        .dwattr $C$DW$167, DW_AT_bit_size(0x1a)
    3245        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3247        .dwattr $C$DW$167, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3248        .dwattr $C$DW$167, DW_AT_decl_line(0x3b)
    3249        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    3250
    3251        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3252        .dwattr $C$DW$T$40, DW_AT_decl_line(0x36)
    3253        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   61

    3254        .dwendtag $C$DW$T$40
    3255
    3256$C$DW$T$85      .dwtag  DW_TAG_volatile_type
    3257        .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$40)
    3258
    3259
    3260$C$DW$T$41      .dwtag  DW_TAG_structure_type
    3261        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    3262$C$DW$168       .dwtag  DW_TAG_member
    3263        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    3264        .dwattr $C$DW$168, DW_AT_name("PRU0_GPI_MODE")
    3265        .dwattr $C$DW$168, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    3266        .dwattr $C$DW$168, DW_AT_bit_offset(0x1e)
    3267        .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    3268        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3270        .dwattr $C$DW$168, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3271        .dwattr $C$DW$168, DW_AT_decl_line(0x45)
    3272        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    3273
    3274$C$DW$169       .dwtag  DW_TAG_member
    3275        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    3276        .dwattr $C$DW$169, DW_AT_name("PRU0_GPI_CLK_MODE")
    3277        .dwattr $C$DW$169, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    3278        .dwattr $C$DW$169, DW_AT_bit_offset(0x1d)
    3279        .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3280        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3282        .dwattr $C$DW$169, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3283        .dwattr $C$DW$169, DW_AT_decl_line(0x46)
    3284        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    3285
    3286$C$DW$170       .dwtag  DW_TAG_member
    3287        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    3288        .dwattr $C$DW$170, DW_AT_name("PRU0_GPI_DIV0")
    3289        .dwattr $C$DW$170, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    3290        .dwattr $C$DW$170, DW_AT_bit_offset(0x18)
    3291        .dwattr $C$DW$170, DW_AT_bit_size(0x05)
    3292        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3293        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3294        .dwattr $C$DW$170, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3295        .dwattr $C$DW$170, DW_AT_decl_line(0x47)
    3296        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    3297
    3298$C$DW$171       .dwtag  DW_TAG_member
    3299        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    3300        .dwattr $C$DW$171, DW_AT_name("PRU0_GPI_DIV1")
    3301        .dwattr $C$DW$171, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    3302        .dwattr $C$DW$171, DW_AT_bit_offset(0x13)
    3303        .dwattr $C$DW$171, DW_AT_bit_size(0x05)
    3304        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3305        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3306        .dwattr $C$DW$171, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3307        .dwattr $C$DW$171, DW_AT_decl_line(0x48)
    3308        .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   62

    3309
    3310$C$DW$172       .dwtag  DW_TAG_member
    3311        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$11)
    3312        .dwattr $C$DW$172, DW_AT_name("PRU0_GPI_SB")
    3313        .dwattr $C$DW$172, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    3314        .dwattr $C$DW$172, DW_AT_bit_offset(0x12)
    3315        .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3316        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3317        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3318        .dwattr $C$DW$172, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3319        .dwattr $C$DW$172, DW_AT_decl_line(0x49)
    3320        .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    3321
    3322$C$DW$173       .dwtag  DW_TAG_member
    3323        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$11)
    3324        .dwattr $C$DW$173, DW_AT_name("PRU0_GPO_MODE")
    3325        .dwattr $C$DW$173, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    3326        .dwattr $C$DW$173, DW_AT_bit_offset(0x11)
    3327        .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3328        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3329        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3330        .dwattr $C$DW$173, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3331        .dwattr $C$DW$173, DW_AT_decl_line(0x4a)
    3332        .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    3333
    3334$C$DW$174       .dwtag  DW_TAG_member
    3335        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
    3336        .dwattr $C$DW$174, DW_AT_name("PRU0_GPO_DIV0")
    3337        .dwattr $C$DW$174, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    3338        .dwattr $C$DW$174, DW_AT_bit_offset(0x0c)
    3339        .dwattr $C$DW$174, DW_AT_bit_size(0x05)
    3340        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3341        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3342        .dwattr $C$DW$174, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3343        .dwattr $C$DW$174, DW_AT_decl_line(0x4b)
    3344        .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    3345
    3346$C$DW$175       .dwtag  DW_TAG_member
    3347        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
    3348        .dwattr $C$DW$175, DW_AT_name("PRU0_GPO_DIV1")
    3349        .dwattr $C$DW$175, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    3350        .dwattr $C$DW$175, DW_AT_bit_offset(0x07)
    3351        .dwattr $C$DW$175, DW_AT_bit_size(0x05)
    3352        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3354        .dwattr $C$DW$175, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3355        .dwattr $C$DW$175, DW_AT_decl_line(0x4c)
    3356        .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    3357
    3358$C$DW$176       .dwtag  DW_TAG_member
    3359        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
    3360        .dwattr $C$DW$176, DW_AT_name("PRU0_GPO_SH_SEL")
    3361        .dwattr $C$DW$176, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    3362        .dwattr $C$DW$176, DW_AT_bit_offset(0x06)
    3363        .dwattr $C$DW$176, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   63

    3364        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3365        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3366        .dwattr $C$DW$176, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3367        .dwattr $C$DW$176, DW_AT_decl_line(0x4d)
    3368        .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    3369
    3370$C$DW$177       .dwtag  DW_TAG_member
    3371        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$11)
    3372        .dwattr $C$DW$177, DW_AT_name("rsvd26")
    3373        .dwattr $C$DW$177, DW_AT_TI_symbol_name("rsvd26")
    3374        .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    3375        .dwattr $C$DW$177, DW_AT_bit_size(0x06)
    3376        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3377        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3378        .dwattr $C$DW$177, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3379        .dwattr $C$DW$177, DW_AT_decl_line(0x4e)
    3380        .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    3381
    3382        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3383        .dwattr $C$DW$T$41, DW_AT_decl_line(0x44)
    3384        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    3385        .dwendtag $C$DW$T$41
    3386
    3387$C$DW$T$87      .dwtag  DW_TAG_volatile_type
    3388        .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$41)
    3389
    3390
    3391$C$DW$T$42      .dwtag  DW_TAG_structure_type
    3392        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    3393$C$DW$178       .dwtag  DW_TAG_member
    3394        .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$11)
    3395        .dwattr $C$DW$178, DW_AT_name("PRU1_GPI_MODE")
    3396        .dwattr $C$DW$178, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    3397        .dwattr $C$DW$178, DW_AT_bit_offset(0x1e)
    3398        .dwattr $C$DW$178, DW_AT_bit_size(0x02)
    3399        .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3400        .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3401        .dwattr $C$DW$178, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3402        .dwattr $C$DW$178, DW_AT_decl_line(0x58)
    3403        .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    3404
    3405$C$DW$179       .dwtag  DW_TAG_member
    3406        .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$11)
    3407        .dwattr $C$DW$179, DW_AT_name("PRU1_GPI_CLK_MODE")
    3408        .dwattr $C$DW$179, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    3409        .dwattr $C$DW$179, DW_AT_bit_offset(0x1d)
    3410        .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    3411        .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3412        .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3413        .dwattr $C$DW$179, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3414        .dwattr $C$DW$179, DW_AT_decl_line(0x59)
    3415        .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    3416
    3417$C$DW$180       .dwtag  DW_TAG_member
    3418        .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   64

    3419        .dwattr $C$DW$180, DW_AT_name("PRU1_GPI_DIV0")
    3420        .dwattr $C$DW$180, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    3421        .dwattr $C$DW$180, DW_AT_bit_offset(0x18)
    3422        .dwattr $C$DW$180, DW_AT_bit_size(0x05)
    3423        .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424        .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3425        .dwattr $C$DW$180, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3426        .dwattr $C$DW$180, DW_AT_decl_line(0x5a)
    3427        .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    3428
    3429$C$DW$181       .dwtag  DW_TAG_member
    3430        .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$11)
    3431        .dwattr $C$DW$181, DW_AT_name("PRU1_GPI_DIV1")
    3432        .dwattr $C$DW$181, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    3433        .dwattr $C$DW$181, DW_AT_bit_offset(0x13)
    3434        .dwattr $C$DW$181, DW_AT_bit_size(0x05)
    3435        .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3436        .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3437        .dwattr $C$DW$181, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3438        .dwattr $C$DW$181, DW_AT_decl_line(0x5b)
    3439        .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    3440
    3441$C$DW$182       .dwtag  DW_TAG_member
    3442        .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$11)
    3443        .dwattr $C$DW$182, DW_AT_name("PRU1_GPI_SB")
    3444        .dwattr $C$DW$182, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    3445        .dwattr $C$DW$182, DW_AT_bit_offset(0x12)
    3446        .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3447        .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3448        .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3449        .dwattr $C$DW$182, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3450        .dwattr $C$DW$182, DW_AT_decl_line(0x5c)
    3451        .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    3452
    3453$C$DW$183       .dwtag  DW_TAG_member
    3454        .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$11)
    3455        .dwattr $C$DW$183, DW_AT_name("PRU1_GPO_MODE")
    3456        .dwattr $C$DW$183, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    3457        .dwattr $C$DW$183, DW_AT_bit_offset(0x11)
    3458        .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3459        .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3460        .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3461        .dwattr $C$DW$183, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3462        .dwattr $C$DW$183, DW_AT_decl_line(0x5d)
    3463        .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    3464
    3465$C$DW$184       .dwtag  DW_TAG_member
    3466        .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$11)
    3467        .dwattr $C$DW$184, DW_AT_name("PRU1_GPO_DIV0")
    3468        .dwattr $C$DW$184, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    3469        .dwattr $C$DW$184, DW_AT_bit_offset(0x0c)
    3470        .dwattr $C$DW$184, DW_AT_bit_size(0x05)
    3471        .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3472        .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3473        .dwattr $C$DW$184, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   65

    3474        .dwattr $C$DW$184, DW_AT_decl_line(0x5e)
    3475        .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    3476
    3477$C$DW$185       .dwtag  DW_TAG_member
    3478        .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$11)
    3479        .dwattr $C$DW$185, DW_AT_name("PRU1_GPO_DIV1")
    3480        .dwattr $C$DW$185, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    3481        .dwattr $C$DW$185, DW_AT_bit_offset(0x07)
    3482        .dwattr $C$DW$185, DW_AT_bit_size(0x05)
    3483        .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3484        .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3485        .dwattr $C$DW$185, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3486        .dwattr $C$DW$185, DW_AT_decl_line(0x5f)
    3487        .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    3488
    3489$C$DW$186       .dwtag  DW_TAG_member
    3490        .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$11)
    3491        .dwattr $C$DW$186, DW_AT_name("PRU1_GPO_SH_SEL")
    3492        .dwattr $C$DW$186, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    3493        .dwattr $C$DW$186, DW_AT_bit_offset(0x06)
    3494        .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    3495        .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3496        .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3497        .dwattr $C$DW$186, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3498        .dwattr $C$DW$186, DW_AT_decl_line(0x60)
    3499        .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    3500
    3501$C$DW$187       .dwtag  DW_TAG_member
    3502        .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$11)
    3503        .dwattr $C$DW$187, DW_AT_name("rsvd26")
    3504        .dwattr $C$DW$187, DW_AT_TI_symbol_name("rsvd26")
    3505        .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3506        .dwattr $C$DW$187, DW_AT_bit_size(0x06)
    3507        .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3508        .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3509        .dwattr $C$DW$187, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3510        .dwattr $C$DW$187, DW_AT_decl_line(0x61)
    3511        .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    3512
    3513        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3514        .dwattr $C$DW$T$42, DW_AT_decl_line(0x57)
    3515        .dwattr $C$DW$T$42, DW_AT_decl_column(0x13)
    3516        .dwendtag $C$DW$T$42
    3517
    3518$C$DW$T$89      .dwtag  DW_TAG_volatile_type
    3519        .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    3520
    3521
    3522$C$DW$T$43      .dwtag  DW_TAG_structure_type
    3523        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    3524$C$DW$188       .dwtag  DW_TAG_member
    3525        .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$11)
    3526        .dwattr $C$DW$188, DW_AT_name("PRU0_CLK_STOP_REQ")
    3527        .dwattr $C$DW$188, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    3528        .dwattr $C$DW$188, DW_AT_bit_offset(0x1f)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   66

    3529        .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    3530        .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531        .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3532        .dwattr $C$DW$188, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3533        .dwattr $C$DW$188, DW_AT_decl_line(0x6b)
    3534        .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    3535
    3536$C$DW$189       .dwtag  DW_TAG_member
    3537        .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$11)
    3538        .dwattr $C$DW$189, DW_AT_name("PRU0_CLK_STOP_ACK")
    3539        .dwattr $C$DW$189, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    3540        .dwattr $C$DW$189, DW_AT_bit_offset(0x1e)
    3541        .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    3542        .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543        .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3544        .dwattr $C$DW$189, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3545        .dwattr $C$DW$189, DW_AT_decl_line(0x6c)
    3546        .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    3547
    3548$C$DW$190       .dwtag  DW_TAG_member
    3549        .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$11)
    3550        .dwattr $C$DW$190, DW_AT_name("PRU0_CLK_EN")
    3551        .dwattr $C$DW$190, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    3552        .dwattr $C$DW$190, DW_AT_bit_offset(0x1d)
    3553        .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    3554        .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3555        .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3556        .dwattr $C$DW$190, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3557        .dwattr $C$DW$190, DW_AT_decl_line(0x6d)
    3558        .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    3559
    3560$C$DW$191       .dwtag  DW_TAG_member
    3561        .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$11)
    3562        .dwattr $C$DW$191, DW_AT_name("PRU1_CLK_STOP_REQ")
    3563        .dwattr $C$DW$191, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    3564        .dwattr $C$DW$191, DW_AT_bit_offset(0x1c)
    3565        .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3566        .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3567        .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3568        .dwattr $C$DW$191, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3569        .dwattr $C$DW$191, DW_AT_decl_line(0x6e)
    3570        .dwattr $C$DW$191, DW_AT_decl_column(0x0d)
    3571
    3572$C$DW$192       .dwtag  DW_TAG_member
    3573        .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$11)
    3574        .dwattr $C$DW$192, DW_AT_name("PRU1_CLK_STOP_ACK")
    3575        .dwattr $C$DW$192, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    3576        .dwattr $C$DW$192, DW_AT_bit_offset(0x1b)
    3577        .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3578        .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3579        .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3580        .dwattr $C$DW$192, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3581        .dwattr $C$DW$192, DW_AT_decl_line(0x6f)
    3582        .dwattr $C$DW$192, DW_AT_decl_column(0x0d)
    3583
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   67

    3584$C$DW$193       .dwtag  DW_TAG_member
    3585        .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$11)
    3586        .dwattr $C$DW$193, DW_AT_name("PRU1_CLK_EN")
    3587        .dwattr $C$DW$193, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    3588        .dwattr $C$DW$193, DW_AT_bit_offset(0x1a)
    3589        .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3590        .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3591        .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3592        .dwattr $C$DW$193, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3593        .dwattr $C$DW$193, DW_AT_decl_line(0x70)
    3594        .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    3595
    3596$C$DW$194       .dwtag  DW_TAG_member
    3597        .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$11)
    3598        .dwattr $C$DW$194, DW_AT_name("INTC_CLK_STOP_REQ")
    3599        .dwattr $C$DW$194, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    3600        .dwattr $C$DW$194, DW_AT_bit_offset(0x19)
    3601        .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3602        .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3603        .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3604        .dwattr $C$DW$194, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3605        .dwattr $C$DW$194, DW_AT_decl_line(0x71)
    3606        .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    3607
    3608$C$DW$195       .dwtag  DW_TAG_member
    3609        .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
    3610        .dwattr $C$DW$195, DW_AT_name("INTC_CLK_STOP_ACK")
    3611        .dwattr $C$DW$195, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    3612        .dwattr $C$DW$195, DW_AT_bit_offset(0x18)
    3613        .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    3614        .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3615        .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3616        .dwattr $C$DW$195, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3617        .dwattr $C$DW$195, DW_AT_decl_line(0x72)
    3618        .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    3619
    3620$C$DW$196       .dwtag  DW_TAG_member
    3621        .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$11)
    3622        .dwattr $C$DW$196, DW_AT_name("INTC_CLK_EN")
    3623        .dwattr $C$DW$196, DW_AT_TI_symbol_name("INTC_CLK_EN")
    3624        .dwattr $C$DW$196, DW_AT_bit_offset(0x17)
    3625        .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3626        .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3627        .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3628        .dwattr $C$DW$196, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3629        .dwattr $C$DW$196, DW_AT_decl_line(0x73)
    3630        .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    3631
    3632$C$DW$197       .dwtag  DW_TAG_member
    3633        .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$11)
    3634        .dwattr $C$DW$197, DW_AT_name("UART_CLK_STOP_REQ")
    3635        .dwattr $C$DW$197, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    3636        .dwattr $C$DW$197, DW_AT_bit_offset(0x16)
    3637        .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    3638        .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   68

    3639        .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3640        .dwattr $C$DW$197, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3641        .dwattr $C$DW$197, DW_AT_decl_line(0x74)
    3642        .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    3643
    3644$C$DW$198       .dwtag  DW_TAG_member
    3645        .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$11)
    3646        .dwattr $C$DW$198, DW_AT_name("UART_CLK_STOP_ACK")
    3647        .dwattr $C$DW$198, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    3648        .dwattr $C$DW$198, DW_AT_bit_offset(0x15)
    3649        .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    3650        .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3651        .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3652        .dwattr $C$DW$198, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3653        .dwattr $C$DW$198, DW_AT_decl_line(0x75)
    3654        .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    3655
    3656$C$DW$199       .dwtag  DW_TAG_member
    3657        .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$11)
    3658        .dwattr $C$DW$199, DW_AT_name("UART_CLK_EN")
    3659        .dwattr $C$DW$199, DW_AT_TI_symbol_name("UART_CLK_EN")
    3660        .dwattr $C$DW$199, DW_AT_bit_offset(0x14)
    3661        .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3662        .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3663        .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3664        .dwattr $C$DW$199, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3665        .dwattr $C$DW$199, DW_AT_decl_line(0x76)
    3666        .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    3667
    3668$C$DW$200       .dwtag  DW_TAG_member
    3669        .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$11)
    3670        .dwattr $C$DW$200, DW_AT_name("ECAP_CLK_STOP_REQ")
    3671        .dwattr $C$DW$200, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    3672        .dwattr $C$DW$200, DW_AT_bit_offset(0x13)
    3673        .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3674        .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3675        .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3676        .dwattr $C$DW$200, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3677        .dwattr $C$DW$200, DW_AT_decl_line(0x77)
    3678        .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    3679
    3680$C$DW$201       .dwtag  DW_TAG_member
    3681        .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$11)
    3682        .dwattr $C$DW$201, DW_AT_name("ECAP_CLK_STOP_ACK")
    3683        .dwattr $C$DW$201, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    3684        .dwattr $C$DW$201, DW_AT_bit_offset(0x12)
    3685        .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    3686        .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687        .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3688        .dwattr $C$DW$201, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3689        .dwattr $C$DW$201, DW_AT_decl_line(0x78)
    3690        .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    3691
    3692$C$DW$202       .dwtag  DW_TAG_member
    3693        .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   69

    3694        .dwattr $C$DW$202, DW_AT_name("ECAP_CLK_EN")
    3695        .dwattr $C$DW$202, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    3696        .dwattr $C$DW$202, DW_AT_bit_offset(0x11)
    3697        .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3698        .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3699        .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3700        .dwattr $C$DW$202, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3701        .dwattr $C$DW$202, DW_AT_decl_line(0x79)
    3702        .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    3703
    3704$C$DW$203       .dwtag  DW_TAG_member
    3705        .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$11)
    3706        .dwattr $C$DW$203, DW_AT_name("IEP_CLK_STOP_REQ")
    3707        .dwattr $C$DW$203, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    3708        .dwattr $C$DW$203, DW_AT_bit_offset(0x10)
    3709        .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3710        .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711        .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3712        .dwattr $C$DW$203, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3713        .dwattr $C$DW$203, DW_AT_decl_line(0x7a)
    3714        .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    3715
    3716$C$DW$204       .dwtag  DW_TAG_member
    3717        .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$11)
    3718        .dwattr $C$DW$204, DW_AT_name("IEP_CLK_STOP_ACK")
    3719        .dwattr $C$DW$204, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    3720        .dwattr $C$DW$204, DW_AT_bit_offset(0x0f)
    3721        .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3722        .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3723        .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3724        .dwattr $C$DW$204, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3725        .dwattr $C$DW$204, DW_AT_decl_line(0x7b)
    3726        .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    3727
    3728$C$DW$205       .dwtag  DW_TAG_member
    3729        .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$11)
    3730        .dwattr $C$DW$205, DW_AT_name("IEP_CLK_EN")
    3731        .dwattr $C$DW$205, DW_AT_TI_symbol_name("IEP_CLK_EN")
    3732        .dwattr $C$DW$205, DW_AT_bit_offset(0x0e)
    3733        .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    3734        .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3735        .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3736        .dwattr $C$DW$205, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3737        .dwattr $C$DW$205, DW_AT_decl_line(0x7c)
    3738        .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    3739
    3740$C$DW$206       .dwtag  DW_TAG_member
    3741        .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$11)
    3742        .dwattr $C$DW$206, DW_AT_name("rsvd18")
    3743        .dwattr $C$DW$206, DW_AT_TI_symbol_name("rsvd18")
    3744        .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    3745        .dwattr $C$DW$206, DW_AT_bit_size(0x0e)
    3746        .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3747        .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3748        .dwattr $C$DW$206, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   70

    3749        .dwattr $C$DW$206, DW_AT_decl_line(0x7d)
    3750        .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    3751
    3752        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3753        .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    3754        .dwattr $C$DW$T$43, DW_AT_decl_column(0x13)
    3755        .dwendtag $C$DW$T$43
    3756
    3757$C$DW$T$91      .dwtag  DW_TAG_volatile_type
    3758        .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$43)
    3759
    3760
    3761$C$DW$T$44      .dwtag  DW_TAG_structure_type
    3762        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    3763$C$DW$207       .dwtag  DW_TAG_member
    3764        .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$11)
    3765        .dwattr $C$DW$207, DW_AT_name("PRU0_IMEM_PE_RAW")
    3766        .dwattr $C$DW$207, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    3767        .dwattr $C$DW$207, DW_AT_bit_offset(0x1c)
    3768        .dwattr $C$DW$207, DW_AT_bit_size(0x04)
    3769        .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3770        .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3771        .dwattr $C$DW$207, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3772        .dwattr $C$DW$207, DW_AT_decl_line(0x87)
    3773        .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    3774
    3775$C$DW$208       .dwtag  DW_TAG_member
    3776        .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$11)
    3777        .dwattr $C$DW$208, DW_AT_name("PRU0_DMEM_PE_RAW")
    3778        .dwattr $C$DW$208, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    3779        .dwattr $C$DW$208, DW_AT_bit_offset(0x18)
    3780        .dwattr $C$DW$208, DW_AT_bit_size(0x04)
    3781        .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3782        .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3783        .dwattr $C$DW$208, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3784        .dwattr $C$DW$208, DW_AT_decl_line(0x88)
    3785        .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    3786
    3787$C$DW$209       .dwtag  DW_TAG_member
    3788        .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$11)
    3789        .dwattr $C$DW$209, DW_AT_name("PRU1_IMEM_PE_RAW")
    3790        .dwattr $C$DW$209, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    3791        .dwattr $C$DW$209, DW_AT_bit_offset(0x14)
    3792        .dwattr $C$DW$209, DW_AT_bit_size(0x04)
    3793        .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3794        .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3795        .dwattr $C$DW$209, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3796        .dwattr $C$DW$209, DW_AT_decl_line(0x89)
    3797        .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    3798
    3799$C$DW$210       .dwtag  DW_TAG_member
    3800        .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$11)
    3801        .dwattr $C$DW$210, DW_AT_name("PRU1_DMEM_PE_RAW")
    3802        .dwattr $C$DW$210, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    3803        .dwattr $C$DW$210, DW_AT_bit_offset(0x10)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   71

    3804        .dwattr $C$DW$210, DW_AT_bit_size(0x04)
    3805        .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3806        .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3807        .dwattr $C$DW$210, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3808        .dwattr $C$DW$210, DW_AT_decl_line(0x8a)
    3809        .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    3810
    3811$C$DW$211       .dwtag  DW_TAG_member
    3812        .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$11)
    3813        .dwattr $C$DW$211, DW_AT_name("RAM_PE_RAW")
    3814        .dwattr $C$DW$211, DW_AT_TI_symbol_name("RAM_PE_RAW")
    3815        .dwattr $C$DW$211, DW_AT_bit_offset(0x0c)
    3816        .dwattr $C$DW$211, DW_AT_bit_size(0x04)
    3817        .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3818        .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3819        .dwattr $C$DW$211, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3820        .dwattr $C$DW$211, DW_AT_decl_line(0x8b)
    3821        .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    3822
    3823$C$DW$212       .dwtag  DW_TAG_member
    3824        .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$11)
    3825        .dwattr $C$DW$212, DW_AT_name("rsvd20")
    3826        .dwattr $C$DW$212, DW_AT_TI_symbol_name("rsvd20")
    3827        .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    3828        .dwattr $C$DW$212, DW_AT_bit_size(0x0c)
    3829        .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3830        .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3831        .dwattr $C$DW$212, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3832        .dwattr $C$DW$212, DW_AT_decl_line(0x8c)
    3833        .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    3834
    3835        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3836        .dwattr $C$DW$T$44, DW_AT_decl_line(0x86)
    3837        .dwattr $C$DW$T$44, DW_AT_decl_column(0x14)
    3838        .dwendtag $C$DW$T$44
    3839
    3840$C$DW$T$93      .dwtag  DW_TAG_volatile_type
    3841        .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    3842
    3843
    3844$C$DW$T$45      .dwtag  DW_TAG_structure_type
    3845        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    3846$C$DW$213       .dwtag  DW_TAG_member
    3847        .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$11)
    3848        .dwattr $C$DW$213, DW_AT_name("PRU0_IMEM_PE")
    3849        .dwattr $C$DW$213, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    3850        .dwattr $C$DW$213, DW_AT_bit_offset(0x1c)
    3851        .dwattr $C$DW$213, DW_AT_bit_size(0x04)
    3852        .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3853        .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3854        .dwattr $C$DW$213, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3855        .dwattr $C$DW$213, DW_AT_decl_line(0x96)
    3856        .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    3857
    3858$C$DW$214       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   72

    3859        .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$11)
    3860        .dwattr $C$DW$214, DW_AT_name("PRU0_DMEM_PE")
    3861        .dwattr $C$DW$214, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    3862        .dwattr $C$DW$214, DW_AT_bit_offset(0x18)
    3863        .dwattr $C$DW$214, DW_AT_bit_size(0x04)
    3864        .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3865        .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3866        .dwattr $C$DW$214, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3867        .dwattr $C$DW$214, DW_AT_decl_line(0x97)
    3868        .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    3869
    3870$C$DW$215       .dwtag  DW_TAG_member
    3871        .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$11)
    3872        .dwattr $C$DW$215, DW_AT_name("PRU1_IMEM_PE")
    3873        .dwattr $C$DW$215, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    3874        .dwattr $C$DW$215, DW_AT_bit_offset(0x14)
    3875        .dwattr $C$DW$215, DW_AT_bit_size(0x04)
    3876        .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3877        .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3878        .dwattr $C$DW$215, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3879        .dwattr $C$DW$215, DW_AT_decl_line(0x98)
    3880        .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    3881
    3882$C$DW$216       .dwtag  DW_TAG_member
    3883        .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$11)
    3884        .dwattr $C$DW$216, DW_AT_name("PRU1_DMEM_PE")
    3885        .dwattr $C$DW$216, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    3886        .dwattr $C$DW$216, DW_AT_bit_offset(0x10)
    3887        .dwattr $C$DW$216, DW_AT_bit_size(0x04)
    3888        .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3889        .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3890        .dwattr $C$DW$216, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3891        .dwattr $C$DW$216, DW_AT_decl_line(0x99)
    3892        .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    3893
    3894$C$DW$217       .dwtag  DW_TAG_member
    3895        .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$11)
    3896        .dwattr $C$DW$217, DW_AT_name("RAM_PE")
    3897        .dwattr $C$DW$217, DW_AT_TI_symbol_name("RAM_PE")
    3898        .dwattr $C$DW$217, DW_AT_bit_offset(0x0c)
    3899        .dwattr $C$DW$217, DW_AT_bit_size(0x04)
    3900        .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3901        .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3902        .dwattr $C$DW$217, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3903        .dwattr $C$DW$217, DW_AT_decl_line(0x9a)
    3904        .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3905
    3906$C$DW$218       .dwtag  DW_TAG_member
    3907        .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$11)
    3908        .dwattr $C$DW$218, DW_AT_name("rsvd20")
    3909        .dwattr $C$DW$218, DW_AT_TI_symbol_name("rsvd20")
    3910        .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    3911        .dwattr $C$DW$218, DW_AT_bit_size(0x0c)
    3912        .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3913        .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   73

    3914        .dwattr $C$DW$218, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3915        .dwattr $C$DW$218, DW_AT_decl_line(0x9b)
    3916        .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    3917
    3918        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    3919        .dwattr $C$DW$T$45, DW_AT_decl_line(0x95)
    3920        .dwattr $C$DW$T$45, DW_AT_decl_column(0x14)
    3921        .dwendtag $C$DW$T$45
    3922
    3923$C$DW$T$95      .dwtag  DW_TAG_volatile_type
    3924        .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$45)
    3925
    3926
    3927$C$DW$T$46      .dwtag  DW_TAG_structure_type
    3928        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    3929$C$DW$219       .dwtag  DW_TAG_member
    3930        .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$11)
    3931        .dwattr $C$DW$219, DW_AT_name("PRU0_IMEM_PE_SET")
    3932        .dwattr $C$DW$219, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    3933        .dwattr $C$DW$219, DW_AT_bit_offset(0x1c)
    3934        .dwattr $C$DW$219, DW_AT_bit_size(0x04)
    3935        .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3936        .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3937        .dwattr $C$DW$219, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3938        .dwattr $C$DW$219, DW_AT_decl_line(0xa4)
    3939        .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    3940
    3941$C$DW$220       .dwtag  DW_TAG_member
    3942        .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$11)
    3943        .dwattr $C$DW$220, DW_AT_name("PRU0_DMEM_PE_SET")
    3944        .dwattr $C$DW$220, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    3945        .dwattr $C$DW$220, DW_AT_bit_offset(0x18)
    3946        .dwattr $C$DW$220, DW_AT_bit_size(0x04)
    3947        .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3948        .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3949        .dwattr $C$DW$220, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3950        .dwattr $C$DW$220, DW_AT_decl_line(0xa5)
    3951        .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3952
    3953$C$DW$221       .dwtag  DW_TAG_member
    3954        .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$11)
    3955        .dwattr $C$DW$221, DW_AT_name("PRU1_IMEM_PE_SET")
    3956        .dwattr $C$DW$221, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    3957        .dwattr $C$DW$221, DW_AT_bit_offset(0x14)
    3958        .dwattr $C$DW$221, DW_AT_bit_size(0x04)
    3959        .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3960        .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3961        .dwattr $C$DW$221, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3962        .dwattr $C$DW$221, DW_AT_decl_line(0xa6)
    3963        .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    3964
    3965$C$DW$222       .dwtag  DW_TAG_member
    3966        .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$11)
    3967        .dwattr $C$DW$222, DW_AT_name("PRU1_DMEM_PE_SET")
    3968        .dwattr $C$DW$222, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   74

    3969        .dwattr $C$DW$222, DW_AT_bit_offset(0x10)
    3970        .dwattr $C$DW$222, DW_AT_bit_size(0x04)
    3971        .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3972        .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3973        .dwattr $C$DW$222, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3974        .dwattr $C$DW$222, DW_AT_decl_line(0xa7)
    3975        .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    3976
    3977$C$DW$223       .dwtag  DW_TAG_member
    3978        .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$11)
    3979        .dwattr $C$DW$223, DW_AT_name("RAM_PE_SET")
    3980        .dwattr $C$DW$223, DW_AT_TI_symbol_name("RAM_PE_SET")
    3981        .dwattr $C$DW$223, DW_AT_bit_offset(0x0c)
    3982        .dwattr $C$DW$223, DW_AT_bit_size(0x04)
    3983        .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3984        .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3985        .dwattr $C$DW$223, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3986        .dwattr $C$DW$223, DW_AT_decl_line(0xa8)
    3987        .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    3988
    3989$C$DW$224       .dwtag  DW_TAG_member
    3990        .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$11)
    3991        .dwattr $C$DW$224, DW_AT_name("rsvd20")
    3992        .dwattr $C$DW$224, DW_AT_TI_symbol_name("rsvd20")
    3993        .dwattr $C$DW$224, DW_AT_bit_offset(0x00)
    3994        .dwattr $C$DW$224, DW_AT_bit_size(0x0c)
    3995        .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3996        .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3997        .dwattr $C$DW$224, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    3998        .dwattr $C$DW$224, DW_AT_decl_line(0xa9)
    3999        .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    4000
    4001        .dwattr $C$DW$T$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    4002        .dwattr $C$DW$T$46, DW_AT_decl_line(0xa3)
    4003        .dwattr $C$DW$T$46, DW_AT_decl_column(0x13)
    4004        .dwendtag $C$DW$T$46
    4005
    4006$C$DW$T$97      .dwtag  DW_TAG_volatile_type
    4007        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$46)
    4008
    4009
    4010$C$DW$T$47      .dwtag  DW_TAG_structure_type
    4011        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    4012$C$DW$225       .dwtag  DW_TAG_member
    4013        .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
    4014        .dwattr $C$DW$225, DW_AT_name("PRU0_IMEM_PE_CLR")
    4015        .dwattr $C$DW$225, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    4016        .dwattr $C$DW$225, DW_AT_bit_offset(0x1c)
    4017        .dwattr $C$DW$225, DW_AT_bit_size(0x04)
    4018        .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019        .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4020        .dwattr $C$DW$225, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4021        .dwattr $C$DW$225, DW_AT_decl_line(0xb3)
    4022        .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    4023
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   75

    4024$C$DW$226       .dwtag  DW_TAG_member
    4025        .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$11)
    4026        .dwattr $C$DW$226, DW_AT_name("PRU0_DMEM_PE_CLR")
    4027        .dwattr $C$DW$226, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    4028        .dwattr $C$DW$226, DW_AT_bit_offset(0x18)
    4029        .dwattr $C$DW$226, DW_AT_bit_size(0x04)
    4030        .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4031        .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4032        .dwattr $C$DW$226, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4033        .dwattr $C$DW$226, DW_AT_decl_line(0xb4)
    4034        .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    4035
    4036$C$DW$227       .dwtag  DW_TAG_member
    4037        .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$11)
    4038        .dwattr $C$DW$227, DW_AT_name("PRU1_IMEM_PE_CLR")
    4039        .dwattr $C$DW$227, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    4040        .dwattr $C$DW$227, DW_AT_bit_offset(0x14)
    4041        .dwattr $C$DW$227, DW_AT_bit_size(0x04)
    4042        .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4043        .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4044        .dwattr $C$DW$227, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4045        .dwattr $C$DW$227, DW_AT_decl_line(0xb5)
    4046        .dwattr $C$DW$227, DW_AT_decl_column(0x0d)
    4047
    4048$C$DW$228       .dwtag  DW_TAG_member
    4049        .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$11)
    4050        .dwattr $C$DW$228, DW_AT_name("PRU1_DMEM_PE_CLR")
    4051        .dwattr $C$DW$228, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    4052        .dwattr $C$DW$228, DW_AT_bit_offset(0x10)
    4053        .dwattr $C$DW$228, DW_AT_bit_size(0x04)
    4054        .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4055        .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4056        .dwattr $C$DW$228, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4057        .dwattr $C$DW$228, DW_AT_decl_line(0xb6)
    4058        .dwattr $C$DW$228, DW_AT_decl_column(0x0d)
    4059
    4060$C$DW$229       .dwtag  DW_TAG_member
    4061        .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$11)
    4062        .dwattr $C$DW$229, DW_AT_name("rsvd16")
    4063        .dwattr $C$DW$229, DW_AT_TI_symbol_name("rsvd16")
    4064        .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    4065        .dwattr $C$DW$229, DW_AT_bit_size(0x10)
    4066        .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4067        .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4068        .dwattr $C$DW$229, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4069        .dwattr $C$DW$229, DW_AT_decl_line(0xb7)
    4070        .dwattr $C$DW$229, DW_AT_decl_column(0x0d)
    4071
    4072        .dwattr $C$DW$T$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    4073        .dwattr $C$DW$T$47, DW_AT_decl_line(0xb2)
    4074        .dwattr $C$DW$T$47, DW_AT_decl_column(0x13)
    4075        .dwendtag $C$DW$T$47
    4076
    4077$C$DW$T$99      .dwtag  DW_TAG_volatile_type
    4078        .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$47)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:35 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_dma.asm                                            PAGE   76

    4079
    4080
    4081$C$DW$T$48      .dwtag  DW_TAG_structure_type
    4082        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    4083$C$DW$230       .dwtag  DW_TAG_member
    4084        .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
    4085        .dwattr $C$DW$230, DW_AT_name("PMAO_PRU0")
    4086        .dwattr $C$DW$230, DW_AT_TI_symbol_name("PMAO_PRU0")
    4087        .dwattr $C$DW$230, DW_AT_bit_offset(0x1f)
    4088        .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    4089        .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4090        .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4091        .dwattr $C$DW$230, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4092        .dwattr $C$DW$230, DW_AT_decl_line(0xc4)
    4093        .dwattr $C$DW$230, DW_AT_decl_column(0x0d)
    4094
    4095$C$DW$231       .dwtag  DW_TAG_member
    4096        .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$11)
    4097        .dwattr $C$DW$231, DW_AT_name("PMAO_PRU1")
    4098        .dwattr $C$DW$231, DW_AT_TI_symbol_name("PMAO_PRU1")
    4099        .dwattr $C$DW$231, DW_AT_bit_offset(0x1e)
    4100        .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    4101        .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4102        .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4103        .dwattr $C$DW$231, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    4104        .dwattr $C$DW$231, DW_AT_decl_line(0xc5)
    4105        .dwattr $C$DW$231, DW_AT_decl_column(0x0d)
    4106
    4107$C$DW$232       .dwtag  DW_TAG_member
