PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:33 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_main.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

    1542 00000330 000000E1002485          SBBO      &r5, r4, 0, 4         ; [ALU_PRU] |242| $O$K7,$O$K5
    1543;* --------------------------------------------------------------------------*
    1544;*   BEGIN LOOP ||$C$L33||
    1545;* --------------------------------------------------------------------------*
    1546 00000334                 ||$C$L33||:    
    1547;***    -----------------------g45:
    1548;***    -----------------------g45:
    1549;*** 207        -----------------------    switch ( (*K$7).arm2pru_req ) {case 1u: goto g46;, case 3u:
    1550        .dwpsn  file "pru1_main.c",line 207,column 3,is_stmt,isa 0
    1551 00000334 000000F1002480          LBBO      &r0, r4, 0, 4         ; [ALU_PRU] |207| $O$K7
    1552 00000338 0000005101E00C          QBEQ      ||$C$L34||, r0, 0x01  ; [ALU_PRU] |207| 
    1553;* --------------------------------------------------------------------------*
    1554 0000033c 0000005703E0FC          QBEQ      ||$C$L32||, r0, 0x03  ; [ALU_PRU] |207| 
    1555;* --------------------------------------------------------------------------*
    1556 00000340 0000005704E04A          QBEQ      ||$C$L1||, r0, 0x04   ; [ALU_PRU] |207| 
    1557;* --------------------------------------------------------------------------*
    1558 00000344 0000005705E0EE          QBEQ      ||$C$L31||, r0, 0x05  ; [ALU_PRU] |207| 
    1559;* --------------------------------------------------------------------------*
    1560 00000348 0000005706E0E6          QBEQ      ||$C$L30||, r0, 0x06  ; [ALU_PRU] |207| 
    1561;* --------------------------------------------------------------------------*
    1562 0000034c 0000005707E0C7          QBEQ      ||$C$L29||, r0, 0x07  ; [ALU_PRU] |207| 
    1563;* --------------------------------------------------------------------------*
    1564 00000350 0000005708E0C3          QBEQ      ||$C$L28||, r0, 0x08  ; [ALU_PRU] |207| 
    1565;* --------------------------------------------------------------------------*
    1566 00000354 0000005709E0BC          QBEQ      ||$C$L25||, r0, 0x09  ; [ALU_PRU] |207| 
    1567;* --------------------------------------------------------------------------*
    1568 00000358 000000570AE0B8          QBEQ      ||$C$L24||, r0, 0x0a  ; [ALU_PRU] |207| 
    1569;* --------------------------------------------------------------------------*
    1570 0000035c 000000570BE0AF          QBEQ      ||$C$L21||, r0, 0x0b  ; [ALU_PRU] |207| 
    1571;* --------------------------------------------------------------------------*
    1572 00000360 000000570CE065          QBEQ      ||$C$L3||, r0, 0x0c   ; [ALU_PRU] |207| 
    1573;* --------------------------------------------------------------------------*
    1574 00000364 00000021000000!         JMP       ||$C$L33||            ; [ALU_PRU] |207| 
    1575;* --------------------------------------------------------------------------*
    1576 00000368                 ||$C$L34||:    
    1577;***    -----------------------g46:
    1578;*** 212        -----------------------    __halt();
    1579;*** 213        -----------------------    goto g45;
    1580        .dwpsn  file "pru1_main.c",line 212,column 4,is_stmt,isa 0
    1581 00000368 0000002A000000          HALT      ; [ALU_PRU] |212| 
    1582        .dwpsn  file "pru1_main.c",line 213,column 4,is_stmt,isa 0
    1583 0000036c 00000021000000!         JMP       ||$C$L33||            ; [ALU_PRU] |213| 
    1584;* --------------------------------------------------------------------------*
    1585        .dwattr $C$DW$34, DW_AT_TI_end_file("pru1_main.c")
    1586        .dwattr $C$DW$34, DW_AT_TI_end_line(0x142)
    1587        .dwattr $C$DW$34, DW_AT_TI_end_column(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   30

    1588        .dwendentry
    1589        .dwendtag $C$DW$34
    1590
    1591;* Inlined function references:
    1592;* [0] state_emulation
    1593;*****************************************************************************
    1594;* UNDEFINED EXTERNAL REFERENCES                                             *
    1595;*****************************************************************************
    1596        .global ||mailbox||
    1597        .global ||buslatches||
    1598        .global ||sm_arb||
    1599        .global ||sm_dma||
    1600        .global ||sm_intr||
    1601        .global ||sm_slave||
    1602        .global ||sm_init||
    1603        .global ||sm_powercycle||
    1604        .global ||buslatches_reset||
    1605        .global ||buslatches_powercycle||
    1606        .global ||sm_slave_start||
    1607        .global ||do_event_initializationsignals||
    1608        .global ||sm_arb_state_idle||
    1609        .global ||sm_arb_start||
    1610        .global ||sm_dma_start||
    1611        .global ||sm_intr_start||
    1612        .global ||sm_init_start||
    1613        .global ||sm_powercycle_start||
    1614        .global ||iopageregisters_init||
    1615        .global ||buslatches_pru0_dataout||
    1616        .global ||buslatches_test||
    1617        .global ||ddrmem_fill_pattern||
    1618
    1619;******************************************************************************
    1620;* TYPE INFORMATION                                                           *
    1621;******************************************************************************
    1622
    1623$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1624        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1625$C$DW$99        .dwtag  DW_TAG_member
    1626        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1627        .dwattr $C$DW$99, DW_AT_name("REVID")
    1628        .dwattr $C$DW$99, DW_AT_TI_symbol_name("REVID")
    1629        .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1630        .dwattr $C$DW$99, DW_AT_bit_size(0x20)
    1631        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1634        .dwattr $C$DW$99, DW_AT_decl_line(0x2d)
    1635        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1636
    1637        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1638        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1639        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1640        .dwendtag $C$DW$T$19
    1641
    1642$C$DW$T$69      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   31

    1643        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$19)
    1644
    1645
    1646$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1647        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1648$C$DW$100       .dwtag  DW_TAG_member
    1649        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1650        .dwattr $C$DW$100, DW_AT_name("IDLE_MODE")
    1651        .dwattr $C$DW$100, DW_AT_TI_symbol_name("IDLE_MODE")
    1652        .dwattr $C$DW$100, DW_AT_bit_offset(0x1e)
    1653        .dwattr $C$DW$100, DW_AT_bit_size(0x02)
    1654        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1656        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1657        .dwattr $C$DW$100, DW_AT_decl_line(0x37)
    1658        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1659
    1660$C$DW$101       .dwtag  DW_TAG_member
    1661        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1662        .dwattr $C$DW$101, DW_AT_name("STANDBY_MODE")
    1663        .dwattr $C$DW$101, DW_AT_TI_symbol_name("STANDBY_MODE")
    1664        .dwattr $C$DW$101, DW_AT_bit_offset(0x1c)
    1665        .dwattr $C$DW$101, DW_AT_bit_size(0x02)
    1666        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1668        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1669        .dwattr $C$DW$101, DW_AT_decl_line(0x38)
    1670        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1671
    1672$C$DW$102       .dwtag  DW_TAG_member
    1673        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1674        .dwattr $C$DW$102, DW_AT_name("STANDBY_INIT")
    1675        .dwattr $C$DW$102, DW_AT_TI_symbol_name("STANDBY_INIT")
    1676        .dwattr $C$DW$102, DW_AT_bit_offset(0x1b)
    1677        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1678        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1680        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1681        .dwattr $C$DW$102, DW_AT_decl_line(0x39)
    1682        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1683
    1684$C$DW$103       .dwtag  DW_TAG_member
    1685        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1686        .dwattr $C$DW$103, DW_AT_name("SUB_MWAIT")
    1687        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SUB_MWAIT")
    1688        .dwattr $C$DW$103, DW_AT_bit_offset(0x1a)
    1689        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1690        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1691        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1692        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1693        .dwattr $C$DW$103, DW_AT_decl_line(0x3a)
    1694        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1695
    1696$C$DW$104       .dwtag  DW_TAG_member
    1697        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   32

    1698        .dwattr $C$DW$104, DW_AT_name("rsvd6")
    1699        .dwattr $C$DW$104, DW_AT_TI_symbol_name("rsvd6")
    1700        .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1701        .dwattr $C$DW$104, DW_AT_bit_size(0x1a)
    1702        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1704        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1705        .dwattr $C$DW$104, DW_AT_decl_line(0x3b)
    1706        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1707
    1708        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1709        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1710        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1711        .dwendtag $C$DW$T$20
    1712
    1713$C$DW$T$71      .dwtag  DW_TAG_volatile_type
    1714        .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$20)
    1715
    1716
    1717$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1718        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1719$C$DW$105       .dwtag  DW_TAG_member
    1720        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1721        .dwattr $C$DW$105, DW_AT_name("PRU0_GPI_MODE")
    1722        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1723        .dwattr $C$DW$105, DW_AT_bit_offset(0x1e)
    1724        .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1725        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1727        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1728        .dwattr $C$DW$105, DW_AT_decl_line(0x45)
    1729        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1730
    1731$C$DW$106       .dwtag  DW_TAG_member
    1732        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1733        .dwattr $C$DW$106, DW_AT_name("PRU0_GPI_CLK_MODE")
    1734        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1735        .dwattr $C$DW$106, DW_AT_bit_offset(0x1d)
    1736        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1737        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1739        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1740        .dwattr $C$DW$106, DW_AT_decl_line(0x46)
    1741        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1742
    1743$C$DW$107       .dwtag  DW_TAG_member
    1744        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1745        .dwattr $C$DW$107, DW_AT_name("PRU0_GPI_DIV0")
    1746        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1747        .dwattr $C$DW$107, DW_AT_bit_offset(0x18)
    1748        .dwattr $C$DW$107, DW_AT_bit_size(0x05)
    1749        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1751        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1752        .dwattr $C$DW$107, DW_AT_decl_line(0x47)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   33

    1753        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1754
    1755$C$DW$108       .dwtag  DW_TAG_member
    1756        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1757        .dwattr $C$DW$108, DW_AT_name("PRU0_GPI_DIV1")
    1758        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1759        .dwattr $C$DW$108, DW_AT_bit_offset(0x13)
    1760        .dwattr $C$DW$108, DW_AT_bit_size(0x05)
    1761        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1764        .dwattr $C$DW$108, DW_AT_decl_line(0x48)
    1765        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1766
    1767$C$DW$109       .dwtag  DW_TAG_member
    1768        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1769        .dwattr $C$DW$109, DW_AT_name("PRU0_GPI_SB")
    1770        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1771        .dwattr $C$DW$109, DW_AT_bit_offset(0x12)
    1772        .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1773        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1775        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1776        .dwattr $C$DW$109, DW_AT_decl_line(0x49)
    1777        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1778
    1779$C$DW$110       .dwtag  DW_TAG_member
    1780        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1781        .dwattr $C$DW$110, DW_AT_name("PRU0_GPO_MODE")
    1782        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1783        .dwattr $C$DW$110, DW_AT_bit_offset(0x11)
    1784        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1785        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1787        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1788        .dwattr $C$DW$110, DW_AT_decl_line(0x4a)
    1789        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1790
    1791$C$DW$111       .dwtag  DW_TAG_member
    1792        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1793        .dwattr $C$DW$111, DW_AT_name("PRU0_GPO_DIV0")
    1794        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1795        .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1796        .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    1797        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1799        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1800        .dwattr $C$DW$111, DW_AT_decl_line(0x4b)
    1801        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1802
    1803$C$DW$112       .dwtag  DW_TAG_member
    1804        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1805        .dwattr $C$DW$112, DW_AT_name("PRU0_GPO_DIV1")
    1806        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1807        .dwattr $C$DW$112, DW_AT_bit_offset(0x07)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   34

    1808        .dwattr $C$DW$112, DW_AT_bit_size(0x05)
    1809        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1811        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1812        .dwattr $C$DW$112, DW_AT_decl_line(0x4c)
    1813        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1814
    1815$C$DW$113       .dwtag  DW_TAG_member
    1816        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1817        .dwattr $C$DW$113, DW_AT_name("PRU0_GPO_SH_SEL")
    1818        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1819        .dwattr $C$DW$113, DW_AT_bit_offset(0x06)
    1820        .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1821        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1823        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1824        .dwattr $C$DW$113, DW_AT_decl_line(0x4d)
    1825        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1826
    1827$C$DW$114       .dwtag  DW_TAG_member
    1828        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1829        .dwattr $C$DW$114, DW_AT_name("rsvd26")
    1830        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd26")
    1831        .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1832        .dwattr $C$DW$114, DW_AT_bit_size(0x06)
    1833        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1835        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1836        .dwattr $C$DW$114, DW_AT_decl_line(0x4e)
    1837        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1838
    1839        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1840        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1841        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1842        .dwendtag $C$DW$T$21
    1843
    1844$C$DW$T$73      .dwtag  DW_TAG_volatile_type
    1845        .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$21)
    1846
    1847
    1848$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1849        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1850$C$DW$115       .dwtag  DW_TAG_member
    1851        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1852        .dwattr $C$DW$115, DW_AT_name("PRU1_GPI_MODE")
    1853        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1854        .dwattr $C$DW$115, DW_AT_bit_offset(0x1e)
    1855        .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    1856        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1858        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1859        .dwattr $C$DW$115, DW_AT_decl_line(0x58)
    1860        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1861
    1862$C$DW$116       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   35

    1863        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1864        .dwattr $C$DW$116, DW_AT_name("PRU1_GPI_CLK_MODE")
    1865        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1866        .dwattr $C$DW$116, DW_AT_bit_offset(0x1d)
    1867        .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1868        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1870        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1871        .dwattr $C$DW$116, DW_AT_decl_line(0x59)
    1872        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1873
    1874$C$DW$117       .dwtag  DW_TAG_member
    1875        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1876        .dwattr $C$DW$117, DW_AT_name("PRU1_GPI_DIV0")
    1877        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1878        .dwattr $C$DW$117, DW_AT_bit_offset(0x18)
    1879        .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    1880        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1882        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1883        .dwattr $C$DW$117, DW_AT_decl_line(0x5a)
    1884        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1885
    1886$C$DW$118       .dwtag  DW_TAG_member
    1887        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1888        .dwattr $C$DW$118, DW_AT_name("PRU1_GPI_DIV1")
    1889        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1890        .dwattr $C$DW$118, DW_AT_bit_offset(0x13)
    1891        .dwattr $C$DW$118, DW_AT_bit_size(0x05)
    1892        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1894        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1895        .dwattr $C$DW$118, DW_AT_decl_line(0x5b)
    1896        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1897
    1898$C$DW$119       .dwtag  DW_TAG_member
    1899        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1900        .dwattr $C$DW$119, DW_AT_name("PRU1_GPI_SB")
    1901        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1902        .dwattr $C$DW$119, DW_AT_bit_offset(0x12)
    1903        .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1904        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1906        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1907        .dwattr $C$DW$119, DW_AT_decl_line(0x5c)
    1908        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1909
    1910$C$DW$120       .dwtag  DW_TAG_member
    1911        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1912        .dwattr $C$DW$120, DW_AT_name("PRU1_GPO_MODE")
    1913        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1914        .dwattr $C$DW$120, DW_AT_bit_offset(0x11)
    1915        .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1916        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   36

    1918        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1919        .dwattr $C$DW$120, DW_AT_decl_line(0x5d)
    1920        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1921
    1922$C$DW$121       .dwtag  DW_TAG_member
    1923        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1924        .dwattr $C$DW$121, DW_AT_name("PRU1_GPO_DIV0")
    1925        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1926        .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1927        .dwattr $C$DW$121, DW_AT_bit_size(0x05)
    1928        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1930        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1931        .dwattr $C$DW$121, DW_AT_decl_line(0x5e)
    1932        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1933
    1934$C$DW$122       .dwtag  DW_TAG_member
    1935        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1936        .dwattr $C$DW$122, DW_AT_name("PRU1_GPO_DIV1")
    1937        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1938        .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    1939        .dwattr $C$DW$122, DW_AT_bit_size(0x05)
    1940        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1942        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1943        .dwattr $C$DW$122, DW_AT_decl_line(0x5f)
    1944        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1945
    1946$C$DW$123       .dwtag  DW_TAG_member
    1947        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1948        .dwattr $C$DW$123, DW_AT_name("PRU1_GPO_SH_SEL")
    1949        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1950        .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    1951        .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1952        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1954        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1955        .dwattr $C$DW$123, DW_AT_decl_line(0x60)
    1956        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1957
    1958$C$DW$124       .dwtag  DW_TAG_member
    1959        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1960        .dwattr $C$DW$124, DW_AT_name("rsvd26")
    1961        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd26")
    1962        .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1963        .dwattr $C$DW$124, DW_AT_bit_size(0x06)
    1964        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1966        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1967        .dwattr $C$DW$124, DW_AT_decl_line(0x61)
    1968        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1969
    1970        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1971        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1972        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   37

    1973        .dwendtag $C$DW$T$22
    1974
    1975$C$DW$T$75      .dwtag  DW_TAG_volatile_type
    1976        .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$22)
    1977
    1978
    1979$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1980        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1981$C$DW$125       .dwtag  DW_TAG_member
    1982        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1983        .dwattr $C$DW$125, DW_AT_name("PRU0_CLK_STOP_REQ")
    1984        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1985        .dwattr $C$DW$125, DW_AT_bit_offset(0x1f)
    1986        .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1987        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1989        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1990        .dwattr $C$DW$125, DW_AT_decl_line(0x6b)
    1991        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1992
    1993$C$DW$126       .dwtag  DW_TAG_member
    1994        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1995        .dwattr $C$DW$126, DW_AT_name("PRU0_CLK_STOP_ACK")
    1996        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1997        .dwattr $C$DW$126, DW_AT_bit_offset(0x1e)
    1998        .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1999        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2001        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2002        .dwattr $C$DW$126, DW_AT_decl_line(0x6c)
    2003        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2004
    2005$C$DW$127       .dwtag  DW_TAG_member
    2006        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2007        .dwattr $C$DW$127, DW_AT_name("PRU0_CLK_EN")
    2008        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    2009        .dwattr $C$DW$127, DW_AT_bit_offset(0x1d)
    2010        .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2011        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2014        .dwattr $C$DW$127, DW_AT_decl_line(0x6d)
    2015        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2016
    2017$C$DW$128       .dwtag  DW_TAG_member
    2018        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2019        .dwattr $C$DW$128, DW_AT_name("PRU1_CLK_STOP_REQ")
    2020        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    2021        .dwattr $C$DW$128, DW_AT_bit_offset(0x1c)
    2022        .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2023        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2025        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2026        .dwattr $C$DW$128, DW_AT_decl_line(0x6e)
    2027        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   38

    2028
    2029$C$DW$129       .dwtag  DW_TAG_member
    2030        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2031        .dwattr $C$DW$129, DW_AT_name("PRU1_CLK_STOP_ACK")
    2032        .dwattr $C$DW$129, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    2033        .dwattr $C$DW$129, DW_AT_bit_offset(0x1b)
    2034        .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2035        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2036        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2037        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2038        .dwattr $C$DW$129, DW_AT_decl_line(0x6f)
    2039        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2040
    2041$C$DW$130       .dwtag  DW_TAG_member
    2042        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2043        .dwattr $C$DW$130, DW_AT_name("PRU1_CLK_EN")
    2044        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    2045        .dwattr $C$DW$130, DW_AT_bit_offset(0x1a)
    2046        .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2047        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2049        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2050        .dwattr $C$DW$130, DW_AT_decl_line(0x70)
    2051        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2052
    2053$C$DW$131       .dwtag  DW_TAG_member
    2054        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2055        .dwattr $C$DW$131, DW_AT_name("INTC_CLK_STOP_REQ")
    2056        .dwattr $C$DW$131, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    2057        .dwattr $C$DW$131, DW_AT_bit_offset(0x19)
    2058        .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2059        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2061        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2062        .dwattr $C$DW$131, DW_AT_decl_line(0x71)
    2063        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2064
    2065$C$DW$132       .dwtag  DW_TAG_member
    2066        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2067        .dwattr $C$DW$132, DW_AT_name("INTC_CLK_STOP_ACK")
    2068        .dwattr $C$DW$132, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    2069        .dwattr $C$DW$132, DW_AT_bit_offset(0x18)
    2070        .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2071        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2073        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2074        .dwattr $C$DW$132, DW_AT_decl_line(0x72)
    2075        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2076
    2077$C$DW$133       .dwtag  DW_TAG_member
    2078        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2079        .dwattr $C$DW$133, DW_AT_name("INTC_CLK_EN")
    2080        .dwattr $C$DW$133, DW_AT_TI_symbol_name("INTC_CLK_EN")
    2081        .dwattr $C$DW$133, DW_AT_bit_offset(0x17)
    2082        .dwattr $C$DW$133, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   39

    2083        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2085        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2086        .dwattr $C$DW$133, DW_AT_decl_line(0x73)
    2087        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2088
    2089$C$DW$134       .dwtag  DW_TAG_member
    2090        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2091        .dwattr $C$DW$134, DW_AT_name("UART_CLK_STOP_REQ")
    2092        .dwattr $C$DW$134, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    2093        .dwattr $C$DW$134, DW_AT_bit_offset(0x16)
    2094        .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2095        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2097        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2098        .dwattr $C$DW$134, DW_AT_decl_line(0x74)
    2099        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2100
    2101$C$DW$135       .dwtag  DW_TAG_member
    2102        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2103        .dwattr $C$DW$135, DW_AT_name("UART_CLK_STOP_ACK")
    2104        .dwattr $C$DW$135, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    2105        .dwattr $C$DW$135, DW_AT_bit_offset(0x15)
    2106        .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2107        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2109        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2110        .dwattr $C$DW$135, DW_AT_decl_line(0x75)
    2111        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2112
    2113$C$DW$136       .dwtag  DW_TAG_member
    2114        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2115        .dwattr $C$DW$136, DW_AT_name("UART_CLK_EN")
    2116        .dwattr $C$DW$136, DW_AT_TI_symbol_name("UART_CLK_EN")
    2117        .dwattr $C$DW$136, DW_AT_bit_offset(0x14)
    2118        .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2119        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2121        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2122        .dwattr $C$DW$136, DW_AT_decl_line(0x76)
    2123        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2124
    2125$C$DW$137       .dwtag  DW_TAG_member
    2126        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2127        .dwattr $C$DW$137, DW_AT_name("ECAP_CLK_STOP_REQ")
    2128        .dwattr $C$DW$137, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    2129        .dwattr $C$DW$137, DW_AT_bit_offset(0x13)
    2130        .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2131        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2133        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2134        .dwattr $C$DW$137, DW_AT_decl_line(0x77)
    2135        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2136
    2137$C$DW$138       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   40

    2138        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2139        .dwattr $C$DW$138, DW_AT_name("ECAP_CLK_STOP_ACK")
    2140        .dwattr $C$DW$138, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    2141        .dwattr $C$DW$138, DW_AT_bit_offset(0x12)
    2142        .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2143        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2145        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2146        .dwattr $C$DW$138, DW_AT_decl_line(0x78)
    2147        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2148
    2149$C$DW$139       .dwtag  DW_TAG_member
    2150        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2151        .dwattr $C$DW$139, DW_AT_name("ECAP_CLK_EN")
    2152        .dwattr $C$DW$139, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    2153        .dwattr $C$DW$139, DW_AT_bit_offset(0x11)
    2154        .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2155        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2157        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2158        .dwattr $C$DW$139, DW_AT_decl_line(0x79)
    2159        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2160
    2161$C$DW$140       .dwtag  DW_TAG_member
    2162        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2163        .dwattr $C$DW$140, DW_AT_name("IEP_CLK_STOP_REQ")
    2164        .dwattr $C$DW$140, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    2165        .dwattr $C$DW$140, DW_AT_bit_offset(0x10)
    2166        .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2167        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2169        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2170        .dwattr $C$DW$140, DW_AT_decl_line(0x7a)
    2171        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2172
    2173$C$DW$141       .dwtag  DW_TAG_member
    2174        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    2175        .dwattr $C$DW$141, DW_AT_name("IEP_CLK_STOP_ACK")
    2176        .dwattr $C$DW$141, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    2177        .dwattr $C$DW$141, DW_AT_bit_offset(0x0f)
    2178        .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2179        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2181        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2182        .dwattr $C$DW$141, DW_AT_decl_line(0x7b)
    2183        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2184
    2185$C$DW$142       .dwtag  DW_TAG_member
    2186        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    2187        .dwattr $C$DW$142, DW_AT_name("IEP_CLK_EN")
    2188        .dwattr $C$DW$142, DW_AT_TI_symbol_name("IEP_CLK_EN")
    2189        .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    2190        .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2191        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   41

    2193        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2194        .dwattr $C$DW$142, DW_AT_decl_line(0x7c)
    2195        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2196
    2197$C$DW$143       .dwtag  DW_TAG_member
    2198        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    2199        .dwattr $C$DW$143, DW_AT_name("rsvd18")
    2200        .dwattr $C$DW$143, DW_AT_TI_symbol_name("rsvd18")
    2201        .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2202        .dwattr $C$DW$143, DW_AT_bit_size(0x0e)
    2203        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2205        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2206        .dwattr $C$DW$143, DW_AT_decl_line(0x7d)
    2207        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2208
    2209        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2210        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    2211        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    2212        .dwendtag $C$DW$T$23
    2213
    2214$C$DW$T$77      .dwtag  DW_TAG_volatile_type
    2215        .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$23)
    2216
    2217
    2218$C$DW$T$24      .dwtag  DW_TAG_structure_type
    2219        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    2220$C$DW$144       .dwtag  DW_TAG_member
    2221        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    2222        .dwattr $C$DW$144, DW_AT_name("PRU0_IMEM_PE_RAW")
    2223        .dwattr $C$DW$144, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    2224        .dwattr $C$DW$144, DW_AT_bit_offset(0x1c)
    2225        .dwattr $C$DW$144, DW_AT_bit_size(0x04)
    2226        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2228        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2229        .dwattr $C$DW$144, DW_AT_decl_line(0x87)
    2230        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    2231
    2232$C$DW$145       .dwtag  DW_TAG_member
    2233        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    2234        .dwattr $C$DW$145, DW_AT_name("PRU0_DMEM_PE_RAW")
    2235        .dwattr $C$DW$145, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    2236        .dwattr $C$DW$145, DW_AT_bit_offset(0x18)
    2237        .dwattr $C$DW$145, DW_AT_bit_size(0x04)
    2238        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2240        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2241        .dwattr $C$DW$145, DW_AT_decl_line(0x88)
    2242        .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    2243
    2244$C$DW$146       .dwtag  DW_TAG_member
    2245        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    2246        .dwattr $C$DW$146, DW_AT_name("PRU1_IMEM_PE_RAW")
    2247        .dwattr $C$DW$146, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   42

    2248        .dwattr $C$DW$146, DW_AT_bit_offset(0x14)
    2249        .dwattr $C$DW$146, DW_AT_bit_size(0x04)
    2250        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2252        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2253        .dwattr $C$DW$146, DW_AT_decl_line(0x89)
    2254        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2255
    2256$C$DW$147       .dwtag  DW_TAG_member
    2257        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    2258        .dwattr $C$DW$147, DW_AT_name("PRU1_DMEM_PE_RAW")
    2259        .dwattr $C$DW$147, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    2260        .dwattr $C$DW$147, DW_AT_bit_offset(0x10)
    2261        .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    2262        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2264        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2265        .dwattr $C$DW$147, DW_AT_decl_line(0x8a)
    2266        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    2267
    2268$C$DW$148       .dwtag  DW_TAG_member
    2269        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    2270        .dwattr $C$DW$148, DW_AT_name("RAM_PE_RAW")
    2271        .dwattr $C$DW$148, DW_AT_TI_symbol_name("RAM_PE_RAW")
    2272        .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    2273        .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    2274        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2276        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2277        .dwattr $C$DW$148, DW_AT_decl_line(0x8b)
    2278        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    2279
    2280$C$DW$149       .dwtag  DW_TAG_member
    2281        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    2282        .dwattr $C$DW$149, DW_AT_name("rsvd20")
    2283        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd20")
    2284        .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2285        .dwattr $C$DW$149, DW_AT_bit_size(0x0c)
    2286        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2288        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2289        .dwattr $C$DW$149, DW_AT_decl_line(0x8c)
    2290        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2291
    2292        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2293        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    2294        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    2295        .dwendtag $C$DW$T$24
    2296
    2297$C$DW$T$79      .dwtag  DW_TAG_volatile_type
    2298        .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$24)
    2299
    2300
    2301$C$DW$T$25      .dwtag  DW_TAG_structure_type
    2302        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   43

    2303$C$DW$150       .dwtag  DW_TAG_member
    2304        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
    2305        .dwattr $C$DW$150, DW_AT_name("PRU0_IMEM_PE")
    2306        .dwattr $C$DW$150, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    2307        .dwattr $C$DW$150, DW_AT_bit_offset(0x1c)
    2308        .dwattr $C$DW$150, DW_AT_bit_size(0x04)
    2309        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2311        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2312        .dwattr $C$DW$150, DW_AT_decl_line(0x96)
    2313        .dwattr $C$DW$150, DW_AT_decl_column(0x0d)
    2314
    2315$C$DW$151       .dwtag  DW_TAG_member
    2316        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2317        .dwattr $C$DW$151, DW_AT_name("PRU0_DMEM_PE")
    2318        .dwattr $C$DW$151, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    2319        .dwattr $C$DW$151, DW_AT_bit_offset(0x18)
    2320        .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    2321        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2323        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2324        .dwattr $C$DW$151, DW_AT_decl_line(0x97)
    2325        .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2326
    2327$C$DW$152       .dwtag  DW_TAG_member
    2328        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
    2329        .dwattr $C$DW$152, DW_AT_name("PRU1_IMEM_PE")
    2330        .dwattr $C$DW$152, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    2331        .dwattr $C$DW$152, DW_AT_bit_offset(0x14)
    2332        .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    2333        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2335        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2336        .dwattr $C$DW$152, DW_AT_decl_line(0x98)
    2337        .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2338
    2339$C$DW$153       .dwtag  DW_TAG_member
    2340        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    2341        .dwattr $C$DW$153, DW_AT_name("PRU1_DMEM_PE")
    2342        .dwattr $C$DW$153, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    2343        .dwattr $C$DW$153, DW_AT_bit_offset(0x10)
    2344        .dwattr $C$DW$153, DW_AT_bit_size(0x04)
    2345        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2347        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2348        .dwattr $C$DW$153, DW_AT_decl_line(0x99)
    2349        .dwattr $C$DW$153, DW_AT_decl_column(0x0d)
    2350
    2351$C$DW$154       .dwtag  DW_TAG_member
    2352        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
    2353        .dwattr $C$DW$154, DW_AT_name("RAM_PE")
    2354        .dwattr $C$DW$154, DW_AT_TI_symbol_name("RAM_PE")
    2355        .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    2356        .dwattr $C$DW$154, DW_AT_bit_size(0x04)
    2357        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   44

    2358        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2359        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2360        .dwattr $C$DW$154, DW_AT_decl_line(0x9a)
    2361        .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2362
    2363$C$DW$155       .dwtag  DW_TAG_member
    2364        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
    2365        .dwattr $C$DW$155, DW_AT_name("rsvd20")
    2366        .dwattr $C$DW$155, DW_AT_TI_symbol_name("rsvd20")
    2367        .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2368        .dwattr $C$DW$155, DW_AT_bit_size(0x0c)
    2369        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2370        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2371        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2372        .dwattr $C$DW$155, DW_AT_decl_line(0x9b)
    2373        .dwattr $C$DW$155, DW_AT_decl_column(0x0d)
    2374
    2375        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2376        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    2377        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    2378        .dwendtag $C$DW$T$25
    2379
    2380$C$DW$T$81      .dwtag  DW_TAG_volatile_type
    2381        .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$25)
    2382
    2383
    2384$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2385        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2386$C$DW$156       .dwtag  DW_TAG_member
    2387        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2388        .dwattr $C$DW$156, DW_AT_name("PRU0_IMEM_PE_SET")
    2389        .dwattr $C$DW$156, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    2390        .dwattr $C$DW$156, DW_AT_bit_offset(0x1c)
    2391        .dwattr $C$DW$156, DW_AT_bit_size(0x04)
    2392        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2394        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2395        .dwattr $C$DW$156, DW_AT_decl_line(0xa4)
    2396        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2397
    2398$C$DW$157       .dwtag  DW_TAG_member
    2399        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2400        .dwattr $C$DW$157, DW_AT_name("PRU0_DMEM_PE_SET")
    2401        .dwattr $C$DW$157, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    2402        .dwattr $C$DW$157, DW_AT_bit_offset(0x18)
    2403        .dwattr $C$DW$157, DW_AT_bit_size(0x04)
    2404        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2406        .dwattr $C$DW$157, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2407        .dwattr $C$DW$157, DW_AT_decl_line(0xa5)
    2408        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2409
    2410$C$DW$158       .dwtag  DW_TAG_member
    2411        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2412        .dwattr $C$DW$158, DW_AT_name("PRU1_IMEM_PE_SET")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   45

    2413        .dwattr $C$DW$158, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2414        .dwattr $C$DW$158, DW_AT_bit_offset(0x14)
    2415        .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2416        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2418        .dwattr $C$DW$158, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2419        .dwattr $C$DW$158, DW_AT_decl_line(0xa6)
    2420        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2421
    2422$C$DW$159       .dwtag  DW_TAG_member
    2423        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2424        .dwattr $C$DW$159, DW_AT_name("PRU1_DMEM_PE_SET")
    2425        .dwattr $C$DW$159, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2426        .dwattr $C$DW$159, DW_AT_bit_offset(0x10)
    2427        .dwattr $C$DW$159, DW_AT_bit_size(0x04)
    2428        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2429        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2430        .dwattr $C$DW$159, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2431        .dwattr $C$DW$159, DW_AT_decl_line(0xa7)
    2432        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2433
    2434$C$DW$160       .dwtag  DW_TAG_member
    2435        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2436        .dwattr $C$DW$160, DW_AT_name("RAM_PE_SET")
    2437        .dwattr $C$DW$160, DW_AT_TI_symbol_name("RAM_PE_SET")
    2438        .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2439        .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    2440        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2442        .dwattr $C$DW$160, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2443        .dwattr $C$DW$160, DW_AT_decl_line(0xa8)
    2444        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2445
    2446$C$DW$161       .dwtag  DW_TAG_member
    2447        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2448        .dwattr $C$DW$161, DW_AT_name("rsvd20")
    2449        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd20")
    2450        .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2451        .dwattr $C$DW$161, DW_AT_bit_size(0x0c)
    2452        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2454        .dwattr $C$DW$161, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2455        .dwattr $C$DW$161, DW_AT_decl_line(0xa9)
    2456        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2457
    2458        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2459        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2460        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2461        .dwendtag $C$DW$T$26
    2462
    2463$C$DW$T$83      .dwtag  DW_TAG_volatile_type
    2464        .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$26)
    2465
    2466
    2467$C$DW$T$27      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   46

    2468        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2469$C$DW$162       .dwtag  DW_TAG_member
    2470        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2471        .dwattr $C$DW$162, DW_AT_name("PRU0_IMEM_PE_CLR")
    2472        .dwattr $C$DW$162, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2473        .dwattr $C$DW$162, DW_AT_bit_offset(0x1c)
    2474        .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2475        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2476        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2477        .dwattr $C$DW$162, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2478        .dwattr $C$DW$162, DW_AT_decl_line(0xb3)
    2479        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2480
    2481$C$DW$163       .dwtag  DW_TAG_member
    2482        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2483        .dwattr $C$DW$163, DW_AT_name("PRU0_DMEM_PE_CLR")
    2484        .dwattr $C$DW$163, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2485        .dwattr $C$DW$163, DW_AT_bit_offset(0x18)
    2486        .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2487        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2489        .dwattr $C$DW$163, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2490        .dwattr $C$DW$163, DW_AT_decl_line(0xb4)
    2491        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2492
    2493$C$DW$164       .dwtag  DW_TAG_member
    2494        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2495        .dwattr $C$DW$164, DW_AT_name("PRU1_IMEM_PE_CLR")
    2496        .dwattr $C$DW$164, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2497        .dwattr $C$DW$164, DW_AT_bit_offset(0x14)
    2498        .dwattr $C$DW$164, DW_AT_bit_size(0x04)
    2499        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2501        .dwattr $C$DW$164, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2502        .dwattr $C$DW$164, DW_AT_decl_line(0xb5)
    2503        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2504
    2505$C$DW$165       .dwtag  DW_TAG_member
    2506        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2507        .dwattr $C$DW$165, DW_AT_name("PRU1_DMEM_PE_CLR")
    2508        .dwattr $C$DW$165, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2509        .dwattr $C$DW$165, DW_AT_bit_offset(0x10)
    2510        .dwattr $C$DW$165, DW_AT_bit_size(0x04)
    2511        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2513        .dwattr $C$DW$165, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2514        .dwattr $C$DW$165, DW_AT_decl_line(0xb6)
    2515        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2516
    2517$C$DW$166       .dwtag  DW_TAG_member
    2518        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2519        .dwattr $C$DW$166, DW_AT_name("rsvd16")
    2520        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd16")
    2521        .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2522        .dwattr $C$DW$166, DW_AT_bit_size(0x10)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   47

    2523        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2525        .dwattr $C$DW$166, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2526        .dwattr $C$DW$166, DW_AT_decl_line(0xb7)
    2527        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2528
    2529        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2530        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2531        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2532        .dwendtag $C$DW$T$27
    2533
    2534$C$DW$T$85      .dwtag  DW_TAG_volatile_type
    2535        .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$27)
    2536
    2537
    2538$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2539        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2540$C$DW$167       .dwtag  DW_TAG_member
    2541        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2542        .dwattr $C$DW$167, DW_AT_name("PMAO_PRU0")
    2543        .dwattr $C$DW$167, DW_AT_TI_symbol_name("PMAO_PRU0")
    2544        .dwattr $C$DW$167, DW_AT_bit_offset(0x1f)
    2545        .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2546        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2548        .dwattr $C$DW$167, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2549        .dwattr $C$DW$167, DW_AT_decl_line(0xc4)
    2550        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2551
    2552$C$DW$168       .dwtag  DW_TAG_member
    2553        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2554        .dwattr $C$DW$168, DW_AT_name("PMAO_PRU1")
    2555        .dwattr $C$DW$168, DW_AT_TI_symbol_name("PMAO_PRU1")
    2556        .dwattr $C$DW$168, DW_AT_bit_offset(0x1e)
    2557        .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2558        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2559        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2560        .dwattr $C$DW$168, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2561        .dwattr $C$DW$168, DW_AT_decl_line(0xc5)
    2562        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2563
    2564$C$DW$169       .dwtag  DW_TAG_member
    2565        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2566        .dwattr $C$DW$169, DW_AT_name("rsvd2")
    2567        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd2")
    2568        .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2569        .dwattr $C$DW$169, DW_AT_bit_size(0x1e)
    2570        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2572        .dwattr $C$DW$169, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2573        .dwattr $C$DW$169, DW_AT_decl_line(0xc6)
    2574        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2575
    2576        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2577        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   48

    2578        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2579        .dwendtag $C$DW$T$28
    2580
    2581$C$DW$T$87      .dwtag  DW_TAG_volatile_type
    2582        .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$28)
    2583
    2584
    2585$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2586        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2587$C$DW$170       .dwtag  DW_TAG_member
    2588        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2589        .dwattr $C$DW$170, DW_AT_name("OCP_EN")
    2590        .dwattr $C$DW$170, DW_AT_TI_symbol_name("OCP_EN")
    2591        .dwattr $C$DW$170, DW_AT_bit_offset(0x1f)
    2592        .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2593        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2595        .dwattr $C$DW$170, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2596        .dwattr $C$DW$170, DW_AT_decl_line(0xd3)
    2597        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2598
    2599$C$DW$171       .dwtag  DW_TAG_member
    2600        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    2601        .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2602        .dwattr $C$DW$171, DW_AT_TI_symbol_name("rsvd1")
    2603        .dwattr $C$DW$171, DW_AT_bit_offset(0x00)
    2604        .dwattr $C$DW$171, DW_AT_bit_size(0x1f)
    2605        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2607        .dwattr $C$DW$171, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2608        .dwattr $C$DW$171, DW_AT_decl_line(0xd4)
    2609        .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2610
    2611        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2612        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2613        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2614        .dwendtag $C$DW$T$29
    2615
    2616$C$DW$T$89      .dwtag  DW_TAG_volatile_type
    2617        .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$29)
    2618
    2619
    2620$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2621        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2622$C$DW$172       .dwtag  DW_TAG_member
    2623        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$11)
    2624        .dwattr $C$DW$172, DW_AT_name("PRU1_PAD_HP_EN")
    2625        .dwattr $C$DW$172, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2626        .dwattr $C$DW$172, DW_AT_bit_offset(0x1f)
    2627        .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2628        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2630        .dwattr $C$DW$172, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2631        .dwattr $C$DW$172, DW_AT_decl_line(0xde)
    2632        .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   49

    2633
    2634$C$DW$173       .dwtag  DW_TAG_member
    2635        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$11)
    2636        .dwattr $C$DW$173, DW_AT_name("XFR_SHIFT_EN")
    2637        .dwattr $C$DW$173, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2638        .dwattr $C$DW$173, DW_AT_bit_offset(0x1e)
    2639        .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2640        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2642        .dwattr $C$DW$173, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2643        .dwattr $C$DW$173, DW_AT_decl_line(0xdf)
    2644        .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2645
    2646$C$DW$174       .dwtag  DW_TAG_member
    2647        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
    2648        .dwattr $C$DW$174, DW_AT_name("rsvd2")
    2649        .dwattr $C$DW$174, DW_AT_TI_symbol_name("rsvd2")
    2650        .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2651        .dwattr $C$DW$174, DW_AT_bit_size(0x1e)
    2652        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2653        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2654        .dwattr $C$DW$174, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2655        .dwattr $C$DW$174, DW_AT_decl_line(0xe0)
    2656        .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2657
    2658        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2659        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2660        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2661        .dwendtag $C$DW$T$30
    2662
    2663$C$DW$T$91      .dwtag  DW_TAG_volatile_type
    2664        .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$30)
    2665
    2666
    2667$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2668        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2669$C$DW$175       .dwtag  DW_TAG_member
    2670        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
    2671        .dwattr $C$DW$175, DW_AT_name("PIN_MUX_SEL")
    2672        .dwattr $C$DW$175, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2673        .dwattr $C$DW$175, DW_AT_bit_offset(0x18)
    2674        .dwattr $C$DW$175, DW_AT_bit_size(0x08)
    2675        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2677        .dwattr $C$DW$175, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2678        .dwattr $C$DW$175, DW_AT_decl_line(0xec)
    2679        .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2680
    2681$C$DW$176       .dwtag  DW_TAG_member
    2682        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
    2683        .dwattr $C$DW$176, DW_AT_name("rsvd2")
    2684        .dwattr $C$DW$176, DW_AT_TI_symbol_name("rsvd2")
    2685        .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2686        .dwattr $C$DW$176, DW_AT_bit_size(0x18)
    2687        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   50

    2688        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2689        .dwattr $C$DW$176, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2690        .dwattr $C$DW$176, DW_AT_decl_line(0xed)
    2691        .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2692
    2693        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2694        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2695        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2696        .dwendtag $C$DW$T$31
    2697
    2698$C$DW$T$93      .dwtag  DW_TAG_volatile_type
    2699        .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$31)
    2700
    2701
    2702$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2703        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2704$C$DW$177       .dwtag  DW_TAG_member
    2705        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$70)
    2706        .dwattr $C$DW$177, DW_AT_name("$P$T0")
    2707        .dwattr $C$DW$177, DW_AT_TI_symbol_name("$P$T0")
    2708        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2709        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2710        .dwattr $C$DW$177, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2711        .dwattr $C$DW$177, DW_AT_decl_line(0x29)
    2712        .dwattr $C$DW$177, DW_AT_decl_column(0x02)
    2713
    2714$C$DW$178       .dwtag  DW_TAG_member
    2715        .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$72)
    2716        .dwattr $C$DW$178, DW_AT_name("$P$T1")
    2717        .dwattr $C$DW$178, DW_AT_TI_symbol_name("$P$T1")
    2718        .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2719        .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2720        .dwattr $C$DW$178, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2721        .dwattr $C$DW$178, DW_AT_decl_line(0x33)
    2722        .dwattr $C$DW$178, DW_AT_decl_column(0x02)
    2723
    2724$C$DW$179       .dwtag  DW_TAG_member
    2725        .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$74)
    2726        .dwattr $C$DW$179, DW_AT_name("$P$T2")
    2727        .dwattr $C$DW$179, DW_AT_TI_symbol_name("$P$T2")
    2728        .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2729        .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2730        .dwattr $C$DW$179, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2731        .dwattr $C$DW$179, DW_AT_decl_line(0x41)
    2732        .dwattr $C$DW$179, DW_AT_decl_column(0x02)
    2733
    2734$C$DW$180       .dwtag  DW_TAG_member
    2735        .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$76)
    2736        .dwattr $C$DW$180, DW_AT_name("$P$T3")
    2737        .dwattr $C$DW$180, DW_AT_TI_symbol_name("$P$T3")
    2738        .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2739        .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2740        .dwattr $C$DW$180, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2741        .dwattr $C$DW$180, DW_AT_decl_line(0x54)
    2742        .dwattr $C$DW$180, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   51

    2743
    2744$C$DW$181       .dwtag  DW_TAG_member
    2745        .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$78)
    2746        .dwattr $C$DW$181, DW_AT_name("$P$T4")
    2747        .dwattr $C$DW$181, DW_AT_TI_symbol_name("$P$T4")
    2748        .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2749        .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2750        .dwattr $C$DW$181, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2751        .dwattr $C$DW$181, DW_AT_decl_line(0x67)
    2752        .dwattr $C$DW$181, DW_AT_decl_column(0x02)
    2753
    2754$C$DW$182       .dwtag  DW_TAG_member
    2755        .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$80)
    2756        .dwattr $C$DW$182, DW_AT_name("$P$T5")
    2757        .dwattr $C$DW$182, DW_AT_TI_symbol_name("$P$T5")
    2758        .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2759        .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2760        .dwattr $C$DW$182, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2761        .dwattr $C$DW$182, DW_AT_decl_line(0x83)
    2762        .dwattr $C$DW$182, DW_AT_decl_column(0x02)
    2763
    2764$C$DW$183       .dwtag  DW_TAG_member
    2765        .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$82)
    2766        .dwattr $C$DW$183, DW_AT_name("$P$T6")
    2767        .dwattr $C$DW$183, DW_AT_TI_symbol_name("$P$T6")
    2768        .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2769        .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2770        .dwattr $C$DW$183, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2771        .dwattr $C$DW$183, DW_AT_decl_line(0x92)
    2772        .dwattr $C$DW$183, DW_AT_decl_column(0x02)
    2773
    2774$C$DW$184       .dwtag  DW_TAG_member
    2775        .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$84)
    2776        .dwattr $C$DW$184, DW_AT_name("$P$T7")
    2777        .dwattr $C$DW$184, DW_AT_TI_symbol_name("$P$T7")
    2778        .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2779        .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2780        .dwattr $C$DW$184, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2781        .dwattr $C$DW$184, DW_AT_decl_line(0xa0)
    2782        .dwattr $C$DW$184, DW_AT_decl_column(0x02)
    2783
    2784$C$DW$185       .dwtag  DW_TAG_member
    2785        .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$86)
    2786        .dwattr $C$DW$185, DW_AT_name("$P$T8")
    2787        .dwattr $C$DW$185, DW_AT_TI_symbol_name("$P$T8")
    2788        .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2789        .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2790        .dwattr $C$DW$185, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2791        .dwattr $C$DW$185, DW_AT_decl_line(0xaf)
    2792        .dwattr $C$DW$185, DW_AT_decl_column(0x02)
    2793
    2794$C$DW$186       .dwtag  DW_TAG_member
    2795        .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2796        .dwattr $C$DW$186, DW_AT_name("rsvd24")
    2797        .dwattr $C$DW$186, DW_AT_TI_symbol_name("rsvd24")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   52

    2798        .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2799        .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2800        .dwattr $C$DW$186, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2801        .dwattr $C$DW$186, DW_AT_decl_line(0xbc)
    2802        .dwattr $C$DW$186, DW_AT_decl_column(0x0b)
    2803
    2804$C$DW$187       .dwtag  DW_TAG_member
    2805        .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$88)
    2806        .dwattr $C$DW$187, DW_AT_name("$P$T9")
    2807        .dwattr $C$DW$187, DW_AT_TI_symbol_name("$P$T9")
    2808        .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2809        .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2810        .dwattr $C$DW$187, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2811        .dwattr $C$DW$187, DW_AT_decl_line(0xc0)
    2812        .dwattr $C$DW$187, DW_AT_decl_column(0x02)
    2813
    2814$C$DW$188       .dwtag  DW_TAG_member
    2815        .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$33)
    2816        .dwattr $C$DW$188, DW_AT_name("rsvd2c")
    2817        .dwattr $C$DW$188, DW_AT_TI_symbol_name("rsvd2c")
    2818        .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2819        .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2820        .dwattr $C$DW$188, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2821        .dwattr $C$DW$188, DW_AT_decl_line(0xcb)
    2822        .dwattr $C$DW$188, DW_AT_decl_column(0x0b)
    2823
    2824$C$DW$189       .dwtag  DW_TAG_member
    2825        .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$90)
    2826        .dwattr $C$DW$189, DW_AT_name("$P$T10")
    2827        .dwattr $C$DW$189, DW_AT_TI_symbol_name("$P$T10")
    2828        .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2829        .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2830        .dwattr $C$DW$189, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2831        .dwattr $C$DW$189, DW_AT_decl_line(0xcf)
    2832        .dwattr $C$DW$189, DW_AT_decl_column(0x02)
    2833
    2834$C$DW$190       .dwtag  DW_TAG_member
    2835        .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$92)
    2836        .dwattr $C$DW$190, DW_AT_name("$P$T11")
    2837        .dwattr $C$DW$190, DW_AT_TI_symbol_name("$P$T11")
    2838        .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2839        .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2840        .dwattr $C$DW$190, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2841        .dwattr $C$DW$190, DW_AT_decl_line(0xda)
    2842        .dwattr $C$DW$190, DW_AT_decl_column(0x02)
    2843
    2844$C$DW$191       .dwtag  DW_TAG_member
    2845        .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$34)
    2846        .dwattr $C$DW$191, DW_AT_name("rsvd38")
    2847        .dwattr $C$DW$191, DW_AT_TI_symbol_name("rsvd38")
    2848        .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2849        .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2850        .dwattr $C$DW$191, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2851        .dwattr $C$DW$191, DW_AT_decl_line(0xe5)
    2852        .dwattr $C$DW$191, DW_AT_decl_column(0x0b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   53

    2853
    2854$C$DW$192       .dwtag  DW_TAG_member
    2855        .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$94)
    2856        .dwattr $C$DW$192, DW_AT_name("$P$T12")
    2857        .dwattr $C$DW$192, DW_AT_TI_symbol_name("$P$T12")
    2858        .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2859        .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2860        .dwattr $C$DW$192, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2861        .dwattr $C$DW$192, DW_AT_decl_line(0xe8)
    2862        .dwattr $C$DW$192, DW_AT_decl_column(0x02)
    2863
    2864        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2865        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2866        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2867        .dwendtag $C$DW$T$35
    2868
    2869$C$DW$T$109     .dwtag  DW_TAG_typedef
    2870        .dwattr $C$DW$T$109, DW_AT_name("pruCfg")
    2871        .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$35)
    2872        .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2873        .dwattr $C$DW$T$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-comp
    2874        .dwattr $C$DW$T$109, DW_AT_decl_line(0xf0)
    2875        .dwattr $C$DW$T$109, DW_AT_decl_column(0x03)
    2876
    2877$C$DW$T$110     .dwtag  DW_TAG_volatile_type
    2878        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    2879
    2880
    2881$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2882        .dwattr $C$DW$T$36, DW_AT_byte_size(0x40000)
    2883$C$DW$193       .dwtag  DW_TAG_member
    2884        .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$97)
    2885        .dwattr $C$DW$193, DW_AT_name("$P$T13")
    2886        .dwattr $C$DW$193, DW_AT_TI_symbol_name("$P$T13")
    2887        .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2888        .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2889        .dwattr $C$DW$193, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/u
    2890        .dwattr $C$DW$193, DW_AT_decl_line(0x34)
    2891        .dwattr $C$DW$193, DW_AT_decl_column(0x02)
    2892
    2893        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2894        .dwattr $C$DW$T$36, DW_AT_decl_line(0x33)
    2895        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2896        .dwendtag $C$DW$T$36
    2897
    2898$C$DW$T$37      .dwtag  DW_TAG_typedef
    2899        .dwattr $C$DW$T$37, DW_AT_name("unibus_memory_t")
    2900        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2901        .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2902        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2903        .dwattr $C$DW$T$37, DW_AT_decl_line(0x38)
    2904        .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    2905
    2906
    2907$C$DW$T$38      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   54

    2908        .dwattr $C$DW$T$38, DW_AT_byte_size(0x40000)
    2909$C$DW$194       .dwtag  DW_TAG_member
    2910        .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$37)
    2911        .dwattr $C$DW$194, DW_AT_name("memory")
    2912        .dwattr $C$DW$194, DW_AT_TI_symbol_name("memory")
    2913        .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2914        .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2915        .dwattr $C$DW$194, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/d
    2916        .dwattr $C$DW$194, DW_AT_decl_line(0x17)
    2917        .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    2918
    2919        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2920        .dwattr $C$DW$T$38, DW_AT_decl_line(0x14)
    2921        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2922        .dwendtag $C$DW$T$38
    2923
    2924$C$DW$T$48      .dwtag  DW_TAG_typedef
    2925        .dwattr $C$DW$T$48, DW_AT_name("ddrmem_t")
    2926        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$38)
    2927        .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2928        .dwattr $C$DW$T$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2929        .dwattr $C$DW$T$48, DW_AT_decl_line(0x18)
    2930        .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    2931
    2932$C$DW$T$49      .dwtag  DW_TAG_volatile_type
    2933        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2934
    2935$C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2936        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2937        .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2938
    2939
    2940$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2941        .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    2942$C$DW$195       .dwtag  DW_TAG_member
    2943        .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$39)
    2944        .dwattr $C$DW$195, DW_AT_name("eventmask")
    2945        .dwattr $C$DW$195, DW_AT_TI_symbol_name("eventmask")
    2946        .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2947        .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2948        .dwattr $C$DW$195, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2949        .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    2950        .dwattr $C$DW$195, DW_AT_decl_column(0x0a)
    2951
    2952$C$DW$196       .dwtag  DW_TAG_member
    2953        .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$39)
    2954        .dwattr $C$DW$196, DW_AT_name("unibus_control")
    2955        .dwattr $C$DW$196, DW_AT_TI_symbol_name("unibus_control")
    2956        .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2957        .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2958        .dwattr $C$DW$196, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2959        .dwattr $C$DW$196, DW_AT_decl_line(0x7d)
    2960        .dwattr $C$DW$196, DW_AT_decl_column(0x0a)
    2961
    2962$C$DW$197       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   55

    2963        .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$39)
    2964        .dwattr $C$DW$197, DW_AT_name("device_handle")
    2965        .dwattr $C$DW$197, DW_AT_TI_symbol_name("device_handle")
    2966        .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2967        .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2968        .dwattr $C$DW$197, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2969        .dwattr $C$DW$197, DW_AT_decl_line(0x7f)
    2970        .dwattr $C$DW$197, DW_AT_decl_column(0x0a)
    2971
    2972$C$DW$198       .dwtag  DW_TAG_member
    2973        .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$39)
    2974        .dwattr $C$DW$198, DW_AT_name("device_register_idx")
    2975        .dwattr $C$DW$198, DW_AT_TI_symbol_name("device_register_idx")
    2976        .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2977        .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2978        .dwattr $C$DW$198, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2979        .dwattr $C$DW$198, DW_AT_decl_line(0x81)
    2980        .dwattr $C$DW$198, DW_AT_decl_column(0x0a)
    2981
    2982$C$DW$199       .dwtag  DW_TAG_member
    2983        .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$32)
    2984        .dwattr $C$DW$199, DW_AT_name("addr")
    2985        .dwattr $C$DW$199, DW_AT_TI_symbol_name("addr")
    2986        .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2987        .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2988        .dwattr $C$DW$199, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2989        .dwattr $C$DW$199, DW_AT_decl_line(0x83)
    2990        .dwattr $C$DW$199, DW_AT_decl_column(0x0b)
    2991
    2992$C$DW$200       .dwtag  DW_TAG_member
    2993        .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$40)
    2994        .dwattr $C$DW$200, DW_AT_name("data")
    2995        .dwattr $C$DW$200, DW_AT_TI_symbol_name("data")
    2996        .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2997        .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2998        .dwattr $C$DW$200, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2999        .dwattr $C$DW$200, DW_AT_decl_line(0x84)
    3000        .dwattr $C$DW$200, DW_AT_decl_column(0x0b)
    3001
    3002$C$DW$201       .dwtag  DW_TAG_member
    3003        .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$39)
    3004        .dwattr $C$DW$201, DW_AT_name("initialization_signals_prev")
    3005        .dwattr $C$DW$201, DW_AT_TI_symbol_name("initialization_signals_prev")
    3006        .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3007        .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3008        .dwattr $C$DW$201, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3009        .dwattr $C$DW$201, DW_AT_decl_line(0x87)
    3010        .dwattr $C$DW$201, DW_AT_decl_column(0x0a)
    3011
    3012$C$DW$202       .dwtag  DW_TAG_member
    3013        .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$39)
    3014        .dwattr $C$DW$202, DW_AT_name("initialization_signals_cur")
    3015        .dwattr $C$DW$202, DW_AT_TI_symbol_name("initialization_signals_cur")
    3016        .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3017        .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   56

    3018        .dwattr $C$DW$202, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3019        .dwattr $C$DW$202, DW_AT_decl_line(0x88)
    3020        .dwattr $C$DW$202, DW_AT_decl_column(0x0a)
    3021
    3022        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3023        .dwattr $C$DW$T$41, DW_AT_decl_line(0x79)
    3024        .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3025        .dwendtag $C$DW$T$41
    3026
    3027$C$DW$T$51      .dwtag  DW_TAG_typedef
    3028        .dwattr $C$DW$T$51, DW_AT_name("mailbox_events_t")
    3029        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$41)
    3030        .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3031        .dwattr $C$DW$T$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3032        .dwattr $C$DW$T$51, DW_AT_decl_line(0x8b)
    3033        .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    3034
    3035
    3036$C$DW$T$42      .dwtag  DW_TAG_structure_type
    3037        .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    3038$C$DW$203       .dwtag  DW_TAG_member
    3039        .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$32)
    3040        .dwattr $C$DW$203, DW_AT_name("addr")
    3041        .dwattr $C$DW$203, DW_AT_TI_symbol_name("addr")
    3042        .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3043        .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3044        .dwattr $C$DW$203, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3045        .dwattr $C$DW$203, DW_AT_decl_line(0x4c)
    3046        .dwattr $C$DW$203, DW_AT_decl_column(0x0b)
    3047
    3048$C$DW$204       .dwtag  DW_TAG_member
    3049        .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$32)
    3050        .dwattr $C$DW$204, DW_AT_name("val")
    3051        .dwattr $C$DW$204, DW_AT_TI_symbol_name("val")
    3052        .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3053        .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3054        .dwattr $C$DW$204, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    3055        .dwattr $C$DW$204, DW_AT_decl_line(0x4d)
    3056        .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    3057
    3058        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3059        .dwattr $C$DW$T$42, DW_AT_decl_line(0x4b)
    3060        .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    3061        .dwendtag $C$DW$T$42
    3062
    3063$C$DW$T$98      .dwtag  DW_TAG_typedef
    3064        .dwattr $C$DW$T$98, DW_AT_name("mailbox_test_t")
    3065        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$42)
    3066        .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3067        .dwattr $C$DW$T$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    3068        .dwattr $C$DW$T$98, DW_AT_decl_line(0x4e)
    3069        .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    3070
    3071
    3072$C$DW$T$43      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:33 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_main.asm                                                        PAGE   57

    3073        .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    3074$C$DW$205       .dwtag  DW_TAG_member
    3075        .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$32)
    3076        .dwattr $C$DW$205, DW_AT_name("addr")
    3077        .dwattr $C$DW$205, DW_AT_TI_symbol_name("addr")
    3078        .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3079        .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
