PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:32 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_iopageregisters.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

    1420;*   Loop source line                : 414
    1421;*   Loop closing brace source line  : 414
    1422;*   Known Minimum Trip Count        : 2048
    1423;*   Known Maximum Trip Count        : 2048
    1424;*   Known Max Trip Count Factor     : 2048
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   27

    1425;* --------------------------------------------------------------------------*
    1426 0000002c                 ||$C$L17||:    
    1427;*** 414        -----------------------    *m = K$6;  // [0]
    1428;*** 414        -----------------------    *(++m) = K$6;  // [0]
    1429;*** 414        -----------------------    ++m;  // [0]
    1430;*** 414        -----------------------    if ( --L$2 != 0 ) goto g11;  // [0]
    1431        .dwpsn  file "/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//in
    1432 0000002c 000000E100000E          SBBO      &r14.b0, r0, 0, 1     ; [ALU_PRU] |414| m,$O$K6
    1433 00000030 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |414| m,m
    1434 00000034 000000E100000E          SBBO      &r14.b0, r0, 0, 1     ; [ALU_PRU] |414| m,$O$K6
    1435 00000038 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |414| m,m
    1436        .dwpsn  file "/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//in
    1437        ; END LOOP ; [] |414| 
    1438;* --------------------------------------------------------------------------*
    1439 0000003c                 ||$C$L18||:    
    1440;*** 412        -----------------------    m = (struct $$fake23 *)K$1+4128;  // [0]
    1441;***    -----------------------    #pragma MUST_ITERATE(1024, 1024, 1024)
    1442;***    -----------------------    #pragma LOOP_FLAGS(0u)
    1443;***    -----------------------    L$3 = 1024u;
    1444;***    -----------------------g6:
    1445;***    -----------------------g10:
    1446        .dwpsn  file "/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//in
    1447 0000003c 000000241020E0          LDI       r0, 0x1020            ; [ALU_PRU] |412| 
    1448 00000040 00000000E0E1E0          ADD       r0, r1, r0            ; [ALU_PRU] |412| m,$O$K1
    1449 00000044 00000024040081          LDI       r1.w0, 0x0400         ; [ALU_PRU] $O$L3
    1450 00000048 00000030810005          LOOP      ||$C$L20||, r1.w0     ; [ALU_PRU] $O$L3
    1451;* --------------------------------------------------------------------------*
    1452;*   BEGIN LOOP ||$C$L19||
    1453;*
    1454;*   Loop source line                : 414
    1455;*   Loop closing brace source line  : 414
    1456;*   Known Minimum Trip Count        : 1024
    1457;*   Known Maximum Trip Count        : 1024
    1458;*   Known Max Trip Count Factor     : 1024
    1459;* --------------------------------------------------------------------------*
    1460 0000004c                 ||$C$L19||:    
    1461;*** 414        -----------------------    *m = K$6;  // [0]
    1462;*** 414        -----------------------    *(++m) = K$6;  // [0]
    1463;*** 414        -----------------------    ++m;  // [0]
    1464;*** 414        -----------------------    if ( --L$3 != 0 ) goto g10;  // [0]
    1465        .dwpsn  file "/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//in
    1466 0000004c 000000E100000E          SBBO      &r14.b0, r0, 0, 1     ; [ALU_PRU] |414| m,$O$K6
    1467 00000050 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |414| m,m
    1468 00000054 000000E100000E          SBBO      &r14.b0, r0, 0, 1     ; [ALU_PRU] |414| m,$O$K6
    1469 00000058 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |414| m,m
    1470        .dwpsn  file "/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//in
    1471        ; END LOOP ; [] |414| 
    1472;* --------------------------------------------------------------------------*
    1473||$C$L20||:    
    1474;***    -----------------------    return;
    1475$C$DW$66        .dwtag  DW_TAG_TI_branch
    1476        .dwattr $C$DW$66, DW_AT_low_pc(0x00)
    1477        .dwattr $C$DW$66, DW_AT_TI_return
    1478
    1479 0000005c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   28

    1480        .dwattr $C$DW$58, DW_AT_TI_end_file("pru1_iopageregisters.c")
    1481        .dwattr $C$DW$58, DW_AT_TI_end_line(0x96)
    1482        .dwattr $C$DW$58, DW_AT_TI_end_column(0x01)
    1483        .dwendentry
    1484        .dwendtag $C$DW$58
    1485
    1486;* Inlined function references:
    1487;* [0] memset
    1488;*****************************************************************************
    1489;* UNDEFINED EXTERNAL REFERENCES                                             *
    1490;*****************************************************************************
    1491        .global ||mailbox||
    1492
    1493;******************************************************************************
    1494;* TYPE INFORMATION                                                           *
    1495;******************************************************************************
    1496
    1497$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1498        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1499$C$DW$67        .dwtag  DW_TAG_member
    1500        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1501        .dwattr $C$DW$67, DW_AT_name("REVID")
    1502        .dwattr $C$DW$67, DW_AT_TI_symbol_name("REVID")
    1503        .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
    1504        .dwattr $C$DW$67, DW_AT_bit_size(0x20)
    1505        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1507        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1508        .dwattr $C$DW$67, DW_AT_decl_line(0x2d)
    1509        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1510
    1511        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1512        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1513        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1514        .dwendtag $C$DW$T$19
    1515
    1516$C$DW$T$60      .dwtag  DW_TAG_volatile_type
    1517        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    1518
    1519
    1520$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1521        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1522$C$DW$68        .dwtag  DW_TAG_member
    1523        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1524        .dwattr $C$DW$68, DW_AT_name("IDLE_MODE")
    1525        .dwattr $C$DW$68, DW_AT_TI_symbol_name("IDLE_MODE")
    1526        .dwattr $C$DW$68, DW_AT_bit_offset(0x1e)
    1527        .dwattr $C$DW$68, DW_AT_bit_size(0x02)
    1528        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1530        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1531        .dwattr $C$DW$68, DW_AT_decl_line(0x37)
    1532        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1533
    1534$C$DW$69        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   29

    1535        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1536        .dwattr $C$DW$69, DW_AT_name("STANDBY_MODE")
    1537        .dwattr $C$DW$69, DW_AT_TI_symbol_name("STANDBY_MODE")
    1538        .dwattr $C$DW$69, DW_AT_bit_offset(0x1c)
    1539        .dwattr $C$DW$69, DW_AT_bit_size(0x02)
    1540        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1542        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1543        .dwattr $C$DW$69, DW_AT_decl_line(0x38)
    1544        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1545
    1546$C$DW$70        .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$70, DW_AT_name("STANDBY_INIT")
    1549        .dwattr $C$DW$70, DW_AT_TI_symbol_name("STANDBY_INIT")
    1550        .dwattr $C$DW$70, DW_AT_bit_offset(0x1b)
    1551        .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1552        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1554        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1555        .dwattr $C$DW$70, DW_AT_decl_line(0x39)
    1556        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1557
    1558$C$DW$71        .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1560        .dwattr $C$DW$71, DW_AT_name("SUB_MWAIT")
    1561        .dwattr $C$DW$71, DW_AT_TI_symbol_name("SUB_MWAIT")
    1562        .dwattr $C$DW$71, DW_AT_bit_offset(0x1a)
    1563        .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1564        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1566        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1567        .dwattr $C$DW$71, DW_AT_decl_line(0x3a)
    1568        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1569
    1570$C$DW$72        .dwtag  DW_TAG_member
    1571        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1572        .dwattr $C$DW$72, DW_AT_name("rsvd6")
    1573        .dwattr $C$DW$72, DW_AT_TI_symbol_name("rsvd6")
    1574        .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1575        .dwattr $C$DW$72, DW_AT_bit_size(0x1a)
    1576        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1578        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1579        .dwattr $C$DW$72, DW_AT_decl_line(0x3b)
    1580        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1581
    1582        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1583        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1584        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1585        .dwendtag $C$DW$T$20
    1586
    1587$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    1588        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$20)
    1589
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   30

    1590
    1591$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1592        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1593$C$DW$73        .dwtag  DW_TAG_member
    1594        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1595        .dwattr $C$DW$73, DW_AT_name("PRU0_GPI_MODE")
    1596        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1597        .dwattr $C$DW$73, DW_AT_bit_offset(0x1e)
    1598        .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1599        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1601        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1602        .dwattr $C$DW$73, DW_AT_decl_line(0x45)
    1603        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1604
    1605$C$DW$74        .dwtag  DW_TAG_member
    1606        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1607        .dwattr $C$DW$74, DW_AT_name("PRU0_GPI_CLK_MODE")
    1608        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1609        .dwattr $C$DW$74, DW_AT_bit_offset(0x1d)
    1610        .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1611        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1614        .dwattr $C$DW$74, DW_AT_decl_line(0x46)
    1615        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1616
    1617$C$DW$75        .dwtag  DW_TAG_member
    1618        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1619        .dwattr $C$DW$75, DW_AT_name("PRU0_GPI_DIV0")
    1620        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1621        .dwattr $C$DW$75, DW_AT_bit_offset(0x18)
    1622        .dwattr $C$DW$75, DW_AT_bit_size(0x05)
    1623        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1625        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1626        .dwattr $C$DW$75, DW_AT_decl_line(0x47)
    1627        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1628
    1629$C$DW$76        .dwtag  DW_TAG_member
    1630        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1631        .dwattr $C$DW$76, DW_AT_name("PRU0_GPI_DIV1")
    1632        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1633        .dwattr $C$DW$76, DW_AT_bit_offset(0x13)
    1634        .dwattr $C$DW$76, DW_AT_bit_size(0x05)
    1635        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1637        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1638        .dwattr $C$DW$76, DW_AT_decl_line(0x48)
    1639        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1640
    1641$C$DW$77        .dwtag  DW_TAG_member
    1642        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1643        .dwattr $C$DW$77, DW_AT_name("PRU0_GPI_SB")
    1644        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_GPI_SB")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   31

    1645        .dwattr $C$DW$77, DW_AT_bit_offset(0x12)
    1646        .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1647        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1649        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1650        .dwattr $C$DW$77, DW_AT_decl_line(0x49)
    1651        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1652
    1653$C$DW$78        .dwtag  DW_TAG_member
    1654        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1655        .dwattr $C$DW$78, DW_AT_name("PRU0_GPO_MODE")
    1656        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1657        .dwattr $C$DW$78, DW_AT_bit_offset(0x11)
    1658        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1659        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1661        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1662        .dwattr $C$DW$78, DW_AT_decl_line(0x4a)
    1663        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1664
    1665$C$DW$79        .dwtag  DW_TAG_member
    1666        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1667        .dwattr $C$DW$79, DW_AT_name("PRU0_GPO_DIV0")
    1668        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1669        .dwattr $C$DW$79, DW_AT_bit_offset(0x0c)
    1670        .dwattr $C$DW$79, DW_AT_bit_size(0x05)
    1671        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1674        .dwattr $C$DW$79, DW_AT_decl_line(0x4b)
    1675        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1676
    1677$C$DW$80        .dwtag  DW_TAG_member
    1678        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1679        .dwattr $C$DW$80, DW_AT_name("PRU0_GPO_DIV1")
    1680        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1681        .dwattr $C$DW$80, DW_AT_bit_offset(0x07)
    1682        .dwattr $C$DW$80, DW_AT_bit_size(0x05)
    1683        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1685        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1686        .dwattr $C$DW$80, DW_AT_decl_line(0x4c)
    1687        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1688
    1689$C$DW$81        .dwtag  DW_TAG_member
    1690        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1691        .dwattr $C$DW$81, DW_AT_name("PRU0_GPO_SH_SEL")
    1692        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1693        .dwattr $C$DW$81, DW_AT_bit_offset(0x06)
    1694        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1695        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1697        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1698        .dwattr $C$DW$81, DW_AT_decl_line(0x4d)
    1699        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   32

    1700
    1701$C$DW$82        .dwtag  DW_TAG_member
    1702        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1703        .dwattr $C$DW$82, DW_AT_name("rsvd26")
    1704        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd26")
    1705        .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1706        .dwattr $C$DW$82, DW_AT_bit_size(0x06)
    1707        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1709        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1710        .dwattr $C$DW$82, DW_AT_decl_line(0x4e)
    1711        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1712
    1713        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1714        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1715        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1716        .dwendtag $C$DW$T$21
    1717
    1718$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    1719        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$21)
    1720
    1721
    1722$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1723        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1724$C$DW$83        .dwtag  DW_TAG_member
    1725        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1726        .dwattr $C$DW$83, DW_AT_name("PRU1_GPI_MODE")
    1727        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1728        .dwattr $C$DW$83, DW_AT_bit_offset(0x1e)
    1729        .dwattr $C$DW$83, DW_AT_bit_size(0x02)
    1730        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1732        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1733        .dwattr $C$DW$83, DW_AT_decl_line(0x58)
    1734        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1735
    1736$C$DW$84        .dwtag  DW_TAG_member
    1737        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1738        .dwattr $C$DW$84, DW_AT_name("PRU1_GPI_CLK_MODE")
    1739        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1740        .dwattr $C$DW$84, DW_AT_bit_offset(0x1d)
    1741        .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1742        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1744        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1745        .dwattr $C$DW$84, DW_AT_decl_line(0x59)
    1746        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1747
    1748$C$DW$85        .dwtag  DW_TAG_member
    1749        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1750        .dwattr $C$DW$85, DW_AT_name("PRU1_GPI_DIV0")
    1751        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1752        .dwattr $C$DW$85, DW_AT_bit_offset(0x18)
    1753        .dwattr $C$DW$85, DW_AT_bit_size(0x05)
    1754        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   33

    1755        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1756        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1757        .dwattr $C$DW$85, DW_AT_decl_line(0x5a)
    1758        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1759
    1760$C$DW$86        .dwtag  DW_TAG_member
    1761        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1762        .dwattr $C$DW$86, DW_AT_name("PRU1_GPI_DIV1")
    1763        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1764        .dwattr $C$DW$86, DW_AT_bit_offset(0x13)
    1765        .dwattr $C$DW$86, DW_AT_bit_size(0x05)
    1766        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1768        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1769        .dwattr $C$DW$86, DW_AT_decl_line(0x5b)
    1770        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1771
    1772$C$DW$87        .dwtag  DW_TAG_member
    1773        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1774        .dwattr $C$DW$87, DW_AT_name("PRU1_GPI_SB")
    1775        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1776        .dwattr $C$DW$87, DW_AT_bit_offset(0x12)
    1777        .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1778        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1780        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1781        .dwattr $C$DW$87, DW_AT_decl_line(0x5c)
    1782        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1783
    1784$C$DW$88        .dwtag  DW_TAG_member
    1785        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1786        .dwattr $C$DW$88, DW_AT_name("PRU1_GPO_MODE")
    1787        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1788        .dwattr $C$DW$88, DW_AT_bit_offset(0x11)
    1789        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1790        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1792        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1793        .dwattr $C$DW$88, DW_AT_decl_line(0x5d)
    1794        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1795
    1796$C$DW$89        .dwtag  DW_TAG_member
    1797        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1798        .dwattr $C$DW$89, DW_AT_name("PRU1_GPO_DIV0")
    1799        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1800        .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
    1801        .dwattr $C$DW$89, DW_AT_bit_size(0x05)
    1802        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1804        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1805        .dwattr $C$DW$89, DW_AT_decl_line(0x5e)
    1806        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1807
    1808$C$DW$90        .dwtag  DW_TAG_member
    1809        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   34

    1810        .dwattr $C$DW$90, DW_AT_name("PRU1_GPO_DIV1")
    1811        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1812        .dwattr $C$DW$90, DW_AT_bit_offset(0x07)
    1813        .dwattr $C$DW$90, DW_AT_bit_size(0x05)
    1814        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1816        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1817        .dwattr $C$DW$90, DW_AT_decl_line(0x5f)
    1818        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1819
    1820$C$DW$91        .dwtag  DW_TAG_member
    1821        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1822        .dwattr $C$DW$91, DW_AT_name("PRU1_GPO_SH_SEL")
    1823        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1824        .dwattr $C$DW$91, DW_AT_bit_offset(0x06)
    1825        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1826        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1828        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1829        .dwattr $C$DW$91, DW_AT_decl_line(0x60)
    1830        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1831
    1832$C$DW$92        .dwtag  DW_TAG_member
    1833        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1834        .dwattr $C$DW$92, DW_AT_name("rsvd26")
    1835        .dwattr $C$DW$92, DW_AT_TI_symbol_name("rsvd26")
    1836        .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1837        .dwattr $C$DW$92, DW_AT_bit_size(0x06)
    1838        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1840        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1841        .dwattr $C$DW$92, DW_AT_decl_line(0x61)
    1842        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1843
    1844        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1845        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1846        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1847        .dwendtag $C$DW$T$22
    1848
    1849$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    1850        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$22)
    1851
    1852
    1853$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1854        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1855$C$DW$93        .dwtag  DW_TAG_member
    1856        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1857        .dwattr $C$DW$93, DW_AT_name("PRU0_CLK_STOP_REQ")
    1858        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1859        .dwattr $C$DW$93, DW_AT_bit_offset(0x1f)
    1860        .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1861        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1863        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1864        .dwattr $C$DW$93, DW_AT_decl_line(0x6b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   35

    1865        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1866
    1867$C$DW$94        .dwtag  DW_TAG_member
    1868        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1869        .dwattr $C$DW$94, DW_AT_name("PRU0_CLK_STOP_ACK")
    1870        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1871        .dwattr $C$DW$94, DW_AT_bit_offset(0x1e)
    1872        .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1873        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1875        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1876        .dwattr $C$DW$94, DW_AT_decl_line(0x6c)
    1877        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1878
    1879$C$DW$95        .dwtag  DW_TAG_member
    1880        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1881        .dwattr $C$DW$95, DW_AT_name("PRU0_CLK_EN")
    1882        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1883        .dwattr $C$DW$95, DW_AT_bit_offset(0x1d)
    1884        .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1885        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1887        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1888        .dwattr $C$DW$95, DW_AT_decl_line(0x6d)
    1889        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1890
    1891$C$DW$96        .dwtag  DW_TAG_member
    1892        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1893        .dwattr $C$DW$96, DW_AT_name("PRU1_CLK_STOP_REQ")
    1894        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1895        .dwattr $C$DW$96, DW_AT_bit_offset(0x1c)
    1896        .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1897        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1899        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1900        .dwattr $C$DW$96, DW_AT_decl_line(0x6e)
    1901        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1902
    1903$C$DW$97        .dwtag  DW_TAG_member
    1904        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1905        .dwattr $C$DW$97, DW_AT_name("PRU1_CLK_STOP_ACK")
    1906        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1907        .dwattr $C$DW$97, DW_AT_bit_offset(0x1b)
    1908        .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1909        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1911        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1912        .dwattr $C$DW$97, DW_AT_decl_line(0x6f)
    1913        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1914
    1915$C$DW$98        .dwtag  DW_TAG_member
    1916        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1917        .dwattr $C$DW$98, DW_AT_name("PRU1_CLK_EN")
    1918        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1919        .dwattr $C$DW$98, DW_AT_bit_offset(0x1a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   36

    1920        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1921        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1923        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1924        .dwattr $C$DW$98, DW_AT_decl_line(0x70)
    1925        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1926
    1927$C$DW$99        .dwtag  DW_TAG_member
    1928        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1929        .dwattr $C$DW$99, DW_AT_name("INTC_CLK_STOP_REQ")
    1930        .dwattr $C$DW$99, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1931        .dwattr $C$DW$99, DW_AT_bit_offset(0x19)
    1932        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1933        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1935        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1936        .dwattr $C$DW$99, DW_AT_decl_line(0x71)
    1937        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1938
    1939$C$DW$100       .dwtag  DW_TAG_member
    1940        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1941        .dwattr $C$DW$100, DW_AT_name("INTC_CLK_STOP_ACK")
    1942        .dwattr $C$DW$100, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1943        .dwattr $C$DW$100, DW_AT_bit_offset(0x18)
    1944        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1945        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1947        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1948        .dwattr $C$DW$100, DW_AT_decl_line(0x72)
    1949        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1950
    1951$C$DW$101       .dwtag  DW_TAG_member
    1952        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1953        .dwattr $C$DW$101, DW_AT_name("INTC_CLK_EN")
    1954        .dwattr $C$DW$101, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1955        .dwattr $C$DW$101, DW_AT_bit_offset(0x17)
    1956        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1957        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1959        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1960        .dwattr $C$DW$101, DW_AT_decl_line(0x73)
    1961        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1962
    1963$C$DW$102       .dwtag  DW_TAG_member
    1964        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1965        .dwattr $C$DW$102, DW_AT_name("UART_CLK_STOP_REQ")
    1966        .dwattr $C$DW$102, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1967        .dwattr $C$DW$102, DW_AT_bit_offset(0x16)
    1968        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1969        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1971        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1972        .dwattr $C$DW$102, DW_AT_decl_line(0x74)
    1973        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1974
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   37

    1975$C$DW$103       .dwtag  DW_TAG_member
    1976        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1977        .dwattr $C$DW$103, DW_AT_name("UART_CLK_STOP_ACK")
    1978        .dwattr $C$DW$103, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1979        .dwattr $C$DW$103, DW_AT_bit_offset(0x15)
    1980        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1981        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1984        .dwattr $C$DW$103, DW_AT_decl_line(0x75)
    1985        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1986
    1987$C$DW$104       .dwtag  DW_TAG_member
    1988        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1989        .dwattr $C$DW$104, DW_AT_name("UART_CLK_EN")
    1990        .dwattr $C$DW$104, DW_AT_TI_symbol_name("UART_CLK_EN")
    1991        .dwattr $C$DW$104, DW_AT_bit_offset(0x14)
    1992        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1993        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1995        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1996        .dwattr $C$DW$104, DW_AT_decl_line(0x76)
    1997        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1998
    1999$C$DW$105       .dwtag  DW_TAG_member
    2000        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    2001        .dwattr $C$DW$105, DW_AT_name("ECAP_CLK_STOP_REQ")
    2002        .dwattr $C$DW$105, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    2003        .dwattr $C$DW$105, DW_AT_bit_offset(0x13)
    2004        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    2005        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2007        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2008        .dwattr $C$DW$105, DW_AT_decl_line(0x77)
    2009        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    2010
    2011$C$DW$106       .dwtag  DW_TAG_member
    2012        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    2013        .dwattr $C$DW$106, DW_AT_name("ECAP_CLK_STOP_ACK")
    2014        .dwattr $C$DW$106, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    2015        .dwattr $C$DW$106, DW_AT_bit_offset(0x12)
    2016        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    2017        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2019        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2020        .dwattr $C$DW$106, DW_AT_decl_line(0x78)
    2021        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    2022
    2023$C$DW$107       .dwtag  DW_TAG_member
    2024        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    2025        .dwattr $C$DW$107, DW_AT_name("ECAP_CLK_EN")
    2026        .dwattr $C$DW$107, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    2027        .dwattr $C$DW$107, DW_AT_bit_offset(0x11)
    2028        .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    2029        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   38

    2030        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2031        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2032        .dwattr $C$DW$107, DW_AT_decl_line(0x79)
    2033        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    2034
    2035$C$DW$108       .dwtag  DW_TAG_member
    2036        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    2037        .dwattr $C$DW$108, DW_AT_name("IEP_CLK_STOP_REQ")
    2038        .dwattr $C$DW$108, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    2039        .dwattr $C$DW$108, DW_AT_bit_offset(0x10)
    2040        .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2041        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2044        .dwattr $C$DW$108, DW_AT_decl_line(0x7a)
    2045        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    2046
    2047$C$DW$109       .dwtag  DW_TAG_member
    2048        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    2049        .dwattr $C$DW$109, DW_AT_name("IEP_CLK_STOP_ACK")
    2050        .dwattr $C$DW$109, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    2051        .dwattr $C$DW$109, DW_AT_bit_offset(0x0f)
    2052        .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    2053        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2054        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2055        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2056        .dwattr $C$DW$109, DW_AT_decl_line(0x7b)
    2057        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    2058
    2059$C$DW$110       .dwtag  DW_TAG_member
    2060        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    2061        .dwattr $C$DW$110, DW_AT_name("IEP_CLK_EN")
    2062        .dwattr $C$DW$110, DW_AT_TI_symbol_name("IEP_CLK_EN")
    2063        .dwattr $C$DW$110, DW_AT_bit_offset(0x0e)
    2064        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    2065        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2067        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2068        .dwattr $C$DW$110, DW_AT_decl_line(0x7c)
    2069        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    2070
    2071$C$DW$111       .dwtag  DW_TAG_member
    2072        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    2073        .dwattr $C$DW$111, DW_AT_name("rsvd18")
    2074        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd18")
    2075        .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    2076        .dwattr $C$DW$111, DW_AT_bit_size(0x0e)
    2077        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2079        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2080        .dwattr $C$DW$111, DW_AT_decl_line(0x7d)
    2081        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    2082
    2083        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2084        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   39

    2085        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    2086        .dwendtag $C$DW$T$23
    2087
    2088$C$DW$T$68      .dwtag  DW_TAG_volatile_type
    2089        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    2090
    2091
    2092$C$DW$T$24      .dwtag  DW_TAG_structure_type
    2093        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    2094$C$DW$112       .dwtag  DW_TAG_member
    2095        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    2096        .dwattr $C$DW$112, DW_AT_name("PRU0_IMEM_PE_RAW")
    2097        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    2098        .dwattr $C$DW$112, DW_AT_bit_offset(0x1c)
    2099        .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    2100        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2102        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2103        .dwattr $C$DW$112, DW_AT_decl_line(0x87)
    2104        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    2105
    2106$C$DW$113       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    2108        .dwattr $C$DW$113, DW_AT_name("PRU0_DMEM_PE_RAW")
    2109        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    2110        .dwattr $C$DW$113, DW_AT_bit_offset(0x18)
    2111        .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    2112        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2114        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2115        .dwattr $C$DW$113, DW_AT_decl_line(0x88)
    2116        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    2117
    2118$C$DW$114       .dwtag  DW_TAG_member
    2119        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    2120        .dwattr $C$DW$114, DW_AT_name("PRU1_IMEM_PE_RAW")
    2121        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    2122        .dwattr $C$DW$114, DW_AT_bit_offset(0x14)
    2123        .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    2124        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2126        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2127        .dwattr $C$DW$114, DW_AT_decl_line(0x89)
    2128        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    2129
    2130$C$DW$115       .dwtag  DW_TAG_member
    2131        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    2132        .dwattr $C$DW$115, DW_AT_name("PRU1_DMEM_PE_RAW")
    2133        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    2134        .dwattr $C$DW$115, DW_AT_bit_offset(0x10)
    2135        .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    2136        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2138        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2139        .dwattr $C$DW$115, DW_AT_decl_line(0x8a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   40

    2140        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    2141
    2142$C$DW$116       .dwtag  DW_TAG_member
    2143        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    2144        .dwattr $C$DW$116, DW_AT_name("RAM_PE_RAW")
    2145        .dwattr $C$DW$116, DW_AT_TI_symbol_name("RAM_PE_RAW")
    2146        .dwattr $C$DW$116, DW_AT_bit_offset(0x0c)
    2147        .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    2148        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2150        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2151        .dwattr $C$DW$116, DW_AT_decl_line(0x8b)
    2152        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2153
    2154$C$DW$117       .dwtag  DW_TAG_member
    2155        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    2156        .dwattr $C$DW$117, DW_AT_name("rsvd20")
    2157        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd20")
    2158        .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    2159        .dwattr $C$DW$117, DW_AT_bit_size(0x0c)
    2160        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2162        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2163        .dwattr $C$DW$117, DW_AT_decl_line(0x8c)
    2164        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    2165
    2166        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2167        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    2168        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    2169        .dwendtag $C$DW$T$24
    2170
    2171$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    2172        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$24)
    2173
    2174
    2175$C$DW$T$25      .dwtag  DW_TAG_structure_type
    2176        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    2177$C$DW$118       .dwtag  DW_TAG_member
    2178        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    2179        .dwattr $C$DW$118, DW_AT_name("PRU0_IMEM_PE")
    2180        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    2181        .dwattr $C$DW$118, DW_AT_bit_offset(0x1c)
    2182        .dwattr $C$DW$118, DW_AT_bit_size(0x04)
    2183        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2185        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2186        .dwattr $C$DW$118, DW_AT_decl_line(0x96)
    2187        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    2188
    2189$C$DW$119       .dwtag  DW_TAG_member
    2190        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    2191        .dwattr $C$DW$119, DW_AT_name("PRU0_DMEM_PE")
    2192        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    2193        .dwattr $C$DW$119, DW_AT_bit_offset(0x18)
    2194        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   41

    2195        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2197        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2198        .dwattr $C$DW$119, DW_AT_decl_line(0x97)
    2199        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2200
    2201$C$DW$120       .dwtag  DW_TAG_member
    2202        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2203        .dwattr $C$DW$120, DW_AT_name("PRU1_IMEM_PE")
    2204        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    2205        .dwattr $C$DW$120, DW_AT_bit_offset(0x14)
    2206        .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    2207        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2209        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2210        .dwattr $C$DW$120, DW_AT_decl_line(0x98)
    2211        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2212
    2213$C$DW$121       .dwtag  DW_TAG_member
    2214        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2215        .dwattr $C$DW$121, DW_AT_name("PRU1_DMEM_PE")
    2216        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    2217        .dwattr $C$DW$121, DW_AT_bit_offset(0x10)
    2218        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    2219        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2221        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2222        .dwattr $C$DW$121, DW_AT_decl_line(0x99)
    2223        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2224
    2225$C$DW$122       .dwtag  DW_TAG_member
    2226        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2227        .dwattr $C$DW$122, DW_AT_name("RAM_PE")
    2228        .dwattr $C$DW$122, DW_AT_TI_symbol_name("RAM_PE")
    2229        .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    2230        .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    2231        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2232        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2233        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2234        .dwattr $C$DW$122, DW_AT_decl_line(0x9a)
    2235        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2236
    2237$C$DW$123       .dwtag  DW_TAG_member
    2238        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2239        .dwattr $C$DW$123, DW_AT_name("rsvd20")
    2240        .dwattr $C$DW$123, DW_AT_TI_symbol_name("rsvd20")
    2241        .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2242        .dwattr $C$DW$123, DW_AT_bit_size(0x0c)
    2243        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2245        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2246        .dwattr $C$DW$123, DW_AT_decl_line(0x9b)
    2247        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2248
    2249        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   42

    2250        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    2251        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    2252        .dwendtag $C$DW$T$25
    2253
    2254$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2255        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
    2256
    2257
    2258$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2259        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2260$C$DW$124       .dwtag  DW_TAG_member
    2261        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2262        .dwattr $C$DW$124, DW_AT_name("PRU0_IMEM_PE_SET")
    2263        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    2264        .dwattr $C$DW$124, DW_AT_bit_offset(0x1c)
    2265        .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    2266        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2268        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2269        .dwattr $C$DW$124, DW_AT_decl_line(0xa4)
    2270        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2271
    2272$C$DW$125       .dwtag  DW_TAG_member
    2273        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2274        .dwattr $C$DW$125, DW_AT_name("PRU0_DMEM_PE_SET")
    2275        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    2276        .dwattr $C$DW$125, DW_AT_bit_offset(0x18)
    2277        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    2278        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2279        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2280        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2281        .dwattr $C$DW$125, DW_AT_decl_line(0xa5)
    2282        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2283
    2284$C$DW$126       .dwtag  DW_TAG_member
    2285        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2286        .dwattr $C$DW$126, DW_AT_name("PRU1_IMEM_PE_SET")
    2287        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2288        .dwattr $C$DW$126, DW_AT_bit_offset(0x14)
    2289        .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    2290        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2291        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2292        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2293        .dwattr $C$DW$126, DW_AT_decl_line(0xa6)
    2294        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2295
    2296$C$DW$127       .dwtag  DW_TAG_member
    2297        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2298        .dwattr $C$DW$127, DW_AT_name("PRU1_DMEM_PE_SET")
    2299        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2300        .dwattr $C$DW$127, DW_AT_bit_offset(0x10)
    2301        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    2302        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2304        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   43

    2305        .dwattr $C$DW$127, DW_AT_decl_line(0xa7)
    2306        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2307
    2308$C$DW$128       .dwtag  DW_TAG_member
    2309        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2310        .dwattr $C$DW$128, DW_AT_name("RAM_PE_SET")
    2311        .dwattr $C$DW$128, DW_AT_TI_symbol_name("RAM_PE_SET")
    2312        .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    2313        .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    2314        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2316        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2317        .dwattr $C$DW$128, DW_AT_decl_line(0xa8)
    2318        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2319
    2320$C$DW$129       .dwtag  DW_TAG_member
    2321        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2322        .dwattr $C$DW$129, DW_AT_name("rsvd20")
    2323        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd20")
    2324        .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2325        .dwattr $C$DW$129, DW_AT_bit_size(0x0c)
    2326        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2328        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2329        .dwattr $C$DW$129, DW_AT_decl_line(0xa9)
    2330        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2331
    2332        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2333        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2334        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2335        .dwendtag $C$DW$T$26
    2336
    2337$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    2338        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$26)
    2339
    2340
    2341$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2342        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2343$C$DW$130       .dwtag  DW_TAG_member
    2344        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2345        .dwattr $C$DW$130, DW_AT_name("PRU0_IMEM_PE_CLR")
    2346        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2347        .dwattr $C$DW$130, DW_AT_bit_offset(0x1c)
    2348        .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    2349        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2351        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2352        .dwattr $C$DW$130, DW_AT_decl_line(0xb3)
    2353        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2354
    2355$C$DW$131       .dwtag  DW_TAG_member
    2356        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2357        .dwattr $C$DW$131, DW_AT_name("PRU0_DMEM_PE_CLR")
    2358        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2359        .dwattr $C$DW$131, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   44

    2360        .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    2361        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2363        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2364        .dwattr $C$DW$131, DW_AT_decl_line(0xb4)
    2365        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2366
    2367$C$DW$132       .dwtag  DW_TAG_member
    2368        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2369        .dwattr $C$DW$132, DW_AT_name("PRU1_IMEM_PE_CLR")
    2370        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2371        .dwattr $C$DW$132, DW_AT_bit_offset(0x14)
    2372        .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    2373        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2375        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2376        .dwattr $C$DW$132, DW_AT_decl_line(0xb5)
    2377        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2378
    2379$C$DW$133       .dwtag  DW_TAG_member
    2380        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2381        .dwattr $C$DW$133, DW_AT_name("PRU1_DMEM_PE_CLR")
    2382        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2383        .dwattr $C$DW$133, DW_AT_bit_offset(0x10)
    2384        .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    2385        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2387        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2388        .dwattr $C$DW$133, DW_AT_decl_line(0xb6)
    2389        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2390
    2391$C$DW$134       .dwtag  DW_TAG_member
    2392        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2393        .dwattr $C$DW$134, DW_AT_name("rsvd16")
    2394        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd16")
    2395        .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2396        .dwattr $C$DW$134, DW_AT_bit_size(0x10)
    2397        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2399        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2400        .dwattr $C$DW$134, DW_AT_decl_line(0xb7)
    2401        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2402
    2403        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2404        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2405        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2406        .dwendtag $C$DW$T$27
    2407
    2408$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    2409        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$27)
    2410
    2411
    2412$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2413        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2414$C$DW$135       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   45

    2415        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2416        .dwattr $C$DW$135, DW_AT_name("PMAO_PRU0")
    2417        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PMAO_PRU0")
    2418        .dwattr $C$DW$135, DW_AT_bit_offset(0x1f)
    2419        .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2420        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2422        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2423        .dwattr $C$DW$135, DW_AT_decl_line(0xc4)
    2424        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2425
    2426$C$DW$136       .dwtag  DW_TAG_member
    2427        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2428        .dwattr $C$DW$136, DW_AT_name("PMAO_PRU1")
    2429        .dwattr $C$DW$136, DW_AT_TI_symbol_name("PMAO_PRU1")
    2430        .dwattr $C$DW$136, DW_AT_bit_offset(0x1e)
    2431        .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2432        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2434        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2435        .dwattr $C$DW$136, DW_AT_decl_line(0xc5)
    2436        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2437
    2438$C$DW$137       .dwtag  DW_TAG_member
    2439        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2440        .dwattr $C$DW$137, DW_AT_name("rsvd2")
    2441        .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd2")
    2442        .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2443        .dwattr $C$DW$137, DW_AT_bit_size(0x1e)
    2444        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2446        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2447        .dwattr $C$DW$137, DW_AT_decl_line(0xc6)
    2448        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2449
    2450        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2451        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2452        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2453        .dwendtag $C$DW$T$28
    2454
    2455$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    2456        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$28)
    2457
    2458
    2459$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2460        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2461$C$DW$138       .dwtag  DW_TAG_member
    2462        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2463        .dwattr $C$DW$138, DW_AT_name("OCP_EN")
    2464        .dwattr $C$DW$138, DW_AT_TI_symbol_name("OCP_EN")
    2465        .dwattr $C$DW$138, DW_AT_bit_offset(0x1f)
    2466        .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2467        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2468        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2469        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   46

    2470        .dwattr $C$DW$138, DW_AT_decl_line(0xd3)
    2471        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2472
    2473$C$DW$139       .dwtag  DW_TAG_member
    2474        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2475        .dwattr $C$DW$139, DW_AT_name("rsvd1")
    2476        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd1")
    2477        .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2478        .dwattr $C$DW$139, DW_AT_bit_size(0x1f)
    2479        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2481        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2482        .dwattr $C$DW$139, DW_AT_decl_line(0xd4)
    2483        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2484
    2485        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2486        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2487        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2488        .dwendtag $C$DW$T$29
    2489
    2490$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    2491        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$29)
    2492
    2493
    2494$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2495        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2496$C$DW$140       .dwtag  DW_TAG_member
    2497        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2498        .dwattr $C$DW$140, DW_AT_name("PRU1_PAD_HP_EN")
    2499        .dwattr $C$DW$140, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2500        .dwattr $C$DW$140, DW_AT_bit_offset(0x1f)
    2501        .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2502        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2504        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2505        .dwattr $C$DW$140, DW_AT_decl_line(0xde)
    2506        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2507
    2508$C$DW$141       .dwtag  DW_TAG_member
    2509        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    2510        .dwattr $C$DW$141, DW_AT_name("XFR_SHIFT_EN")
    2511        .dwattr $C$DW$141, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2512        .dwattr $C$DW$141, DW_AT_bit_offset(0x1e)
    2513        .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2514        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2516        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2517        .dwattr $C$DW$141, DW_AT_decl_line(0xdf)
    2518        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2519
    2520$C$DW$142       .dwtag  DW_TAG_member
    2521        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    2522        .dwattr $C$DW$142, DW_AT_name("rsvd2")
    2523        .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd2")
    2524        .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   47

    2525        .dwattr $C$DW$142, DW_AT_bit_size(0x1e)
    2526        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2527        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2528        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2529        .dwattr $C$DW$142, DW_AT_decl_line(0xe0)
    2530        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2531
    2532        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2533        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2534        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2535        .dwendtag $C$DW$T$30
    2536
    2537$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    2538        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$30)
    2539
    2540
    2541$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2542        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2543$C$DW$143       .dwtag  DW_TAG_member
    2544        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    2545        .dwattr $C$DW$143, DW_AT_name("PIN_MUX_SEL")
    2546        .dwattr $C$DW$143, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2547        .dwattr $C$DW$143, DW_AT_bit_offset(0x18)
    2548        .dwattr $C$DW$143, DW_AT_bit_size(0x08)
    2549        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2551        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2552        .dwattr $C$DW$143, DW_AT_decl_line(0xec)
    2553        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2554
    2555$C$DW$144       .dwtag  DW_TAG_member
    2556        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    2557        .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2558        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd2")
    2559        .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2560        .dwattr $C$DW$144, DW_AT_bit_size(0x18)
    2561        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2563        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2564        .dwattr $C$DW$144, DW_AT_decl_line(0xed)
    2565        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    2566
    2567        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2568        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2569        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2570        .dwendtag $C$DW$T$31
    2571
    2572$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    2573        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$31)
    2574
    2575
    2576$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2577        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2578$C$DW$145       .dwtag  DW_TAG_member
    2579        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$61)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   48

    2580        .dwattr $C$DW$145, DW_AT_name("$P$T0")
    2581        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T0")
    2582        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2583        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2584        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2585        .dwattr $C$DW$145, DW_AT_decl_line(0x29)
    2586        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2587
    2588$C$DW$146       .dwtag  DW_TAG_member
    2589        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$63)
    2590        .dwattr $C$DW$146, DW_AT_name("$P$T1")
    2591        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T1")
    2592        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2593        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2594        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2595        .dwattr $C$DW$146, DW_AT_decl_line(0x33)
    2596        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2597
    2598$C$DW$147       .dwtag  DW_TAG_member
    2599        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$65)
    2600        .dwattr $C$DW$147, DW_AT_name("$P$T2")
    2601        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T2")
    2602        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2603        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2604        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2605        .dwattr $C$DW$147, DW_AT_decl_line(0x41)
    2606        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2607
    2608$C$DW$148       .dwtag  DW_TAG_member
    2609        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$67)
    2610        .dwattr $C$DW$148, DW_AT_name("$P$T3")
    2611        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T3")
    2612        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2613        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2614        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2615        .dwattr $C$DW$148, DW_AT_decl_line(0x54)
    2616        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2617
    2618$C$DW$149       .dwtag  DW_TAG_member
    2619        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$69)
    2620        .dwattr $C$DW$149, DW_AT_name("$P$T4")
    2621        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T4")
    2622        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2623        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2624        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2625        .dwattr $C$DW$149, DW_AT_decl_line(0x67)
    2626        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2627
    2628$C$DW$150       .dwtag  DW_TAG_member
    2629        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$71)
    2630        .dwattr $C$DW$150, DW_AT_name("$P$T5")
    2631        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T5")
    2632        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2633        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2634        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   49

    2635        .dwattr $C$DW$150, DW_AT_decl_line(0x83)
    2636        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2637
    2638$C$DW$151       .dwtag  DW_TAG_member
    2639        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$73)
    2640        .dwattr $C$DW$151, DW_AT_name("$P$T6")
    2641        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T6")
    2642        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2643        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2644        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2645        .dwattr $C$DW$151, DW_AT_decl_line(0x92)
    2646        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2647
    2648$C$DW$152       .dwtag  DW_TAG_member
    2649        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$75)
    2650        .dwattr $C$DW$152, DW_AT_name("$P$T7")
    2651        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T7")
    2652        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2653        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2654        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2655        .dwattr $C$DW$152, DW_AT_decl_line(0xa0)
    2656        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2657
    2658$C$DW$153       .dwtag  DW_TAG_member
    2659        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$77)
    2660        .dwattr $C$DW$153, DW_AT_name("$P$T8")
    2661        .dwattr $C$DW$153, DW_AT_TI_symbol_name("$P$T8")
    2662        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2663        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2664        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2665        .dwattr $C$DW$153, DW_AT_decl_line(0xaf)
    2666        .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    2667
    2668$C$DW$154       .dwtag  DW_TAG_member
    2669        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
    2670        .dwattr $C$DW$154, DW_AT_name("rsvd24")
    2671        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd24")
    2672        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2673        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2674        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2675        .dwattr $C$DW$154, DW_AT_decl_line(0xbc)
    2676        .dwattr $C$DW$154, DW_AT_decl_column(0x0b)
    2677
    2678$C$DW$155       .dwtag  DW_TAG_member
    2679        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$79)
    2680        .dwattr $C$DW$155, DW_AT_name("$P$T9")
    2681        .dwattr $C$DW$155, DW_AT_TI_symbol_name("$P$T9")
    2682        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2683        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2684        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2685        .dwattr $C$DW$155, DW_AT_decl_line(0xc0)
    2686        .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    2687
    2688$C$DW$156       .dwtag  DW_TAG_member
    2689        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   50

    2690        .dwattr $C$DW$156, DW_AT_name("rsvd2c")
    2691        .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd2c")
    2692        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2693        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2694        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2695        .dwattr $C$DW$156, DW_AT_decl_line(0xcb)
    2696        .dwattr $C$DW$156, DW_AT_decl_column(0x0b)
    2697
    2698$C$DW$157       .dwtag  DW_TAG_member
    2699        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$81)
    2700        .dwattr $C$DW$157, DW_AT_name("$P$T10")
    2701        .dwattr $C$DW$157, DW_AT_TI_symbol_name("$P$T10")
    2702        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2703        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2704        .dwattr $C$DW$157, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2705        .dwattr $C$DW$157, DW_AT_decl_line(0xcf)
    2706        .dwattr $C$DW$157, DW_AT_decl_column(0x02)
    2707
    2708$C$DW$158       .dwtag  DW_TAG_member
    2709        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$83)
    2710        .dwattr $C$DW$158, DW_AT_name("$P$T11")
    2711        .dwattr $C$DW$158, DW_AT_TI_symbol_name("$P$T11")
    2712        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2713        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2714        .dwattr $C$DW$158, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2715        .dwattr $C$DW$158, DW_AT_decl_line(0xda)
    2716        .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    2717
    2718$C$DW$159       .dwtag  DW_TAG_member
    2719        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$34)
    2720        .dwattr $C$DW$159, DW_AT_name("rsvd38")
    2721        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd38")
    2722        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2723        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2724        .dwattr $C$DW$159, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2725        .dwattr $C$DW$159, DW_AT_decl_line(0xe5)
    2726        .dwattr $C$DW$159, DW_AT_decl_column(0x0b)
    2727
    2728$C$DW$160       .dwtag  DW_TAG_member
    2729        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$85)
    2730        .dwattr $C$DW$160, DW_AT_name("$P$T12")
    2731        .dwattr $C$DW$160, DW_AT_TI_symbol_name("$P$T12")
    2732        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2733        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2734        .dwattr $C$DW$160, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2735        .dwattr $C$DW$160, DW_AT_decl_line(0xe8)
    2736        .dwattr $C$DW$160, DW_AT_decl_column(0x02)
    2737
    2738        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2739        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2740        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2741        .dwendtag $C$DW$T$35
    2742
    2743$C$DW$T$95      .dwtag  DW_TAG_typedef
    2744        .dwattr $C$DW$T$95, DW_AT_name("pruCfg")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   51

    2745        .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$35)
    2746        .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2747        .dwattr $C$DW$T$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2748        .dwattr $C$DW$T$95, DW_AT_decl_line(0xf0)
    2749        .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2750
    2751$C$DW$T$96      .dwtag  DW_TAG_volatile_type
    2752        .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    2753
    2754
    2755$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2756        .dwattr $C$DW$T$36, DW_AT_byte_size(0x40000)
    2757$C$DW$161       .dwtag  DW_TAG_member
    2758        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$88)
    2759        .dwattr $C$DW$161, DW_AT_name("$P$T13")
    2760        .dwattr $C$DW$161, DW_AT_TI_symbol_name("$P$T13")
    2761        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2763        .dwattr $C$DW$161, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/u
    2764        .dwattr $C$DW$161, DW_AT_decl_line(0x34)
    2765        .dwattr $C$DW$161, DW_AT_decl_column(0x02)
    2766
    2767        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2768        .dwattr $C$DW$T$36, DW_AT_decl_line(0x33)
    2769        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2770        .dwendtag $C$DW$T$36
    2771
    2772$C$DW$T$37      .dwtag  DW_TAG_typedef
    2773        .dwattr $C$DW$T$37, DW_AT_name("unibus_memory_t")
    2774        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2775        .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2776        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2777        .dwattr $C$DW$T$37, DW_AT_decl_line(0x38)
    2778        .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    2779
    2780
    2781$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2782        .dwattr $C$DW$T$38, DW_AT_byte_size(0x40000)
    2783$C$DW$162       .dwtag  DW_TAG_member
    2784        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$37)
    2785        .dwattr $C$DW$162, DW_AT_name("memory")
    2786        .dwattr $C$DW$162, DW_AT_TI_symbol_name("memory")
    2787        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2788        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2789        .dwattr $C$DW$162, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/d
    2790        .dwattr $C$DW$162, DW_AT_decl_line(0x17)
    2791        .dwattr $C$DW$162, DW_AT_decl_column(0x12)
    2792
    2793        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2794        .dwattr $C$DW$T$38, DW_AT_decl_line(0x14)
    2795        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2796        .dwendtag $C$DW$T$38
    2797
    2798$C$DW$T$48      .dwtag  DW_TAG_typedef
    2799        .dwattr $C$DW$T$48, DW_AT_name("ddrmem_t")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   52

    2800        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$38)
    2801        .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2802        .dwattr $C$DW$T$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2803        .dwattr $C$DW$T$48, DW_AT_decl_line(0x18)
    2804        .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    2805
    2806$C$DW$T$49      .dwtag  DW_TAG_volatile_type
    2807        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2808
    2809$C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2810        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2811        .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2812
    2813
    2814$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2815        .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    2816$C$DW$163       .dwtag  DW_TAG_member
    2817        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$39)
    2818        .dwattr $C$DW$163, DW_AT_name("eventmask")
    2819        .dwattr $C$DW$163, DW_AT_TI_symbol_name("eventmask")
    2820        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2821        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2822        .dwattr $C$DW$163, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2823        .dwattr $C$DW$163, DW_AT_decl_line(0x7a)
    2824        .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2825
    2826$C$DW$164       .dwtag  DW_TAG_member
    2827        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$39)
    2828        .dwattr $C$DW$164, DW_AT_name("unibus_control")
    2829        .dwattr $C$DW$164, DW_AT_TI_symbol_name("unibus_control")
    2830        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2831        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2832        .dwattr $C$DW$164, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2833        .dwattr $C$DW$164, DW_AT_decl_line(0x7d)
    2834        .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    2835
    2836$C$DW$165       .dwtag  DW_TAG_member
    2837        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$39)
    2838        .dwattr $C$DW$165, DW_AT_name("device_handle")
    2839        .dwattr $C$DW$165, DW_AT_TI_symbol_name("device_handle")
    2840        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2841        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2842        .dwattr $C$DW$165, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2843        .dwattr $C$DW$165, DW_AT_decl_line(0x7f)
    2844        .dwattr $C$DW$165, DW_AT_decl_column(0x0a)
    2845
    2846$C$DW$166       .dwtag  DW_TAG_member
    2847        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$39)
    2848        .dwattr $C$DW$166, DW_AT_name("device_register_idx")
    2849        .dwattr $C$DW$166, DW_AT_TI_symbol_name("device_register_idx")
    2850        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2851        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2852        .dwattr $C$DW$166, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2853        .dwattr $C$DW$166, DW_AT_decl_line(0x81)
    2854        .dwattr $C$DW$166, DW_AT_decl_column(0x0a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   53

    2855
    2856$C$DW$167       .dwtag  DW_TAG_member
    2857        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2858        .dwattr $C$DW$167, DW_AT_name("addr")
    2859        .dwattr $C$DW$167, DW_AT_TI_symbol_name("addr")
    2860        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2861        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2862        .dwattr $C$DW$167, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2863        .dwattr $C$DW$167, DW_AT_decl_line(0x83)
    2864        .dwattr $C$DW$167, DW_AT_decl_column(0x0b)
    2865
    2866$C$DW$168       .dwtag  DW_TAG_member
    2867        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$40)
    2868        .dwattr $C$DW$168, DW_AT_name("data")
    2869        .dwattr $C$DW$168, DW_AT_TI_symbol_name("data")
    2870        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2871        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2872        .dwattr $C$DW$168, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2873        .dwattr $C$DW$168, DW_AT_decl_line(0x84)
    2874        .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    2875
    2876$C$DW$169       .dwtag  DW_TAG_member
    2877        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$39)
    2878        .dwattr $C$DW$169, DW_AT_name("initialization_signals_prev")
    2879        .dwattr $C$DW$169, DW_AT_TI_symbol_name("initialization_signals_prev")
    2880        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2881        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2882        .dwattr $C$DW$169, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2883        .dwattr $C$DW$169, DW_AT_decl_line(0x87)
    2884        .dwattr $C$DW$169, DW_AT_decl_column(0x0a)
    2885
    2886$C$DW$170       .dwtag  DW_TAG_member
    2887        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$39)
    2888        .dwattr $C$DW$170, DW_AT_name("initialization_signals_cur")
    2889        .dwattr $C$DW$170, DW_AT_TI_symbol_name("initialization_signals_cur")
    2890        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2891        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2892        .dwattr $C$DW$170, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2893        .dwattr $C$DW$170, DW_AT_decl_line(0x88)
    2894        .dwattr $C$DW$170, DW_AT_decl_column(0x0a)
    2895
    2896        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2897        .dwattr $C$DW$T$41, DW_AT_decl_line(0x79)
    2898        .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    2899        .dwendtag $C$DW$T$41
    2900
    2901$C$DW$T$51      .dwtag  DW_TAG_typedef
    2902        .dwattr $C$DW$T$51, DW_AT_name("mailbox_events_t")
    2903        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$41)
    2904        .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2905        .dwattr $C$DW$T$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2906        .dwattr $C$DW$T$51, DW_AT_decl_line(0x8b)
    2907        .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2908
    2909
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:32 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_iopageregisters.asm                                             PAGE   54

    2910$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2911        .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    2912$C$DW$171       .dwtag  DW_TAG_member
    2913        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$32)
    2914        .dwattr $C$DW$171, DW_AT_name("addr")
    2915        .dwattr $C$DW$171, DW_AT_TI_symbol_name("addr")
    2916        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2917        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2918        .dwattr $C$DW$171, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2919        .dwattr $C$DW$171, DW_AT_decl_line(0x4c)
    2920        .dwattr $C$DW$171, DW_AT_decl_column(0x0b)
    2921
    2922$C$DW$172       .dwtag  DW_TAG_member
    2923        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$32)
    2924        .dwattr $C$DW$172, DW_AT_name("val")
    2925        .dwattr $C$DW$172, DW_AT_TI_symbol_name("val")
    2926        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2927        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2928        .dwattr $C$DW$172, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2929        .dwattr $C$DW$172, DW_AT_decl_line(0x4d)
    2930        .dwattr $C$DW$172, DW_AT_decl_column(0x0b)
    2931
    2932        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2933        .dwattr $C$DW$T$42, DW_AT_decl_line(0x4b)
    2934        .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2935        .dwendtag $C$DW$T$42
    2936
    2937$C$DW$T$89      .dwtag  DW_TAG_typedef
    2938        .dwattr $C$DW$T$89, DW_AT_name("mailbox_test_t")
    2939        .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    2940        .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2941        .dwattr $C$DW$T$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2942        .dwattr $C$DW$T$89, DW_AT_decl_line(0x4e)
    2943        .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2944
    2945
    2946$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2947        .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    2948$C$DW$173       .dwtag  DW_TAG_member
    2949        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$32)
    2950        .dwattr $C$DW$173, DW_AT_name("addr")
    2951        .dwattr $C$DW$173, DW_AT_TI_symbol_name("addr")
    2952        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2954        .dwattr $C$DW$173, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2955        .dwattr $C$DW$173, DW_AT_decl_line(0x51)
    2956        .dwattr $C$DW$173, DW_AT_decl_column(0x0b)
    2957
    2958$C$DW$174       .dwtag  DW_TAG_member
    2959        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$32)
    2960        .dwattr $C$DW$174, DW_AT_name("bitmask")
    2961        .dwattr $C$DW$174, DW_AT_TI_symbol_name("bitmask")
