PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:37 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_intr.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13$C$DW$1 .dwtag  DW_TAG_variable
      14        .dwattr $C$DW$1, DW_AT_name("mailbox")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("mailbox")
      16        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$98)
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external

     696        .dwcfi  restore_reg, 30
     697        .dwcfi  restore_reg, 31
     698        .dwcfi  restore_reg, 32
     699        .dwcfi  restore_reg, 33
     700        .dwcfi  restore_reg, 34
     701        .dwcfi  restore_reg, 35
     702 000000d0 0000000116E2E2          ADD       r2, r2, 0x16          ; [ALU_PRU] 
     703        .dwcfi  cfa_offset, 0
     704$C$DW$37        .dwtag  DW_TAG_TI_branch
     705        .dwattr $C$DW$37, DW_AT_low_pc(0x00)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   14

     706        .dwattr $C$DW$37, DW_AT_TI_return
     707
     708 000000d4 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     709        .dwattr $C$DW$24, DW_AT_TI_end_file("pru1_statemachine_intr.c")
     710        .dwattr $C$DW$24, DW_AT_TI_end_line(0x50)
     711        .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     712        .dwendentry
     713        .dwendtag $C$DW$24
     714
     715 00000000                         .sect   ".text:sm_intr_start"
     716        .clink
     717        .global ||sm_intr_start||
     718
     719$C$DW$38        .dwtag  DW_TAG_subprogram
     720        .dwattr $C$DW$38, DW_AT_name("sm_intr_start")
     721        .dwattr $C$DW$38, DW_AT_low_pc(||sm_intr_start||)
     722        .dwattr $C$DW$38, DW_AT_high_pc(0x00)
     723        .dwattr $C$DW$38, DW_AT_TI_symbol_name("sm_intr_start")
     724        .dwattr $C$DW$38, DW_AT_external
     725        .dwattr $C$DW$38, DW_AT_TI_begin_file("pru1_statemachine_intr.c")
     726        .dwattr $C$DW$38, DW_AT_TI_begin_line(0x33)
     727        .dwattr $C$DW$38, DW_AT_TI_begin_column(0x06)
     728        .dwattr $C$DW$38, DW_AT_decl_file("pru1_statemachine_intr.c")
     729        .dwattr $C$DW$38, DW_AT_decl_line(0x33)
     730        .dwattr $C$DW$38, DW_AT_decl_column(0x06)
     731        .dwattr $C$DW$38, DW_AT_TI_max_frame_size(0x00)
     732        .dwpsn  file "pru1_statemachine_intr.c",line 51,column 22,is_stmt,address ||sm_intr_start||,is
     733
     734        .dwfde $C$DW$CIE, ||sm_intr_start||
     735;----------------------------------------------------------------------
     736;  51 | void sm_intr_start() {                                                 
     737;  52 | //  BBSY already asserted. : latch[1], bit 6                           
     738;  53 | // buslatches_setbits(1, BIT(6), BIT(6));                              
     739;----------------------------------------------------------------------
     740
     741;***************************************************************
     742;* FNAME: sm_intr_start                 FR SIZE:   0           *
     743;*                                                             *
     744;* FUNCTION ENVIRONMENT                                        *
     745;*                                                             *
     746;* FUNCTION PROPERTIES                                         *
     747;*                            0 Auto,  0 SOE     *
     748;***************************************************************
     749
     750 00000000                 ||sm_intr_start||:
     751;* --------------------------------------------------------------------------*
     752        .dwcfi  cfa_offset, 0
     753;*** 54 -----------------------    sm_intr.state = &sm_intr_state_1;
     754;***    -----------------------    return;
     755        .dwpsn  file "pru1_statemachine_intr.c",line 54,column 2,is_stmt,isa 0
     756;----------------------------------------------------------------------
     757;  54 | sm_intr.state = &sm_intr_state_1;                                      
     758;  55 | // next call to sm_intr.state() starts state machine                   
     759;----------------------------------------------------------------------
     760 00000000 000000240000E0!         LDI       r0, ||sm_intr||       ; [ALU_PRU] |54| sm_intr
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   15

     761 00000004 00000024000081!         LDI       r1.w0, $CODE(||sm_intr_state_1||) ; [ALU_PRU] |54| sm_intr_state_1
     762 00000008 000000E1000081          SBBO      &r1.w0, r0, 0, 2      ; [ALU_PRU] |54| 
     763$C$DW$39        .dwtag  DW_TAG_TI_branch
     764        .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     765        .dwattr $C$DW$39, DW_AT_TI_return
     766
     767 0000000c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     768        .dwattr $C$DW$38, DW_AT_TI_end_file("pru1_statemachine_intr.c")
     769        .dwattr $C$DW$38, DW_AT_TI_end_line(0x38)
     770        .dwattr $C$DW$38, DW_AT_TI_end_column(0x01)
     771        .dwendentry
     772        .dwendtag $C$DW$38
     773
     774;*****************************************************************************
     775;* UNDEFINED EXTERNAL REFERENCES                                             *
     776;*****************************************************************************
     777        .global ||mailbox||
     778        .global ||buslatches||
     779        .global ||buslatches_pru0_dataout||
     780
     781;******************************************************************************
     782;* TYPE INFORMATION                                                           *
     783;******************************************************************************
     784
     785$C$DW$T$19      .dwtag  DW_TAG_structure_type
     786        .dwattr $C$DW$T$19, DW_AT_byte_size(0x40000)
     787$C$DW$40        .dwtag  DW_TAG_member
     788        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$61)
     789        .dwattr $C$DW$40, DW_AT_name("$P$T0")
     790        .dwattr $C$DW$40, DW_AT_TI_symbol_name("$P$T0")
     791        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     793        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     794        .dwattr $C$DW$40, DW_AT_decl_line(0x34)
     795        .dwattr $C$DW$40, DW_AT_decl_column(0x02)
     796
     797        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     798        .dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
     799        .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     800        .dwendtag $C$DW$T$19
     801
     802$C$DW$T$20      .dwtag  DW_TAG_typedef
     803        .dwattr $C$DW$T$20, DW_AT_name("unibus_memory_t")
     804        .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
     805        .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     806        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     807        .dwattr $C$DW$T$20, DW_AT_decl_line(0x38)
     808        .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
     809
     810
     811$C$DW$T$21      .dwtag  DW_TAG_structure_type
     812        .dwattr $C$DW$T$21, DW_AT_byte_size(0x40000)
     813$C$DW$41        .dwtag  DW_TAG_member
     814        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     815        .dwattr $C$DW$41, DW_AT_name("memory")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   16

     816        .dwattr $C$DW$41, DW_AT_TI_symbol_name("memory")
     817        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     819        .dwattr $C$DW$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/dd
     820        .dwattr $C$DW$41, DW_AT_decl_line(0x17)
     821        .dwattr $C$DW$41, DW_AT_decl_column(0x12)
     822
     823        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     824        .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
     825        .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     826        .dwendtag $C$DW$T$21
     827
     828$C$DW$T$32      .dwtag  DW_TAG_typedef
     829        .dwattr $C$DW$T$32, DW_AT_name("ddrmem_t")
     830        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
     831        .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     832        .dwattr $C$DW$T$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     833        .dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
     834        .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
     835
     836$C$DW$T$33      .dwtag  DW_TAG_volatile_type
     837        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     838
     839$C$DW$T$34      .dwtag  DW_TAG_pointer_type
     840        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     841        .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
     842
     843
     844$C$DW$T$25      .dwtag  DW_TAG_structure_type
     845        .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
     846$C$DW$42        .dwtag  DW_TAG_member
     847        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
     848        .dwattr $C$DW$42, DW_AT_name("eventmask")
     849        .dwattr $C$DW$42, DW_AT_TI_symbol_name("eventmask")
     850        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     852        .dwattr $C$DW$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     853        .dwattr $C$DW$42, DW_AT_decl_line(0x7a)
     854        .dwattr $C$DW$42, DW_AT_decl_column(0x0a)
     855
     856$C$DW$43        .dwtag  DW_TAG_member
     857        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
     858        .dwattr $C$DW$43, DW_AT_name("unibus_control")
     859        .dwattr $C$DW$43, DW_AT_TI_symbol_name("unibus_control")
     860        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     861        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     862        .dwattr $C$DW$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     863        .dwattr $C$DW$43, DW_AT_decl_line(0x7d)
     864        .dwattr $C$DW$43, DW_AT_decl_column(0x0a)
     865
     866$C$DW$44        .dwtag  DW_TAG_member
     867        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
     868        .dwattr $C$DW$44, DW_AT_name("device_handle")
     869        .dwattr $C$DW$44, DW_AT_TI_symbol_name("device_handle")
     870        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   17

     871        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     872        .dwattr $C$DW$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     873        .dwattr $C$DW$44, DW_AT_decl_line(0x7f)
     874        .dwattr $C$DW$44, DW_AT_decl_column(0x0a)
     875
     876$C$DW$45        .dwtag  DW_TAG_member
     877        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
     878        .dwattr $C$DW$45, DW_AT_name("device_register_idx")
     879        .dwattr $C$DW$45, DW_AT_TI_symbol_name("device_register_idx")
     880        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     881        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     882        .dwattr $C$DW$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     883        .dwattr $C$DW$45, DW_AT_decl_line(0x81)
     884        .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     885
     886$C$DW$46        .dwtag  DW_TAG_member
     887        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     888        .dwattr $C$DW$46, DW_AT_name("addr")
     889        .dwattr $C$DW$46, DW_AT_TI_symbol_name("addr")
     890        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     891        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     892        .dwattr $C$DW$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     893        .dwattr $C$DW$46, DW_AT_decl_line(0x83)
     894        .dwattr $C$DW$46, DW_AT_decl_column(0x0b)
     895
     896$C$DW$47        .dwtag  DW_TAG_member
     897        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$24)
     898        .dwattr $C$DW$47, DW_AT_name("data")
     899        .dwattr $C$DW$47, DW_AT_TI_symbol_name("data")
     900        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     901        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     902        .dwattr $C$DW$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     903        .dwattr $C$DW$47, DW_AT_decl_line(0x84)
     904        .dwattr $C$DW$47, DW_AT_decl_column(0x0b)
     905
     906$C$DW$48        .dwtag  DW_TAG_member
     907        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     908        .dwattr $C$DW$48, DW_AT_name("initialization_signals_prev")
     909        .dwattr $C$DW$48, DW_AT_TI_symbol_name("initialization_signals_prev")
     910        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     911        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     912        .dwattr $C$DW$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     913        .dwattr $C$DW$48, DW_AT_decl_line(0x87)
     914        .dwattr $C$DW$48, DW_AT_decl_column(0x0a)
     915
     916$C$DW$49        .dwtag  DW_TAG_member
     917        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
     918        .dwattr $C$DW$49, DW_AT_name("initialization_signals_cur")
     919        .dwattr $C$DW$49, DW_AT_TI_symbol_name("initialization_signals_cur")
     920        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     921        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     922        .dwattr $C$DW$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     923        .dwattr $C$DW$49, DW_AT_decl_line(0x88)
     924        .dwattr $C$DW$49, DW_AT_decl_column(0x0a)
     925
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   18

     926        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     927        .dwattr $C$DW$T$25, DW_AT_decl_line(0x79)
     928        .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     929        .dwendtag $C$DW$T$25
     930
     931$C$DW$T$35      .dwtag  DW_TAG_typedef
     932        .dwattr $C$DW$T$35, DW_AT_name("mailbox_events_t")
     933        .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
     934        .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     935        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     936        .dwattr $C$DW$T$35, DW_AT_decl_line(0x8b)
     937        .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
     938
     939
     940$C$DW$T$26      .dwtag  DW_TAG_structure_type
     941        .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     942$C$DW$50        .dwtag  DW_TAG_member
     943        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$23)
     944        .dwattr $C$DW$50, DW_AT_name("addr")
     945        .dwattr $C$DW$50, DW_AT_TI_symbol_name("addr")
     946        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     948        .dwattr $C$DW$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     949        .dwattr $C$DW$50, DW_AT_decl_line(0x4c)
     950        .dwattr $C$DW$50, DW_AT_decl_column(0x0b)
     951
     952$C$DW$51        .dwtag  DW_TAG_member
     953        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$23)
     954        .dwattr $C$DW$51, DW_AT_name("val")
     955        .dwattr $C$DW$51, DW_AT_TI_symbol_name("val")
     956        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     957        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     958        .dwattr $C$DW$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     959        .dwattr $C$DW$51, DW_AT_decl_line(0x4d)
     960        .dwattr $C$DW$51, DW_AT_decl_column(0x0b)
     961
     962        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     963        .dwattr $C$DW$T$26, DW_AT_decl_line(0x4b)
     964        .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     965        .dwendtag $C$DW$T$26
     966
     967$C$DW$T$62      .dwtag  DW_TAG_typedef
     968        .dwattr $C$DW$T$62, DW_AT_name("mailbox_test_t")
     969        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
     970        .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     971        .dwattr $C$DW$T$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     972        .dwattr $C$DW$T$62, DW_AT_decl_line(0x4e)
     973        .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
     974
     975
     976$C$DW$T$27      .dwtag  DW_TAG_structure_type
     977        .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
     978$C$DW$52        .dwtag  DW_TAG_member
     979        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$23)
     980        .dwattr $C$DW$52, DW_AT_name("addr")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   19

     981        .dwattr $C$DW$52, DW_AT_TI_symbol_name("addr")
     982        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     984        .dwattr $C$DW$52, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     985        .dwattr $C$DW$52, DW_AT_decl_line(0x51)
     986        .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     987
     988$C$DW$53        .dwtag  DW_TAG_member
     989        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
     990        .dwattr $C$DW$53, DW_AT_name("bitmask")
     991        .dwattr $C$DW$53, DW_AT_TI_symbol_name("bitmask")
     992        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     993        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     994        .dwattr $C$DW$53, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     995        .dwattr $C$DW$53, DW_AT_decl_line(0x52)
     996        .dwattr $C$DW$53, DW_AT_decl_column(0x0b)
     997
     998$C$DW$54        .dwtag  DW_TAG_member
     999        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$23)
    1000        .dwattr $C$DW$54, DW_AT_name("val")
    1001        .dwattr $C$DW$54, DW_AT_TI_symbol_name("val")
    1002        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1003        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1004        .dwattr $C$DW$54, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1005        .dwattr $C$DW$54, DW_AT_decl_line(0x53)
    1006        .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
    1007
    1008        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1009        .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
    1010        .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1011        .dwendtag $C$DW$T$27
    1012
    1013$C$DW$T$63      .dwtag  DW_TAG_typedef
    1014        .dwattr $C$DW$T$63, DW_AT_name("mailbox_buslatch_t")
    1015        .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$27)
    1016        .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1017        .dwattr $C$DW$T$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1018        .dwattr $C$DW$T$63, DW_AT_decl_line(0x54)
    1019        .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    1020
    1021
    1022$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1023        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1024$C$DW$55        .dwtag  DW_TAG_member
    1025        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
    1026        .dwattr $C$DW$55, DW_AT_name("addr_0_7")
    1027        .dwattr $C$DW$55, DW_AT_TI_symbol_name("addr_0_7")
    1028        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1030        .dwattr $C$DW$55, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1031        .dwattr $C$DW$55, DW_AT_decl_line(0x57)
    1032        .dwattr $C$DW$55, DW_AT_decl_column(0x0a)
    1033
    1034$C$DW$56        .dwtag  DW_TAG_member
    1035        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   20

    1036        .dwattr $C$DW$56, DW_AT_name("addr_8_15")
    1037        .dwattr $C$DW$56, DW_AT_TI_symbol_name("addr_8_15")
    1038        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1039        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1040        .dwattr $C$DW$56, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1041        .dwattr $C$DW$56, DW_AT_decl_line(0x58)
    1042        .dwattr $C$DW$56, DW_AT_decl_column(0x0a)
    1043
    1044$C$DW$57        .dwtag  DW_TAG_member
    1045        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
    1046        .dwattr $C$DW$57, DW_AT_name("data_0_7")
    1047        .dwattr $C$DW$57, DW_AT_TI_symbol_name("data_0_7")
    1048        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1049        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1050        .dwattr $C$DW$57, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1051        .dwattr $C$DW$57, DW_AT_decl_line(0x59)
    1052        .dwattr $C$DW$57, DW_AT_decl_column(0x0a)
    1053
    1054$C$DW$58        .dwtag  DW_TAG_member
    1055        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
    1056        .dwattr $C$DW$58, DW_AT_name("data_8_15")
    1057        .dwattr $C$DW$58, DW_AT_TI_symbol_name("data_8_15")
    1058        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1059        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1060        .dwattr $C$DW$58, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1061        .dwattr $C$DW$58, DW_AT_decl_line(0x5a)
    1062        .dwattr $C$DW$58, DW_AT_decl_column(0x0a)
    1063
    1064        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1065        .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
    1066        .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1067        .dwendtag $C$DW$T$28
    1068
    1069$C$DW$T$64      .dwtag  DW_TAG_typedef
    1070        .dwattr $C$DW$T$64, DW_AT_name("mailbox_buslatch_test_t")
    1071        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$28)
    1072        .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1073        .dwattr $C$DW$T$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1074        .dwattr $C$DW$T$64, DW_AT_decl_line(0x5b)
    1075        .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    1076
    1077
    1078$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1079        .dwattr $C$DW$T$30, DW_AT_byte_size(0x40c)
    1080$C$DW$59        .dwtag  DW_TAG_member
    1081        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1082        .dwattr $C$DW$59, DW_AT_name("cur_status")
    1083        .dwattr $C$DW$59, DW_AT_TI_symbol_name("cur_status")
    1084        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1086        .dwattr $C$DW$59, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1087        .dwattr $C$DW$59, DW_AT_decl_line(0x61)
    1088        .dwattr $C$DW$59, DW_AT_decl_column(0x0a)
    1089
    1090$C$DW$60        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   21

    1091        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1092        .dwattr $C$DW$60, DW_AT_name("control")
    1093        .dwattr $C$DW$60, DW_AT_TI_symbol_name("control")
    1094        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1095        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1096        .dwattr $C$DW$60, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1097        .dwattr $C$DW$60, DW_AT_decl_line(0x62)
    1098        .dwattr $C$DW$60, DW_AT_decl_column(0x0a)
    1099
    1100$C$DW$61        .dwtag  DW_TAG_member
    1101        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$24)
    1102        .dwattr $C$DW$61, DW_AT_name("wordcount")
    1103        .dwattr $C$DW$61, DW_AT_TI_symbol_name("wordcount")
    1104        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1105        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1106        .dwattr $C$DW$61, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1107        .dwattr $C$DW$61, DW_AT_decl_line(0x63)
    1108        .dwattr $C$DW$61, DW_AT_decl_column(0x0b)
    1109
    1110$C$DW$62        .dwtag  DW_TAG_member
    1111        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
    1112        .dwattr $C$DW$62, DW_AT_name("cur_addr")
    1113        .dwattr $C$DW$62, DW_AT_TI_symbol_name("cur_addr")
    1114        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1115        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1116        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1117        .dwattr $C$DW$62, DW_AT_decl_line(0x64)
    1118        .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
    1119
    1120$C$DW$63        .dwtag  DW_TAG_member
    1121        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$23)
    1122        .dwattr $C$DW$63, DW_AT_name("startaddr")
    1123        .dwattr $C$DW$63, DW_AT_TI_symbol_name("startaddr")
    1124        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1125        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1126        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1127        .dwattr $C$DW$63, DW_AT_decl_line(0x65)
    1128        .dwattr $C$DW$63, DW_AT_decl_column(0x0b)
    1129
    1130$C$DW$64        .dwtag  DW_TAG_member
    1131        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$29)
    1132        .dwattr $C$DW$64, DW_AT_name("words")
    1133        .dwattr $C$DW$64, DW_AT_TI_symbol_name("words")
    1134        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1135        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1136        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1137        .dwattr $C$DW$64, DW_AT_decl_line(0x66)
    1138        .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
    1139
    1140        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1141        .dwattr $C$DW$T$30, DW_AT_decl_line(0x5f)
    1142        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1143        .dwendtag $C$DW$T$30
    1144
    1145$C$DW$T$65      .dwtag  DW_TAG_typedef
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   22

    1146        .dwattr $C$DW$T$65, DW_AT_name("mailbox_dma_t")
    1147        .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$30)
    1148        .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1149        .dwattr $C$DW$T$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1150        .dwattr $C$DW$T$65, DW_AT_decl_line(0x67)
    1151        .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    1152
    1153
    1154$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1155        .dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
    1156$C$DW$65        .dwtag  DW_TAG_member
    1157        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
    1158        .dwattr $C$DW$65, DW_AT_name("vector")
    1159        .dwattr $C$DW$65, DW_AT_TI_symbol_name("vector")
    1160        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1162        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1163        .dwattr $C$DW$65, DW_AT_decl_line(0x6b)
    1164        .dwattr $C$DW$65, DW_AT_decl_column(0x0b)
    1165
    1166$C$DW$66        .dwtag  DW_TAG_member
    1167        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1168        .dwattr $C$DW$66, DW_AT_name("priority_bit")
    1169        .dwattr $C$DW$66, DW_AT_TI_symbol_name("priority_bit")
    1170        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1171        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1172        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1173        .dwattr $C$DW$66, DW_AT_decl_line(0x6c)
    1174        .dwattr $C$DW$66, DW_AT_decl_column(0x0a)
    1175
    1176        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1177        .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
    1178        .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1179        .dwendtag $C$DW$T$31
    1180
    1181$C$DW$T$66      .dwtag  DW_TAG_typedef
    1182        .dwattr $C$DW$T$66, DW_AT_name("mailbox_intr_t")
    1183        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$31)
    1184        .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1185        .dwattr $C$DW$T$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1186        .dwattr $C$DW$T$66, DW_AT_decl_line(0x6d)
    1187        .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    1188
    1189
    1190$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1191        .dwattr $C$DW$T$36, DW_AT_byte_size(0x424)
    1192$C$DW$67        .dwtag  DW_TAG_member
    1193        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
    1194        .dwattr $C$DW$67, DW_AT_name("arm2pru_req")
    1195        .dwattr $C$DW$67, DW_AT_TI_symbol_name("arm2pru_req")
    1196        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1198        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1199        .dwattr $C$DW$67, DW_AT_decl_line(0x90)
    1200        .dwattr $C$DW$67, DW_AT_decl_column(0x0b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   23

    1201
    1202$C$DW$68        .dwtag  DW_TAG_member
    1203        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$23)
    1204        .dwattr $C$DW$68, DW_AT_name("arm2pru_resp")
    1205        .dwattr $C$DW$68, DW_AT_TI_symbol_name("arm2pru_resp")
    1206        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1207        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1208        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1209        .dwattr $C$DW$68, DW_AT_decl_line(0x91)
    1210        .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1211
    1212$C$DW$69        .dwtag  DW_TAG_member
    1213        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$34)
    1214        .dwattr $C$DW$69, DW_AT_name("ddrmem_base_physical")
    1215        .dwattr $C$DW$69, DW_AT_TI_symbol_name("ddrmem_base_physical")
    1216        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1217        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1218        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1219        .dwattr $C$DW$69, DW_AT_decl_line(0x94)
    1220        .dwattr $C$DW$69, DW_AT_decl_column(0x15)
    1221
    1222$C$DW$70        .dwtag  DW_TAG_member
    1223        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$35)
    1224        .dwattr $C$DW$70, DW_AT_name("events")
    1225        .dwattr $C$DW$70, DW_AT_TI_symbol_name("events")
    1226        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1227        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1228        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1229        .dwattr $C$DW$70, DW_AT_decl_line(0x97)
    1230        .dwattr $C$DW$70, DW_AT_decl_column(0x13)
    1231
    1232$C$DW$71        .dwtag  DW_TAG_member
    1233        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$67)
    1234        .dwattr $C$DW$71, DW_AT_name("$P$T1")
    1235        .dwattr $C$DW$71, DW_AT_TI_symbol_name("$P$T1")
    1236        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1237        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1238        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
    1239        .dwattr $C$DW$71, DW_AT_decl_line(0x9a)
    1240        .dwattr $C$DW$71, DW_AT_decl_column(0x02)
    1241
    1242        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1243        .dwattr $C$DW$T$36, DW_AT_decl_line(0x8d)
    1244        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1245        .dwendtag $C$DW$T$36
    1246
    1247$C$DW$T$97      .dwtag  DW_TAG_typedef
    1248        .dwattr $C$DW$T$97, DW_AT_name("mailbox_t")
    1249        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$36)
    1250        .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1251        .dwattr $C$DW$T$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    1252        .dwattr $C$DW$T$97, DW_AT_decl_line(0xa1)
    1253        .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    1254
    1255$C$DW$T$98      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   24

    1256        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    1257
    1258
    1259$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1260        .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    1261$C$DW$72        .dwtag  DW_TAG_member
    1262        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$37)
    1263        .dwattr $C$DW$72, DW_AT_name("cur_reg_val")
    1264        .dwattr $C$DW$72, DW_AT_TI_symbol_name("cur_reg_val")
    1265        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1267        .dwattr $C$DW$72, DW_AT_decl_file("pru1_buslatches.h")
    1268        .dwattr $C$DW$72, DW_AT_decl_line(0x22)
    1269        .dwattr $C$DW$72, DW_AT_decl_column(0x0a)
    1270
    1271$C$DW$73        .dwtag  DW_TAG_member
    1272        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$37)
    1273        .dwattr $C$DW$73, DW_AT_name("bidi_bitwidth")
    1274        .dwattr $C$DW$73, DW_AT_TI_symbol_name("bidi_bitwidth")
    1275        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1276        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1277        .dwattr $C$DW$73, DW_AT_decl_file("pru1_buslatches.h")
    1278        .dwattr $C$DW$73, DW_AT_decl_line(0x26)
    1279        .dwattr $C$DW$73, DW_AT_decl_column(0x0a)
    1280
    1281        .dwattr $C$DW$T$38, DW_AT_decl_file("pru1_buslatches.h")
    1282        .dwattr $C$DW$T$38, DW_AT_decl_line(0x21)
    1283        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    1284        .dwendtag $C$DW$T$38
    1285
    1286$C$DW$T$100     .dwtag  DW_TAG_typedef
    1287        .dwattr $C$DW$T$100, DW_AT_name("buslatches_t")
    1288        .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$38)
    1289        .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1290        .dwattr $C$DW$T$100, DW_AT_decl_file("pru1_buslatches.h")
    1291        .dwattr $C$DW$T$100, DW_AT_decl_line(0x2c)
    1292        .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    1293
    1294
    1295$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1296        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1297$C$DW$74        .dwtag  DW_TAG_member
    1298        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1299        .dwattr $C$DW$74, DW_AT_name("REVID")
    1300        .dwattr $C$DW$74, DW_AT_TI_symbol_name("REVID")
    1301        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1302        .dwattr $C$DW$74, DW_AT_bit_size(0x20)
    1303        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1305        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1306        .dwattr $C$DW$74, DW_AT_decl_line(0x2d)
    1307        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1308
    1309        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1310        .dwattr $C$DW$T$39, DW_AT_decl_line(0x2c)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   25

    1311        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1312        .dwendtag $C$DW$T$39
    1313
    1314$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1315        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$39)
    1316
    1317
    1318$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1319        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1320$C$DW$75        .dwtag  DW_TAG_member
    1321        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1322        .dwattr $C$DW$75, DW_AT_name("IDLE_MODE")
    1323        .dwattr $C$DW$75, DW_AT_TI_symbol_name("IDLE_MODE")
    1324        .dwattr $C$DW$75, DW_AT_bit_offset(0x1e)
    1325        .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1326        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1328        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1329        .dwattr $C$DW$75, DW_AT_decl_line(0x37)
    1330        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1331
    1332$C$DW$76        .dwtag  DW_TAG_member
    1333        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1334        .dwattr $C$DW$76, DW_AT_name("STANDBY_MODE")
    1335        .dwattr $C$DW$76, DW_AT_TI_symbol_name("STANDBY_MODE")
    1336        .dwattr $C$DW$76, DW_AT_bit_offset(0x1c)
    1337        .dwattr $C$DW$76, DW_AT_bit_size(0x02)
    1338        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1340        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1341        .dwattr $C$DW$76, DW_AT_decl_line(0x38)
    1342        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1343
    1344$C$DW$77        .dwtag  DW_TAG_member
    1345        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1346        .dwattr $C$DW$77, DW_AT_name("STANDBY_INIT")
    1347        .dwattr $C$DW$77, DW_AT_TI_symbol_name("STANDBY_INIT")
    1348        .dwattr $C$DW$77, DW_AT_bit_offset(0x1b)
    1349        .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1350        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1352        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1353        .dwattr $C$DW$77, DW_AT_decl_line(0x39)
    1354        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1355
    1356$C$DW$78        .dwtag  DW_TAG_member
    1357        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1358        .dwattr $C$DW$78, DW_AT_name("SUB_MWAIT")
    1359        .dwattr $C$DW$78, DW_AT_TI_symbol_name("SUB_MWAIT")
    1360        .dwattr $C$DW$78, DW_AT_bit_offset(0x1a)
    1361        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1362        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1364        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1365        .dwattr $C$DW$78, DW_AT_decl_line(0x3a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   26

    1366        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1367
    1368$C$DW$79        .dwtag  DW_TAG_member
    1369        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1370        .dwattr $C$DW$79, DW_AT_name("rsvd6")
    1371        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd6")
    1372        .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1373        .dwattr $C$DW$79, DW_AT_bit_size(0x1a)
    1374        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1376        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1377        .dwattr $C$DW$79, DW_AT_decl_line(0x3b)
    1378        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1379
    1380        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1381        .dwattr $C$DW$T$40, DW_AT_decl_line(0x36)
    1382        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1383        .dwendtag $C$DW$T$40
    1384
    1385$C$DW$T$71      .dwtag  DW_TAG_volatile_type
    1386        .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$40)
    1387
    1388
    1389$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1390        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1391$C$DW$80        .dwtag  DW_TAG_member
    1392        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1393        .dwattr $C$DW$80, DW_AT_name("PRU0_GPI_MODE")
    1394        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1395        .dwattr $C$DW$80, DW_AT_bit_offset(0x1e)
    1396        .dwattr $C$DW$80, DW_AT_bit_size(0x02)
    1397        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1399        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1400        .dwattr $C$DW$80, DW_AT_decl_line(0x45)
    1401        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1402
    1403$C$DW$81        .dwtag  DW_TAG_member
    1404        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1405        .dwattr $C$DW$81, DW_AT_name("PRU0_GPI_CLK_MODE")
    1406        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1407        .dwattr $C$DW$81, DW_AT_bit_offset(0x1d)
    1408        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1409        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1411        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1412        .dwattr $C$DW$81, DW_AT_decl_line(0x46)
    1413        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1414
    1415$C$DW$82        .dwtag  DW_TAG_member
    1416        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1417        .dwattr $C$DW$82, DW_AT_name("PRU0_GPI_DIV0")
    1418        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1419        .dwattr $C$DW$82, DW_AT_bit_offset(0x18)
    1420        .dwattr $C$DW$82, DW_AT_bit_size(0x05)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   27

    1421        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1423        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1424        .dwattr $C$DW$82, DW_AT_decl_line(0x47)
    1425        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1426
    1427$C$DW$83        .dwtag  DW_TAG_member
    1428        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1429        .dwattr $C$DW$83, DW_AT_name("PRU0_GPI_DIV1")
    1430        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1431        .dwattr $C$DW$83, DW_AT_bit_offset(0x13)
    1432        .dwattr $C$DW$83, DW_AT_bit_size(0x05)
    1433        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1435        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1436        .dwattr $C$DW$83, DW_AT_decl_line(0x48)
    1437        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1438
    1439$C$DW$84        .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1441        .dwattr $C$DW$84, DW_AT_name("PRU0_GPI_SB")
    1442        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1443        .dwattr $C$DW$84, DW_AT_bit_offset(0x12)
    1444        .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1445        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1447        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1448        .dwattr $C$DW$84, DW_AT_decl_line(0x49)
    1449        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1450
    1451$C$DW$85        .dwtag  DW_TAG_member
    1452        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1453        .dwattr $C$DW$85, DW_AT_name("PRU0_GPO_MODE")
    1454        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1455        .dwattr $C$DW$85, DW_AT_bit_offset(0x11)
    1456        .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1457        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1459        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1460        .dwattr $C$DW$85, DW_AT_decl_line(0x4a)
    1461        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1462
    1463$C$DW$86        .dwtag  DW_TAG_member
    1464        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1465        .dwattr $C$DW$86, DW_AT_name("PRU0_GPO_DIV0")
    1466        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1467        .dwattr $C$DW$86, DW_AT_bit_offset(0x0c)
    1468        .dwattr $C$DW$86, DW_AT_bit_size(0x05)
    1469        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1471        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1472        .dwattr $C$DW$86, DW_AT_decl_line(0x4b)
    1473        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1474
    1475$C$DW$87        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   28

    1476        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1477        .dwattr $C$DW$87, DW_AT_name("PRU0_GPO_DIV1")
    1478        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1479        .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
    1480        .dwattr $C$DW$87, DW_AT_bit_size(0x05)
    1481        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1483        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1484        .dwattr $C$DW$87, DW_AT_decl_line(0x4c)
    1485        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1486
    1487$C$DW$88        .dwtag  DW_TAG_member
    1488        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1489        .dwattr $C$DW$88, DW_AT_name("PRU0_GPO_SH_SEL")
    1490        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1491        .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
    1492        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1493        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1496        .dwattr $C$DW$88, DW_AT_decl_line(0x4d)
    1497        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1498
    1499$C$DW$89        .dwtag  DW_TAG_member
    1500        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1501        .dwattr $C$DW$89, DW_AT_name("rsvd26")
    1502        .dwattr $C$DW$89, DW_AT_TI_symbol_name("rsvd26")
    1503        .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1504        .dwattr $C$DW$89, DW_AT_bit_size(0x06)
    1505        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1507        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1508        .dwattr $C$DW$89, DW_AT_decl_line(0x4e)
    1509        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1510
    1511        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1512        .dwattr $C$DW$T$41, DW_AT_decl_line(0x44)
    1513        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1514        .dwendtag $C$DW$T$41
    1515
    1516$C$DW$T$73      .dwtag  DW_TAG_volatile_type
    1517        .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$41)
    1518
    1519
    1520$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1521        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1522$C$DW$90        .dwtag  DW_TAG_member
    1523        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1524        .dwattr $C$DW$90, DW_AT_name("PRU1_GPI_MODE")
    1525        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1526        .dwattr $C$DW$90, DW_AT_bit_offset(0x1e)
    1527        .dwattr $C$DW$90, DW_AT_bit_size(0x02)
    1528        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1530        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   29

    1531        .dwattr $C$DW$90, DW_AT_decl_line(0x58)
    1532        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1533
    1534$C$DW$91        .dwtag  DW_TAG_member
    1535        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1536        .dwattr $C$DW$91, DW_AT_name("PRU1_GPI_CLK_MODE")
    1537        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1538        .dwattr $C$DW$91, DW_AT_bit_offset(0x1d)
    1539        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1540        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1542        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1543        .dwattr $C$DW$91, DW_AT_decl_line(0x59)
    1544        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1545
    1546$C$DW$92        .dwtag  DW_TAG_member
    1547        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1548        .dwattr $C$DW$92, DW_AT_name("PRU1_GPI_DIV0")
    1549        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1550        .dwattr $C$DW$92, DW_AT_bit_offset(0x18)
    1551        .dwattr $C$DW$92, DW_AT_bit_size(0x05)
    1552        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1554        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1555        .dwattr $C$DW$92, DW_AT_decl_line(0x5a)
    1556        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1557
    1558$C$DW$93        .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1560        .dwattr $C$DW$93, DW_AT_name("PRU1_GPI_DIV1")
    1561        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1562        .dwattr $C$DW$93, DW_AT_bit_offset(0x13)
    1563        .dwattr $C$DW$93, DW_AT_bit_size(0x05)
    1564        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1566        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1567        .dwattr $C$DW$93, DW_AT_decl_line(0x5b)
    1568        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1569
    1570$C$DW$94        .dwtag  DW_TAG_member
    1571        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1572        .dwattr $C$DW$94, DW_AT_name("PRU1_GPI_SB")
    1573        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1574        .dwattr $C$DW$94, DW_AT_bit_offset(0x12)
    1575        .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1576        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1578        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1579        .dwattr $C$DW$94, DW_AT_decl_line(0x5c)
    1580        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1581
    1582$C$DW$95        .dwtag  DW_TAG_member
    1583        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1584        .dwattr $C$DW$95, DW_AT_name("PRU1_GPO_MODE")
    1585        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   30

    1586        .dwattr $C$DW$95, DW_AT_bit_offset(0x11)
    1587        .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1588        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1590        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1591        .dwattr $C$DW$95, DW_AT_decl_line(0x5d)
    1592        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1593
    1594$C$DW$96        .dwtag  DW_TAG_member
    1595        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1596        .dwattr $C$DW$96, DW_AT_name("PRU1_GPO_DIV0")
    1597        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1598        .dwattr $C$DW$96, DW_AT_bit_offset(0x0c)
    1599        .dwattr $C$DW$96, DW_AT_bit_size(0x05)
    1600        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1602        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1603        .dwattr $C$DW$96, DW_AT_decl_line(0x5e)
    1604        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1605
    1606$C$DW$97        .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$97, DW_AT_name("PRU1_GPO_DIV1")
    1609        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1610        .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1611        .dwattr $C$DW$97, DW_AT_bit_size(0x05)
    1612        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1614        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1615        .dwattr $C$DW$97, DW_AT_decl_line(0x5f)
    1616        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1617
    1618$C$DW$98        .dwtag  DW_TAG_member
    1619        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1620        .dwattr $C$DW$98, DW_AT_name("PRU1_GPO_SH_SEL")
    1621        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1622        .dwattr $C$DW$98, DW_AT_bit_offset(0x06)
    1623        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1624        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1626        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1627        .dwattr $C$DW$98, DW_AT_decl_line(0x60)
    1628        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1629
    1630$C$DW$99        .dwtag  DW_TAG_member
    1631        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1632        .dwattr $C$DW$99, DW_AT_name("rsvd26")
    1633        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd26")
    1634        .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1635        .dwattr $C$DW$99, DW_AT_bit_size(0x06)
    1636        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1638        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1639        .dwattr $C$DW$99, DW_AT_decl_line(0x61)
    1640        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   31

    1641
    1642        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1643        .dwattr $C$DW$T$42, DW_AT_decl_line(0x57)
    1644        .dwattr $C$DW$T$42, DW_AT_decl_column(0x13)
    1645        .dwendtag $C$DW$T$42
    1646
    1647$C$DW$T$75      .dwtag  DW_TAG_volatile_type
    1648        .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$42)
    1649
    1650
    1651$C$DW$T$43      .dwtag  DW_TAG_structure_type
    1652        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    1653$C$DW$100       .dwtag  DW_TAG_member
    1654        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1655        .dwattr $C$DW$100, DW_AT_name("PRU0_CLK_STOP_REQ")
    1656        .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1657        .dwattr $C$DW$100, DW_AT_bit_offset(0x1f)
    1658        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1659        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1661        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1662        .dwattr $C$DW$100, DW_AT_decl_line(0x6b)
    1663        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1664
    1665$C$DW$101       .dwtag  DW_TAG_member
    1666        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1667        .dwattr $C$DW$101, DW_AT_name("PRU0_CLK_STOP_ACK")
    1668        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1669        .dwattr $C$DW$101, DW_AT_bit_offset(0x1e)
    1670        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1671        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1674        .dwattr $C$DW$101, DW_AT_decl_line(0x6c)
    1675        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1676
    1677$C$DW$102       .dwtag  DW_TAG_member
    1678        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1679        .dwattr $C$DW$102, DW_AT_name("PRU0_CLK_EN")
    1680        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1681        .dwattr $C$DW$102, DW_AT_bit_offset(0x1d)
    1682        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1683        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1685        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1686        .dwattr $C$DW$102, DW_AT_decl_line(0x6d)
    1687        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1688
    1689$C$DW$103       .dwtag  DW_TAG_member
    1690        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1691        .dwattr $C$DW$103, DW_AT_name("PRU1_CLK_STOP_REQ")
    1692        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1693        .dwattr $C$DW$103, DW_AT_bit_offset(0x1c)
    1694        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1695        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   32

    1696        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1697        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1698        .dwattr $C$DW$103, DW_AT_decl_line(0x6e)
    1699        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1700
    1701$C$DW$104       .dwtag  DW_TAG_member
    1702        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1703        .dwattr $C$DW$104, DW_AT_name("PRU1_CLK_STOP_ACK")
    1704        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1705        .dwattr $C$DW$104, DW_AT_bit_offset(0x1b)
    1706        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1707        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1709        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1710        .dwattr $C$DW$104, DW_AT_decl_line(0x6f)
    1711        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1712
    1713$C$DW$105       .dwtag  DW_TAG_member
    1714        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1715        .dwattr $C$DW$105, DW_AT_name("PRU1_CLK_EN")
    1716        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1717        .dwattr $C$DW$105, DW_AT_bit_offset(0x1a)
    1718        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1719        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1721        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1722        .dwattr $C$DW$105, DW_AT_decl_line(0x70)
    1723        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1724
    1725$C$DW$106       .dwtag  DW_TAG_member
    1726        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1727        .dwattr $C$DW$106, DW_AT_name("INTC_CLK_STOP_REQ")
    1728        .dwattr $C$DW$106, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1729        .dwattr $C$DW$106, DW_AT_bit_offset(0x19)
    1730        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1731        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1734        .dwattr $C$DW$106, DW_AT_decl_line(0x71)
    1735        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1736
    1737$C$DW$107       .dwtag  DW_TAG_member
    1738        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1739        .dwattr $C$DW$107, DW_AT_name("INTC_CLK_STOP_ACK")
    1740        .dwattr $C$DW$107, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1741        .dwattr $C$DW$107, DW_AT_bit_offset(0x18)
    1742        .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1743        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1745        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1746        .dwattr $C$DW$107, DW_AT_decl_line(0x72)
    1747        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1748
    1749$C$DW$108       .dwtag  DW_TAG_member
    1750        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   33

    1751        .dwattr $C$DW$108, DW_AT_name("INTC_CLK_EN")
    1752        .dwattr $C$DW$108, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1753        .dwattr $C$DW$108, DW_AT_bit_offset(0x17)
    1754        .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1755        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1757        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1758        .dwattr $C$DW$108, DW_AT_decl_line(0x73)
    1759        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1760
    1761$C$DW$109       .dwtag  DW_TAG_member
    1762        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1763        .dwattr $C$DW$109, DW_AT_name("UART_CLK_STOP_REQ")
    1764        .dwattr $C$DW$109, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1765        .dwattr $C$DW$109, DW_AT_bit_offset(0x16)
    1766        .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1767        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1769        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1770        .dwattr $C$DW$109, DW_AT_decl_line(0x74)
    1771        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1772
    1773$C$DW$110       .dwtag  DW_TAG_member
    1774        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1775        .dwattr $C$DW$110, DW_AT_name("UART_CLK_STOP_ACK")
    1776        .dwattr $C$DW$110, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1777        .dwattr $C$DW$110, DW_AT_bit_offset(0x15)
    1778        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1779        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1781        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1782        .dwattr $C$DW$110, DW_AT_decl_line(0x75)
    1783        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1784
    1785$C$DW$111       .dwtag  DW_TAG_member
    1786        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1787        .dwattr $C$DW$111, DW_AT_name("UART_CLK_EN")
    1788        .dwattr $C$DW$111, DW_AT_TI_symbol_name("UART_CLK_EN")
    1789        .dwattr $C$DW$111, DW_AT_bit_offset(0x14)
    1790        .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1791        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1793        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1794        .dwattr $C$DW$111, DW_AT_decl_line(0x76)
    1795        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1796
    1797$C$DW$112       .dwtag  DW_TAG_member
    1798        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1799        .dwattr $C$DW$112, DW_AT_name("ECAP_CLK_STOP_REQ")
    1800        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1801        .dwattr $C$DW$112, DW_AT_bit_offset(0x13)
    1802        .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1803        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1805        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   34

    1806        .dwattr $C$DW$112, DW_AT_decl_line(0x77)
    1807        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1808
    1809$C$DW$113       .dwtag  DW_TAG_member
    1810        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1811        .dwattr $C$DW$113, DW_AT_name("ECAP_CLK_STOP_ACK")
    1812        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1813        .dwattr $C$DW$113, DW_AT_bit_offset(0x12)
    1814        .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1815        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1817        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1818        .dwattr $C$DW$113, DW_AT_decl_line(0x78)
    1819        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1820
    1821$C$DW$114       .dwtag  DW_TAG_member
    1822        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1823        .dwattr $C$DW$114, DW_AT_name("ECAP_CLK_EN")
    1824        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1825        .dwattr $C$DW$114, DW_AT_bit_offset(0x11)
    1826        .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1827        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1829        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1830        .dwattr $C$DW$114, DW_AT_decl_line(0x79)
    1831        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1832
    1833$C$DW$115       .dwtag  DW_TAG_member
    1834        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1835        .dwattr $C$DW$115, DW_AT_name("IEP_CLK_STOP_REQ")
    1836        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1837        .dwattr $C$DW$115, DW_AT_bit_offset(0x10)
    1838        .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1839        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1841        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1842        .dwattr $C$DW$115, DW_AT_decl_line(0x7a)
    1843        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1844
    1845$C$DW$116       .dwtag  DW_TAG_member
    1846        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1847        .dwattr $C$DW$116, DW_AT_name("IEP_CLK_STOP_ACK")
    1848        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1849        .dwattr $C$DW$116, DW_AT_bit_offset(0x0f)
    1850        .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1851        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1853        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1854        .dwattr $C$DW$116, DW_AT_decl_line(0x7b)
    1855        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1856
    1857$C$DW$117       .dwtag  DW_TAG_member
    1858        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1859        .dwattr $C$DW$117, DW_AT_name("IEP_CLK_EN")
    1860        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IEP_CLK_EN")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   35

    1861        .dwattr $C$DW$117, DW_AT_bit_offset(0x0e)
    1862        .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1863        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1865        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1866        .dwattr $C$DW$117, DW_AT_decl_line(0x7c)
    1867        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1868
    1869$C$DW$118       .dwtag  DW_TAG_member
    1870        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1871        .dwattr $C$DW$118, DW_AT_name("rsvd18")
    1872        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd18")
    1873        .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1874        .dwattr $C$DW$118, DW_AT_bit_size(0x0e)
    1875        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1877        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1878        .dwattr $C$DW$118, DW_AT_decl_line(0x7d)
    1879        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1880
    1881        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1882        .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    1883        .dwattr $C$DW$T$43, DW_AT_decl_column(0x13)
    1884        .dwendtag $C$DW$T$43
    1885
    1886$C$DW$T$77      .dwtag  DW_TAG_volatile_type
    1887        .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$43)
    1888
    1889
    1890$C$DW$T$44      .dwtag  DW_TAG_structure_type
    1891        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1892$C$DW$119       .dwtag  DW_TAG_member
    1893        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1894        .dwattr $C$DW$119, DW_AT_name("PRU0_IMEM_PE_RAW")
    1895        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1896        .dwattr $C$DW$119, DW_AT_bit_offset(0x1c)
    1897        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1898        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1900        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1901        .dwattr $C$DW$119, DW_AT_decl_line(0x87)
    1902        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1903
    1904$C$DW$120       .dwtag  DW_TAG_member
    1905        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1906        .dwattr $C$DW$120, DW_AT_name("PRU0_DMEM_PE_RAW")
    1907        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1908        .dwattr $C$DW$120, DW_AT_bit_offset(0x18)
    1909        .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1910        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1912        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1913        .dwattr $C$DW$120, DW_AT_decl_line(0x88)
    1914        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1915
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   36

    1916$C$DW$121       .dwtag  DW_TAG_member
    1917        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1918        .dwattr $C$DW$121, DW_AT_name("PRU1_IMEM_PE_RAW")
    1919        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1920        .dwattr $C$DW$121, DW_AT_bit_offset(0x14)
    1921        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    1922        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1924        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1925        .dwattr $C$DW$121, DW_AT_decl_line(0x89)
    1926        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1927
    1928$C$DW$122       .dwtag  DW_TAG_member
    1929        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1930        .dwattr $C$DW$122, DW_AT_name("PRU1_DMEM_PE_RAW")
    1931        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1932        .dwattr $C$DW$122, DW_AT_bit_offset(0x10)
    1933        .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1934        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1936        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1937        .dwattr $C$DW$122, DW_AT_decl_line(0x8a)
    1938        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1939
    1940$C$DW$123       .dwtag  DW_TAG_member
    1941        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1942        .dwattr $C$DW$123, DW_AT_name("RAM_PE_RAW")
    1943        .dwattr $C$DW$123, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1944        .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1945        .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    1946        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1948        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1949        .dwattr $C$DW$123, DW_AT_decl_line(0x8b)
    1950        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1951
    1952$C$DW$124       .dwtag  DW_TAG_member
    1953        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1954        .dwattr $C$DW$124, DW_AT_name("rsvd20")
    1955        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd20")
    1956        .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1957        .dwattr $C$DW$124, DW_AT_bit_size(0x0c)
    1958        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1960        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1961        .dwattr $C$DW$124, DW_AT_decl_line(0x8c)
    1962        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1963
    1964        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1965        .dwattr $C$DW$T$44, DW_AT_decl_line(0x86)
    1966        .dwattr $C$DW$T$44, DW_AT_decl_column(0x14)
    1967        .dwendtag $C$DW$T$44
    1968
    1969$C$DW$T$79      .dwtag  DW_TAG_volatile_type
    1970        .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$44)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   37

    1971
    1972
    1973$C$DW$T$45      .dwtag  DW_TAG_structure_type
    1974        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    1975$C$DW$125       .dwtag  DW_TAG_member
    1976        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1977        .dwattr $C$DW$125, DW_AT_name("PRU0_IMEM_PE")
    1978        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1979        .dwattr $C$DW$125, DW_AT_bit_offset(0x1c)
    1980        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1981        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1984        .dwattr $C$DW$125, DW_AT_decl_line(0x96)
    1985        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1986
    1987$C$DW$126       .dwtag  DW_TAG_member
    1988        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1989        .dwattr $C$DW$126, DW_AT_name("PRU0_DMEM_PE")
    1990        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1991        .dwattr $C$DW$126, DW_AT_bit_offset(0x18)
    1992        .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1993        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1995        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1996        .dwattr $C$DW$126, DW_AT_decl_line(0x97)
    1997        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1998
    1999$C$DW$127       .dwtag  DW_TAG_member
    2000        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2001        .dwattr $C$DW$127, DW_AT_name("PRU1_IMEM_PE")
    2002        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    2003        .dwattr $C$DW$127, DW_AT_bit_offset(0x14)
    2004        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    2005        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2007        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2008        .dwattr $C$DW$127, DW_AT_decl_line(0x98)
    2009        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2010
    2011$C$DW$128       .dwtag  DW_TAG_member
    2012        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2013        .dwattr $C$DW$128, DW_AT_name("PRU1_DMEM_PE")
    2014        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    2015        .dwattr $C$DW$128, DW_AT_bit_offset(0x10)
    2016        .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    2017        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2019        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2020        .dwattr $C$DW$128, DW_AT_decl_line(0x99)
    2021        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2022
    2023$C$DW$129       .dwtag  DW_TAG_member
    2024        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2025        .dwattr $C$DW$129, DW_AT_name("RAM_PE")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   38

    2026        .dwattr $C$DW$129, DW_AT_TI_symbol_name("RAM_PE")
    2027        .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    2028        .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    2029        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2031        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2032        .dwattr $C$DW$129, DW_AT_decl_line(0x9a)
    2033        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2034
    2035$C$DW$130       .dwtag  DW_TAG_member
    2036        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2037        .dwattr $C$DW$130, DW_AT_name("rsvd20")
    2038        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd20")
    2039        .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2040        .dwattr $C$DW$130, DW_AT_bit_size(0x0c)
    2041        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2043        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2044        .dwattr $C$DW$130, DW_AT_decl_line(0x9b)
    2045        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2046
    2047        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2048        .dwattr $C$DW$T$45, DW_AT_decl_line(0x95)
    2049        .dwattr $C$DW$T$45, DW_AT_decl_column(0x14)
    2050        .dwendtag $C$DW$T$45
    2051
    2052$C$DW$T$81      .dwtag  DW_TAG_volatile_type
    2053        .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$45)
    2054
    2055
    2056$C$DW$T$46      .dwtag  DW_TAG_structure_type
    2057        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    2058$C$DW$131       .dwtag  DW_TAG_member
    2059        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2060        .dwattr $C$DW$131, DW_AT_name("PRU0_IMEM_PE_SET")
    2061        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    2062        .dwattr $C$DW$131, DW_AT_bit_offset(0x1c)
    2063        .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    2064        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2066        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2067        .dwattr $C$DW$131, DW_AT_decl_line(0xa4)
    2068        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2069
    2070$C$DW$132       .dwtag  DW_TAG_member
    2071        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2072        .dwattr $C$DW$132, DW_AT_name("PRU0_DMEM_PE_SET")
    2073        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    2074        .dwattr $C$DW$132, DW_AT_bit_offset(0x18)
    2075        .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    2076        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2078        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2079        .dwattr $C$DW$132, DW_AT_decl_line(0xa5)
    2080        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   39

    2081
    2082$C$DW$133       .dwtag  DW_TAG_member
    2083        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2084        .dwattr $C$DW$133, DW_AT_name("PRU1_IMEM_PE_SET")
    2085        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2086        .dwattr $C$DW$133, DW_AT_bit_offset(0x14)
    2087        .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    2088        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2090        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2091        .dwattr $C$DW$133, DW_AT_decl_line(0xa6)
    2092        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2093
    2094$C$DW$134       .dwtag  DW_TAG_member
    2095        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2096        .dwattr $C$DW$134, DW_AT_name("PRU1_DMEM_PE_SET")
    2097        .dwattr $C$DW$134, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2098        .dwattr $C$DW$134, DW_AT_bit_offset(0x10)
    2099        .dwattr $C$DW$134, DW_AT_bit_size(0x04)
    2100        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2102        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2103        .dwattr $C$DW$134, DW_AT_decl_line(0xa7)
    2104        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2105
    2106$C$DW$135       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2108        .dwattr $C$DW$135, DW_AT_name("RAM_PE_SET")
    2109        .dwattr $C$DW$135, DW_AT_TI_symbol_name("RAM_PE_SET")
    2110        .dwattr $C$DW$135, DW_AT_bit_offset(0x0c)
    2111        .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    2112        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2114        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2115        .dwattr $C$DW$135, DW_AT_decl_line(0xa8)
    2116        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2117
    2118$C$DW$136       .dwtag  DW_TAG_member
    2119        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2120        .dwattr $C$DW$136, DW_AT_name("rsvd20")
    2121        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd20")
    2122        .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2123        .dwattr $C$DW$136, DW_AT_bit_size(0x0c)
    2124        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2126        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2127        .dwattr $C$DW$136, DW_AT_decl_line(0xa9)
    2128        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2129
    2130        .dwattr $C$DW$T$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2131        .dwattr $C$DW$T$46, DW_AT_decl_line(0xa3)
    2132        .dwattr $C$DW$T$46, DW_AT_decl_column(0x13)
    2133        .dwendtag $C$DW$T$46
    2134
    2135$C$DW$T$83      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   40

    2136        .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    2137
    2138
    2139$C$DW$T$47      .dwtag  DW_TAG_structure_type
    2140        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2141$C$DW$137       .dwtag  DW_TAG_member
    2142        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2143        .dwattr $C$DW$137, DW_AT_name("PRU0_IMEM_PE_CLR")
    2144        .dwattr $C$DW$137, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2145        .dwattr $C$DW$137, DW_AT_bit_offset(0x1c)
    2146        .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    2147        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2149        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2150        .dwattr $C$DW$137, DW_AT_decl_line(0xb3)
    2151        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2152
    2153$C$DW$138       .dwtag  DW_TAG_member
    2154        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2155        .dwattr $C$DW$138, DW_AT_name("PRU0_DMEM_PE_CLR")
    2156        .dwattr $C$DW$138, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2157        .dwattr $C$DW$138, DW_AT_bit_offset(0x18)
    2158        .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    2159        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2161        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2162        .dwattr $C$DW$138, DW_AT_decl_line(0xb4)
    2163        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2164
    2165$C$DW$139       .dwtag  DW_TAG_member
    2166        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2167        .dwattr $C$DW$139, DW_AT_name("PRU1_IMEM_PE_CLR")
    2168        .dwattr $C$DW$139, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2169        .dwattr $C$DW$139, DW_AT_bit_offset(0x14)
    2170        .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    2171        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2173        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2174        .dwattr $C$DW$139, DW_AT_decl_line(0xb5)
    2175        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2176
    2177$C$DW$140       .dwtag  DW_TAG_member
    2178        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2179        .dwattr $C$DW$140, DW_AT_name("PRU1_DMEM_PE_CLR")
    2180        .dwattr $C$DW$140, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2181        .dwattr $C$DW$140, DW_AT_bit_offset(0x10)
    2182        .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    2183        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2185        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2186        .dwattr $C$DW$140, DW_AT_decl_line(0xb6)
    2187        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2188
    2189$C$DW$141       .dwtag  DW_TAG_member
    2190        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   41

    2191        .dwattr $C$DW$141, DW_AT_name("rsvd16")
    2192        .dwattr $C$DW$141, DW_AT_TI_symbol_name("rsvd16")
    2193        .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    2194        .dwattr $C$DW$141, DW_AT_bit_size(0x10)
    2195        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2197        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2198        .dwattr $C$DW$141, DW_AT_decl_line(0xb7)
    2199        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2200
    2201        .dwattr $C$DW$T$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2202        .dwattr $C$DW$T$47, DW_AT_decl_line(0xb2)
    2203        .dwattr $C$DW$T$47, DW_AT_decl_column(0x13)
    2204        .dwendtag $C$DW$T$47
    2205
    2206$C$DW$T$85      .dwtag  DW_TAG_volatile_type
    2207        .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$47)
    2208
    2209
    2210$C$DW$T$48      .dwtag  DW_TAG_structure_type
    2211        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    2212$C$DW$142       .dwtag  DW_TAG_member
    2213        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    2214        .dwattr $C$DW$142, DW_AT_name("PMAO_PRU0")
    2215        .dwattr $C$DW$142, DW_AT_TI_symbol_name("PMAO_PRU0")
    2216        .dwattr $C$DW$142, DW_AT_bit_offset(0x1f)
    2217        .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2218        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2220        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2221        .dwattr $C$DW$142, DW_AT_decl_line(0xc4)
    2222        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2223
    2224$C$DW$143       .dwtag  DW_TAG_member
    2225        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    2226        .dwattr $C$DW$143, DW_AT_name("PMAO_PRU1")
    2227        .dwattr $C$DW$143, DW_AT_TI_symbol_name("PMAO_PRU1")
    2228        .dwattr $C$DW$143, DW_AT_bit_offset(0x1e)
    2229        .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2230        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2232        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2233        .dwattr $C$DW$143, DW_AT_decl_line(0xc5)
    2234        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2235
    2236$C$DW$144       .dwtag  DW_TAG_member
    2237        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    2238        .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2239        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd2")
    2240        .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2241        .dwattr $C$DW$144, DW_AT_bit_size(0x1e)
    2242        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2244        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2245        .dwattr $C$DW$144, DW_AT_decl_line(0xc6)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:37 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_intr.asm                                           PAGE   42

