PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:34 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_arbitration.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

    1349        .dwattr $C$DW$67, DW_AT_decl_file("pru1_statemachine_arbitration.c")
    1350        .dwattr $C$DW$67, DW_AT_decl_line(0x5c)
    1351        .dwattr $C$DW$67, DW_AT_decl_column(0x06)
    1352        .dwattr $C$DW$67, DW_AT_TI_max_frame_size(0x00)
    1353        .dwpsn  file "pru1_statemachine_arbitration.c",line 92,column 41,is_stmt,address ||sm_arb_star
    1354
    1355        .dwfde $C$DW$CIE, ||sm_arb_start||
    1356$C$DW$68        .dwtag  DW_TAG_formal_parameter
    1357        .dwattr $C$DW$68, DW_AT_name("priority_bit")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   26

    1358        .dwattr $C$DW$68, DW_AT_TI_symbol_name("priority_bit")
    1359        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$36)
    1360        .dwattr $C$DW$68, DW_AT_location[DW_OP_regx 0x38]
    1361
    1362;----------------------------------------------------------------------
    1363;  92 | void sm_arb_start(uint8_t priority_bit) {                              
    1364;----------------------------------------------------------------------
    1365
    1366;***************************************************************
    1367;* FNAME: sm_arb_start                  FR SIZE:   0           *
    1368;*                                                             *
    1369;* FUNCTION ENVIRONMENT                                        *
    1370;*                                                             *
    1371;* FUNCTION PROPERTIES                                         *
    1372;*                            0 Auto,  0 SOE     *
    1373;***************************************************************
    1374
    1375||sm_arb_start||:
    1376;* --------------------------------------------------------------------------*
    1377;* r0_0  assigned to $O$C1
    1378$C$DW$69        .dwtag  DW_TAG_variable
    1379        .dwattr $C$DW$69, DW_AT_name("$O$C1")
    1380        .dwattr $C$DW$69, DW_AT_TI_symbol_name("$O$C1")
    1381        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$74)
    1382        .dwattr $C$DW$69, DW_AT_location[DW_OP_reg0]
    1383
    1384;* r14_0 assigned to priority_bit
    1385$C$DW$70        .dwtag  DW_TAG_variable
    1386        .dwattr $C$DW$70, DW_AT_name("priority_bit")
    1387        .dwattr $C$DW$70, DW_AT_TI_symbol_name("priority_bit")
    1388        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$84)
    1389        .dwattr $C$DW$70, DW_AT_location[DW_OP_regx 0x38]
    1390
    1391        .dwcfi  cfa_offset, 0
    1392;*** 93 -----------------------    (*(C$1 = &sm_arb)).priority_bit = priority_bit;
    1393;*** 94 -----------------------    (*C$1).state = &sm_arb_state_1;
    1394;***    -----------------------    return;
    1395        .dwpsn  file "pru1_statemachine_arbitration.c",line 93,column 2,is_stmt,isa 0
    1396;----------------------------------------------------------------------
    1397;  93 | sm_arb.priority_bit = priority_bit; // single priority bit for this arb
    1398;     | itration process                                                       
    1399;----------------------------------------------------------------------
    1400 00000000 000000240000E0!         LDI       r0, ||sm_arb||        ; [ALU_PRU] |93| $O$C1,sm_arb
    1401        .dwpsn  file "pru1_statemachine_arbitration.c",line 94,column 2,is_stmt,isa 0
    1402;----------------------------------------------------------------------
    1403;  94 | sm_arb.state = &sm_arb_state_1;                                        
    1404;----------------------------------------------------------------------
    1405 00000004 00000024000081!         LDI       r1.w0, $CODE(||sm_arb_state_1||) ; [ALU_PRU] |94| sm_arb_state_1
    1406        .dwpsn  file "pru1_statemachine_arbitration.c",line 93,column 2,is_stmt,isa 0
    1407 00000008 000000E102000E          SBBO      &r14.b0, r0, 2, 1     ; [ALU_PRU] |93| $O$C1,priority_bit
    1408        .dwpsn  file "pru1_statemachine_arbitration.c",line 94,column 2,is_stmt,isa 0
    1409 0000000c 000000E1000081          SBBO      &r1.w0, r0, 0, 2      ; [ALU_PRU] |94| $O$C1
    1410$C$DW$71        .dwtag  DW_TAG_TI_branch
    1411        .dwattr $C$DW$71, DW_AT_low_pc(0x00)
    1412        .dwattr $C$DW$71, DW_AT_TI_return
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   27

    1413
    1414 00000010 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1415        .dwattr $C$DW$67, DW_AT_TI_end_file("pru1_statemachine_arbitration.c")
    1416        .dwattr $C$DW$67, DW_AT_TI_end_line(0x5f)
    1417        .dwattr $C$DW$67, DW_AT_TI_end_column(0x01)
    1418        .dwendentry
    1419        .dwendtag $C$DW$67
    1420
    1421;*****************************************************************************
    1422;* UNDEFINED EXTERNAL REFERENCES                                             *
    1423;*****************************************************************************
    1424        .global ||buslatches||
    1425        .global ||buslatches_pru0_dataout||
    1426
    1427;******************************************************************************
    1428;* TYPE INFORMATION                                                           *
    1429;******************************************************************************
    1430
    1431$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1432        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1433$C$DW$72        .dwtag  DW_TAG_member
    1434        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1435        .dwattr $C$DW$72, DW_AT_name("REVID")
    1436        .dwattr $C$DW$72, DW_AT_TI_symbol_name("REVID")
    1437        .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1438        .dwattr $C$DW$72, DW_AT_bit_size(0x20)
    1439        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1442        .dwattr $C$DW$72, DW_AT_decl_line(0x2d)
    1443        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1444
    1445        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1446        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1447        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1448        .dwendtag $C$DW$T$19
    1449
    1450$C$DW$T$44      .dwtag  DW_TAG_volatile_type
    1451        .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    1452
    1453
    1454$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1455        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1456$C$DW$73        .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1458        .dwattr $C$DW$73, DW_AT_name("IDLE_MODE")
    1459        .dwattr $C$DW$73, DW_AT_TI_symbol_name("IDLE_MODE")
    1460        .dwattr $C$DW$73, DW_AT_bit_offset(0x1e)
    1461        .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1462        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1464        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1465        .dwattr $C$DW$73, DW_AT_decl_line(0x37)
    1466        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1467
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   28

    1468$C$DW$74        .dwtag  DW_TAG_member
    1469        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1470        .dwattr $C$DW$74, DW_AT_name("STANDBY_MODE")
    1471        .dwattr $C$DW$74, DW_AT_TI_symbol_name("STANDBY_MODE")
    1472        .dwattr $C$DW$74, DW_AT_bit_offset(0x1c)
    1473        .dwattr $C$DW$74, DW_AT_bit_size(0x02)
    1474        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1476        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1477        .dwattr $C$DW$74, DW_AT_decl_line(0x38)
    1478        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1479
    1480$C$DW$75        .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1482        .dwattr $C$DW$75, DW_AT_name("STANDBY_INIT")
    1483        .dwattr $C$DW$75, DW_AT_TI_symbol_name("STANDBY_INIT")
    1484        .dwattr $C$DW$75, DW_AT_bit_offset(0x1b)
    1485        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1486        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1488        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1489        .dwattr $C$DW$75, DW_AT_decl_line(0x39)
    1490        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1491
    1492$C$DW$76        .dwtag  DW_TAG_member
    1493        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1494        .dwattr $C$DW$76, DW_AT_name("SUB_MWAIT")
    1495        .dwattr $C$DW$76, DW_AT_TI_symbol_name("SUB_MWAIT")
    1496        .dwattr $C$DW$76, DW_AT_bit_offset(0x1a)
    1497        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1498        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1500        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1501        .dwattr $C$DW$76, DW_AT_decl_line(0x3a)
    1502        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1503
    1504$C$DW$77        .dwtag  DW_TAG_member
    1505        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1506        .dwattr $C$DW$77, DW_AT_name("rsvd6")
    1507        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd6")
    1508        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1509        .dwattr $C$DW$77, DW_AT_bit_size(0x1a)
    1510        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1512        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1513        .dwattr $C$DW$77, DW_AT_decl_line(0x3b)
    1514        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1515
    1516        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1517        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1518        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1519        .dwendtag $C$DW$T$20
    1520
    1521$C$DW$T$46      .dwtag  DW_TAG_volatile_type
    1522        .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   29

    1523
    1524
    1525$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1526        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1527$C$DW$78        .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$78, DW_AT_name("PRU0_GPI_MODE")
    1530        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1531        .dwattr $C$DW$78, DW_AT_bit_offset(0x1e)
    1532        .dwattr $C$DW$78, DW_AT_bit_size(0x02)
    1533        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1535        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1536        .dwattr $C$DW$78, DW_AT_decl_line(0x45)
    1537        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1538
    1539$C$DW$79        .dwtag  DW_TAG_member
    1540        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1541        .dwattr $C$DW$79, DW_AT_name("PRU0_GPI_CLK_MODE")
    1542        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1543        .dwattr $C$DW$79, DW_AT_bit_offset(0x1d)
    1544        .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1545        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1547        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1548        .dwattr $C$DW$79, DW_AT_decl_line(0x46)
    1549        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1550
    1551$C$DW$80        .dwtag  DW_TAG_member
    1552        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1553        .dwattr $C$DW$80, DW_AT_name("PRU0_GPI_DIV0")
    1554        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1555        .dwattr $C$DW$80, DW_AT_bit_offset(0x18)
    1556        .dwattr $C$DW$80, DW_AT_bit_size(0x05)
    1557        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1559        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1560        .dwattr $C$DW$80, DW_AT_decl_line(0x47)
    1561        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1562
    1563$C$DW$81        .dwtag  DW_TAG_member
    1564        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1565        .dwattr $C$DW$81, DW_AT_name("PRU0_GPI_DIV1")
    1566        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1567        .dwattr $C$DW$81, DW_AT_bit_offset(0x13)
    1568        .dwattr $C$DW$81, DW_AT_bit_size(0x05)
    1569        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1571        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1572        .dwattr $C$DW$81, DW_AT_decl_line(0x48)
    1573        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1574
    1575$C$DW$82        .dwtag  DW_TAG_member
    1576        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1577        .dwattr $C$DW$82, DW_AT_name("PRU0_GPI_SB")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   30

    1578        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1579        .dwattr $C$DW$82, DW_AT_bit_offset(0x12)
    1580        .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1581        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1584        .dwattr $C$DW$82, DW_AT_decl_line(0x49)
    1585        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1586
    1587$C$DW$83        .dwtag  DW_TAG_member
    1588        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1589        .dwattr $C$DW$83, DW_AT_name("PRU0_GPO_MODE")
    1590        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1591        .dwattr $C$DW$83, DW_AT_bit_offset(0x11)
    1592        .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1593        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1595        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1596        .dwattr $C$DW$83, DW_AT_decl_line(0x4a)
    1597        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1598
    1599$C$DW$84        .dwtag  DW_TAG_member
    1600        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1601        .dwattr $C$DW$84, DW_AT_name("PRU0_GPO_DIV0")
    1602        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1603        .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1604        .dwattr $C$DW$84, DW_AT_bit_size(0x05)
    1605        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1607        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1608        .dwattr $C$DW$84, DW_AT_decl_line(0x4b)
    1609        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1610
    1611$C$DW$85        .dwtag  DW_TAG_member
    1612        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1613        .dwattr $C$DW$85, DW_AT_name("PRU0_GPO_DIV1")
    1614        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1615        .dwattr $C$DW$85, DW_AT_bit_offset(0x07)
    1616        .dwattr $C$DW$85, DW_AT_bit_size(0x05)
    1617        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1619        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1620        .dwattr $C$DW$85, DW_AT_decl_line(0x4c)
    1621        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1622
    1623$C$DW$86        .dwtag  DW_TAG_member
    1624        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1625        .dwattr $C$DW$86, DW_AT_name("PRU0_GPO_SH_SEL")
    1626        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1627        .dwattr $C$DW$86, DW_AT_bit_offset(0x06)
    1628        .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1629        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1631        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1632        .dwattr $C$DW$86, DW_AT_decl_line(0x4d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   31

    1633        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1634
    1635$C$DW$87        .dwtag  DW_TAG_member
    1636        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1637        .dwattr $C$DW$87, DW_AT_name("rsvd26")
    1638        .dwattr $C$DW$87, DW_AT_TI_symbol_name("rsvd26")
    1639        .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1640        .dwattr $C$DW$87, DW_AT_bit_size(0x06)
    1641        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1644        .dwattr $C$DW$87, DW_AT_decl_line(0x4e)
    1645        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1646
    1647        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1648        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1649        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1650        .dwendtag $C$DW$T$21
    1651
    1652$C$DW$T$48      .dwtag  DW_TAG_volatile_type
    1653        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    1654
    1655
    1656$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1657        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1658$C$DW$88        .dwtag  DW_TAG_member
    1659        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1660        .dwattr $C$DW$88, DW_AT_name("PRU1_GPI_MODE")
    1661        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1662        .dwattr $C$DW$88, DW_AT_bit_offset(0x1e)
    1663        .dwattr $C$DW$88, DW_AT_bit_size(0x02)
    1664        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1666        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1667        .dwattr $C$DW$88, DW_AT_decl_line(0x58)
    1668        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1669
    1670$C$DW$89        .dwtag  DW_TAG_member
    1671        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1672        .dwattr $C$DW$89, DW_AT_name("PRU1_GPI_CLK_MODE")
    1673        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1674        .dwattr $C$DW$89, DW_AT_bit_offset(0x1d)
    1675        .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1676        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1678        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1679        .dwattr $C$DW$89, DW_AT_decl_line(0x59)
    1680        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1681
    1682$C$DW$90        .dwtag  DW_TAG_member
    1683        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1684        .dwattr $C$DW$90, DW_AT_name("PRU1_GPI_DIV0")
    1685        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1686        .dwattr $C$DW$90, DW_AT_bit_offset(0x18)
    1687        .dwattr $C$DW$90, DW_AT_bit_size(0x05)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   32

    1688        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1690        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1691        .dwattr $C$DW$90, DW_AT_decl_line(0x5a)
    1692        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1693
    1694$C$DW$91        .dwtag  DW_TAG_member
    1695        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1696        .dwattr $C$DW$91, DW_AT_name("PRU1_GPI_DIV1")
    1697        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1698        .dwattr $C$DW$91, DW_AT_bit_offset(0x13)
    1699        .dwattr $C$DW$91, DW_AT_bit_size(0x05)
    1700        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1702        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1703        .dwattr $C$DW$91, DW_AT_decl_line(0x5b)
    1704        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1705
    1706$C$DW$92        .dwtag  DW_TAG_member
    1707        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$92, DW_AT_name("PRU1_GPI_SB")
    1709        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1710        .dwattr $C$DW$92, DW_AT_bit_offset(0x12)
    1711        .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1712        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1714        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1715        .dwattr $C$DW$92, DW_AT_decl_line(0x5c)
    1716        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1717
    1718$C$DW$93        .dwtag  DW_TAG_member
    1719        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1720        .dwattr $C$DW$93, DW_AT_name("PRU1_GPO_MODE")
    1721        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1722        .dwattr $C$DW$93, DW_AT_bit_offset(0x11)
    1723        .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1724        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1726        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1727        .dwattr $C$DW$93, DW_AT_decl_line(0x5d)
    1728        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1729
    1730$C$DW$94        .dwtag  DW_TAG_member
    1731        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1732        .dwattr $C$DW$94, DW_AT_name("PRU1_GPO_DIV0")
    1733        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1734        .dwattr $C$DW$94, DW_AT_bit_offset(0x0c)
    1735        .dwattr $C$DW$94, DW_AT_bit_size(0x05)
    1736        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1738        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1739        .dwattr $C$DW$94, DW_AT_decl_line(0x5e)
    1740        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1741
    1742$C$DW$95        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   33

    1743        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1744        .dwattr $C$DW$95, DW_AT_name("PRU1_GPO_DIV1")
    1745        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1746        .dwattr $C$DW$95, DW_AT_bit_offset(0x07)
    1747        .dwattr $C$DW$95, DW_AT_bit_size(0x05)
    1748        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1750        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1751        .dwattr $C$DW$95, DW_AT_decl_line(0x5f)
    1752        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1753
    1754$C$DW$96        .dwtag  DW_TAG_member
    1755        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1756        .dwattr $C$DW$96, DW_AT_name("PRU1_GPO_SH_SEL")
    1757        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1758        .dwattr $C$DW$96, DW_AT_bit_offset(0x06)
    1759        .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1760        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1762        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1763        .dwattr $C$DW$96, DW_AT_decl_line(0x60)
    1764        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1765
    1766$C$DW$97        .dwtag  DW_TAG_member
    1767        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1768        .dwattr $C$DW$97, DW_AT_name("rsvd26")
    1769        .dwattr $C$DW$97, DW_AT_TI_symbol_name("rsvd26")
    1770        .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1771        .dwattr $C$DW$97, DW_AT_bit_size(0x06)
    1772        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1774        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1775        .dwattr $C$DW$97, DW_AT_decl_line(0x61)
    1776        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1777
    1778        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1779        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1780        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1781        .dwendtag $C$DW$T$22
    1782
    1783$C$DW$T$50      .dwtag  DW_TAG_volatile_type
    1784        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$22)
    1785
    1786
    1787$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1788        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1789$C$DW$98        .dwtag  DW_TAG_member
    1790        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1791        .dwattr $C$DW$98, DW_AT_name("PRU0_CLK_STOP_REQ")
    1792        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1793        .dwattr $C$DW$98, DW_AT_bit_offset(0x1f)
    1794        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1795        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1797        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   34

    1798        .dwattr $C$DW$98, DW_AT_decl_line(0x6b)
    1799        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1800
    1801$C$DW$99        .dwtag  DW_TAG_member
    1802        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1803        .dwattr $C$DW$99, DW_AT_name("PRU0_CLK_STOP_ACK")
    1804        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1805        .dwattr $C$DW$99, DW_AT_bit_offset(0x1e)
    1806        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1807        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1809        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1810        .dwattr $C$DW$99, DW_AT_decl_line(0x6c)
    1811        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1812
    1813$C$DW$100       .dwtag  DW_TAG_member
    1814        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1815        .dwattr $C$DW$100, DW_AT_name("PRU0_CLK_EN")
    1816        .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1817        .dwattr $C$DW$100, DW_AT_bit_offset(0x1d)
    1818        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1819        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1821        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1822        .dwattr $C$DW$100, DW_AT_decl_line(0x6d)
    1823        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1824
    1825$C$DW$101       .dwtag  DW_TAG_member
    1826        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1827        .dwattr $C$DW$101, DW_AT_name("PRU1_CLK_STOP_REQ")
    1828        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1829        .dwattr $C$DW$101, DW_AT_bit_offset(0x1c)
    1830        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1831        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1833        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1834        .dwattr $C$DW$101, DW_AT_decl_line(0x6e)
    1835        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1836
    1837$C$DW$102       .dwtag  DW_TAG_member
    1838        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1839        .dwattr $C$DW$102, DW_AT_name("PRU1_CLK_STOP_ACK")
    1840        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1841        .dwattr $C$DW$102, DW_AT_bit_offset(0x1b)
    1842        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1843        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1845        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1846        .dwattr $C$DW$102, DW_AT_decl_line(0x6f)
    1847        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1848
    1849$C$DW$103       .dwtag  DW_TAG_member
    1850        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1851        .dwattr $C$DW$103, DW_AT_name("PRU1_CLK_EN")
    1852        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_CLK_EN")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   35

    1853        .dwattr $C$DW$103, DW_AT_bit_offset(0x1a)
    1854        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1855        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1857        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1858        .dwattr $C$DW$103, DW_AT_decl_line(0x70)
    1859        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1860
    1861$C$DW$104       .dwtag  DW_TAG_member
    1862        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1863        .dwattr $C$DW$104, DW_AT_name("INTC_CLK_STOP_REQ")
    1864        .dwattr $C$DW$104, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1865        .dwattr $C$DW$104, DW_AT_bit_offset(0x19)
    1866        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1867        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1869        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1870        .dwattr $C$DW$104, DW_AT_decl_line(0x71)
    1871        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1872
    1873$C$DW$105       .dwtag  DW_TAG_member
    1874        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1875        .dwattr $C$DW$105, DW_AT_name("INTC_CLK_STOP_ACK")
    1876        .dwattr $C$DW$105, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1877        .dwattr $C$DW$105, DW_AT_bit_offset(0x18)
    1878        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1879        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1881        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1882        .dwattr $C$DW$105, DW_AT_decl_line(0x72)
    1883        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1884
    1885$C$DW$106       .dwtag  DW_TAG_member
    1886        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1887        .dwattr $C$DW$106, DW_AT_name("INTC_CLK_EN")
    1888        .dwattr $C$DW$106, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1889        .dwattr $C$DW$106, DW_AT_bit_offset(0x17)
    1890        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1891        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1893        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1894        .dwattr $C$DW$106, DW_AT_decl_line(0x73)
    1895        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1896
    1897$C$DW$107       .dwtag  DW_TAG_member
    1898        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1899        .dwattr $C$DW$107, DW_AT_name("UART_CLK_STOP_REQ")
    1900        .dwattr $C$DW$107, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1901        .dwattr $C$DW$107, DW_AT_bit_offset(0x16)
    1902        .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1903        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1905        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1906        .dwattr $C$DW$107, DW_AT_decl_line(0x74)
    1907        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   36

    1908
    1909$C$DW$108       .dwtag  DW_TAG_member
    1910        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1911        .dwattr $C$DW$108, DW_AT_name("UART_CLK_STOP_ACK")
    1912        .dwattr $C$DW$108, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1913        .dwattr $C$DW$108, DW_AT_bit_offset(0x15)
    1914        .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1915        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1917        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1918        .dwattr $C$DW$108, DW_AT_decl_line(0x75)
    1919        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1920
    1921$C$DW$109       .dwtag  DW_TAG_member
    1922        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1923        .dwattr $C$DW$109, DW_AT_name("UART_CLK_EN")
    1924        .dwattr $C$DW$109, DW_AT_TI_symbol_name("UART_CLK_EN")
    1925        .dwattr $C$DW$109, DW_AT_bit_offset(0x14)
    1926        .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1927        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1929        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1930        .dwattr $C$DW$109, DW_AT_decl_line(0x76)
    1931        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1932
    1933$C$DW$110       .dwtag  DW_TAG_member
    1934        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1935        .dwattr $C$DW$110, DW_AT_name("ECAP_CLK_STOP_REQ")
    1936        .dwattr $C$DW$110, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1937        .dwattr $C$DW$110, DW_AT_bit_offset(0x13)
    1938        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1939        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1941        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1942        .dwattr $C$DW$110, DW_AT_decl_line(0x77)
    1943        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1944
    1945$C$DW$111       .dwtag  DW_TAG_member
    1946        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1947        .dwattr $C$DW$111, DW_AT_name("ECAP_CLK_STOP_ACK")
    1948        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1949        .dwattr $C$DW$111, DW_AT_bit_offset(0x12)
    1950        .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1951        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1953        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1954        .dwattr $C$DW$111, DW_AT_decl_line(0x78)
    1955        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1956
    1957$C$DW$112       .dwtag  DW_TAG_member
    1958        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1959        .dwattr $C$DW$112, DW_AT_name("ECAP_CLK_EN")
    1960        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1961        .dwattr $C$DW$112, DW_AT_bit_offset(0x11)
    1962        .dwattr $C$DW$112, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   37

    1963        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1965        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1966        .dwattr $C$DW$112, DW_AT_decl_line(0x79)
    1967        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1968
    1969$C$DW$113       .dwtag  DW_TAG_member
    1970        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1971        .dwattr $C$DW$113, DW_AT_name("IEP_CLK_STOP_REQ")
    1972        .dwattr $C$DW$113, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1973        .dwattr $C$DW$113, DW_AT_bit_offset(0x10)
    1974        .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1975        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1977        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1978        .dwattr $C$DW$113, DW_AT_decl_line(0x7a)
    1979        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1980
    1981$C$DW$114       .dwtag  DW_TAG_member
    1982        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1983        .dwattr $C$DW$114, DW_AT_name("IEP_CLK_STOP_ACK")
    1984        .dwattr $C$DW$114, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1985        .dwattr $C$DW$114, DW_AT_bit_offset(0x0f)
    1986        .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1987        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1989        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1990        .dwattr $C$DW$114, DW_AT_decl_line(0x7b)
    1991        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1992
    1993$C$DW$115       .dwtag  DW_TAG_member
    1994        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1995        .dwattr $C$DW$115, DW_AT_name("IEP_CLK_EN")
    1996        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1997        .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    1998        .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1999        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2001        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2002        .dwattr $C$DW$115, DW_AT_decl_line(0x7c)
    2003        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    2004
    2005$C$DW$116       .dwtag  DW_TAG_member
    2006        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    2007        .dwattr $C$DW$116, DW_AT_name("rsvd18")
    2008        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd18")
    2009        .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2010        .dwattr $C$DW$116, DW_AT_bit_size(0x0e)
    2011        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2013        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2014        .dwattr $C$DW$116, DW_AT_decl_line(0x7d)
    2015        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2016
    2017        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   38

    2018        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    2019        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    2020        .dwendtag $C$DW$T$23
    2021
    2022$C$DW$T$52      .dwtag  DW_TAG_volatile_type
    2023        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$23)
    2024
    2025
    2026$C$DW$T$24      .dwtag  DW_TAG_structure_type
    2027        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    2028$C$DW$117       .dwtag  DW_TAG_member
    2029        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    2030        .dwattr $C$DW$117, DW_AT_name("PRU0_IMEM_PE_RAW")
    2031        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    2032        .dwattr $C$DW$117, DW_AT_bit_offset(0x1c)
    2033        .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    2034        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2036        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2037        .dwattr $C$DW$117, DW_AT_decl_line(0x87)
    2038        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    2039
    2040$C$DW$118       .dwtag  DW_TAG_member
    2041        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    2042        .dwattr $C$DW$118, DW_AT_name("PRU0_DMEM_PE_RAW")
    2043        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    2044        .dwattr $C$DW$118, DW_AT_bit_offset(0x18)
    2045        .dwattr $C$DW$118, DW_AT_bit_size(0x04)
    2046        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2048        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2049        .dwattr $C$DW$118, DW_AT_decl_line(0x88)
    2050        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    2051
    2052$C$DW$119       .dwtag  DW_TAG_member
    2053        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    2054        .dwattr $C$DW$119, DW_AT_name("PRU1_IMEM_PE_RAW")
    2055        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    2056        .dwattr $C$DW$119, DW_AT_bit_offset(0x14)
    2057        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    2058        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2060        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2061        .dwattr $C$DW$119, DW_AT_decl_line(0x89)
    2062        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2063
    2064$C$DW$120       .dwtag  DW_TAG_member
    2065        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2066        .dwattr $C$DW$120, DW_AT_name("PRU1_DMEM_PE_RAW")
    2067        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    2068        .dwattr $C$DW$120, DW_AT_bit_offset(0x10)
    2069        .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    2070        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2071        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2072        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   39

    2073        .dwattr $C$DW$120, DW_AT_decl_line(0x8a)
    2074        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2075
    2076$C$DW$121       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2078        .dwattr $C$DW$121, DW_AT_name("RAM_PE_RAW")
    2079        .dwattr $C$DW$121, DW_AT_TI_symbol_name("RAM_PE_RAW")
    2080        .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    2081        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    2082        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2084        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2085        .dwattr $C$DW$121, DW_AT_decl_line(0x8b)
    2086        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2087
    2088$C$DW$122       .dwtag  DW_TAG_member
    2089        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2090        .dwattr $C$DW$122, DW_AT_name("rsvd20")
    2091        .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd20")
    2092        .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    2093        .dwattr $C$DW$122, DW_AT_bit_size(0x0c)
    2094        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2096        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2097        .dwattr $C$DW$122, DW_AT_decl_line(0x8c)
    2098        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2099
    2100        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2101        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    2102        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    2103        .dwendtag $C$DW$T$24
    2104
    2105$C$DW$T$54      .dwtag  DW_TAG_volatile_type
    2106        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$24)
    2107
    2108
    2109$C$DW$T$25      .dwtag  DW_TAG_structure_type
    2110        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    2111$C$DW$123       .dwtag  DW_TAG_member
    2112        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2113        .dwattr $C$DW$123, DW_AT_name("PRU0_IMEM_PE")
    2114        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    2115        .dwattr $C$DW$123, DW_AT_bit_offset(0x1c)
    2116        .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    2117        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2119        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2120        .dwattr $C$DW$123, DW_AT_decl_line(0x96)
    2121        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2122
    2123$C$DW$124       .dwtag  DW_TAG_member
    2124        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2125        .dwattr $C$DW$124, DW_AT_name("PRU0_DMEM_PE")
    2126        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    2127        .dwattr $C$DW$124, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   40

    2128        .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    2129        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2131        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2132        .dwattr $C$DW$124, DW_AT_decl_line(0x97)
    2133        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2134
    2135$C$DW$125       .dwtag  DW_TAG_member
    2136        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2137        .dwattr $C$DW$125, DW_AT_name("PRU1_IMEM_PE")
    2138        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    2139        .dwattr $C$DW$125, DW_AT_bit_offset(0x14)
    2140        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    2141        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2143        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2144        .dwattr $C$DW$125, DW_AT_decl_line(0x98)
    2145        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2146
    2147$C$DW$126       .dwtag  DW_TAG_member
    2148        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2149        .dwattr $C$DW$126, DW_AT_name("PRU1_DMEM_PE")
    2150        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    2151        .dwattr $C$DW$126, DW_AT_bit_offset(0x10)
    2152        .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    2153        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2155        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2156        .dwattr $C$DW$126, DW_AT_decl_line(0x99)
    2157        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2158
    2159$C$DW$127       .dwtag  DW_TAG_member
    2160        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2161        .dwattr $C$DW$127, DW_AT_name("RAM_PE")
    2162        .dwattr $C$DW$127, DW_AT_TI_symbol_name("RAM_PE")
    2163        .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    2164        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    2165        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2166        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2167        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2168        .dwattr $C$DW$127, DW_AT_decl_line(0x9a)
    2169        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2170
    2171$C$DW$128       .dwtag  DW_TAG_member
    2172        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2173        .dwattr $C$DW$128, DW_AT_name("rsvd20")
    2174        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd20")
    2175        .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    2176        .dwattr $C$DW$128, DW_AT_bit_size(0x0c)
    2177        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2179        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2180        .dwattr $C$DW$128, DW_AT_decl_line(0x9b)
    2181        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2182
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   41

    2183        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2184        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    2185        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    2186        .dwendtag $C$DW$T$25
    2187
    2188$C$DW$T$56      .dwtag  DW_TAG_volatile_type
    2189        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$25)
    2190
    2191
    2192$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2193        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2194$C$DW$129       .dwtag  DW_TAG_member
    2195        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2196        .dwattr $C$DW$129, DW_AT_name("PRU0_IMEM_PE_SET")
    2197        .dwattr $C$DW$129, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    2198        .dwattr $C$DW$129, DW_AT_bit_offset(0x1c)
    2199        .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    2200        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2202        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2203        .dwattr $C$DW$129, DW_AT_decl_line(0xa4)
    2204        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2205
    2206$C$DW$130       .dwtag  DW_TAG_member
    2207        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2208        .dwattr $C$DW$130, DW_AT_name("PRU0_DMEM_PE_SET")
    2209        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    2210        .dwattr $C$DW$130, DW_AT_bit_offset(0x18)
    2211        .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    2212        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2214        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2215        .dwattr $C$DW$130, DW_AT_decl_line(0xa5)
    2216        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2217
    2218$C$DW$131       .dwtag  DW_TAG_member
    2219        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2220        .dwattr $C$DW$131, DW_AT_name("PRU1_IMEM_PE_SET")
    2221        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2222        .dwattr $C$DW$131, DW_AT_bit_offset(0x14)
    2223        .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    2224        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2226        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2227        .dwattr $C$DW$131, DW_AT_decl_line(0xa6)
    2228        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2229
    2230$C$DW$132       .dwtag  DW_TAG_member
    2231        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2232        .dwattr $C$DW$132, DW_AT_name("PRU1_DMEM_PE_SET")
    2233        .dwattr $C$DW$132, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2234        .dwattr $C$DW$132, DW_AT_bit_offset(0x10)
    2235        .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    2236        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   42

    2238        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2239        .dwattr $C$DW$132, DW_AT_decl_line(0xa7)
    2240        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2241
    2242$C$DW$133       .dwtag  DW_TAG_member
    2243        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2244        .dwattr $C$DW$133, DW_AT_name("RAM_PE_SET")
    2245        .dwattr $C$DW$133, DW_AT_TI_symbol_name("RAM_PE_SET")
    2246        .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    2247        .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    2248        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2250        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2251        .dwattr $C$DW$133, DW_AT_decl_line(0xa8)
    2252        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2253
    2254$C$DW$134       .dwtag  DW_TAG_member
    2255        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2256        .dwattr $C$DW$134, DW_AT_name("rsvd20")
    2257        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd20")
    2258        .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2259        .dwattr $C$DW$134, DW_AT_bit_size(0x0c)
    2260        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2262        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2263        .dwattr $C$DW$134, DW_AT_decl_line(0xa9)
    2264        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2265
    2266        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2267        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2268        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2269        .dwendtag $C$DW$T$26
    2270
    2271$C$DW$T$58      .dwtag  DW_TAG_volatile_type
    2272        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$26)
    2273
    2274
    2275$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2276        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2277$C$DW$135       .dwtag  DW_TAG_member
    2278        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2279        .dwattr $C$DW$135, DW_AT_name("PRU0_IMEM_PE_CLR")
    2280        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2281        .dwattr $C$DW$135, DW_AT_bit_offset(0x1c)
    2282        .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    2283        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2285        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2286        .dwattr $C$DW$135, DW_AT_decl_line(0xb3)
    2287        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2288
    2289$C$DW$136       .dwtag  DW_TAG_member
    2290        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2291        .dwattr $C$DW$136, DW_AT_name("PRU0_DMEM_PE_CLR")
    2292        .dwattr $C$DW$136, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   43

    2293        .dwattr $C$DW$136, DW_AT_bit_offset(0x18)
    2294        .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    2295        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2297        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2298        .dwattr $C$DW$136, DW_AT_decl_line(0xb4)
    2299        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2300
    2301$C$DW$137       .dwtag  DW_TAG_member
    2302        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2303        .dwattr $C$DW$137, DW_AT_name("PRU1_IMEM_PE_CLR")
    2304        .dwattr $C$DW$137, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2305        .dwattr $C$DW$137, DW_AT_bit_offset(0x14)
    2306        .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    2307        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2309        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2310        .dwattr $C$DW$137, DW_AT_decl_line(0xb5)
    2311        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2312
    2313$C$DW$138       .dwtag  DW_TAG_member
    2314        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2315        .dwattr $C$DW$138, DW_AT_name("PRU1_DMEM_PE_CLR")
    2316        .dwattr $C$DW$138, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2317        .dwattr $C$DW$138, DW_AT_bit_offset(0x10)
    2318        .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    2319        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2321        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2322        .dwattr $C$DW$138, DW_AT_decl_line(0xb6)
    2323        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2324
    2325$C$DW$139       .dwtag  DW_TAG_member
    2326        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2327        .dwattr $C$DW$139, DW_AT_name("rsvd16")
    2328        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd16")
    2329        .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2330        .dwattr $C$DW$139, DW_AT_bit_size(0x10)
    2331        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2333        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2334        .dwattr $C$DW$139, DW_AT_decl_line(0xb7)
    2335        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2336
    2337        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2338        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2339        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2340        .dwendtag $C$DW$T$27
    2341
    2342$C$DW$T$60      .dwtag  DW_TAG_volatile_type
    2343        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$27)
    2344
    2345
    2346$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2347        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   44

    2348$C$DW$140       .dwtag  DW_TAG_member
    2349        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2350        .dwattr $C$DW$140, DW_AT_name("PMAO_PRU0")
    2351        .dwattr $C$DW$140, DW_AT_TI_symbol_name("PMAO_PRU0")
    2352        .dwattr $C$DW$140, DW_AT_bit_offset(0x1f)
    2353        .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2354        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2356        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2357        .dwattr $C$DW$140, DW_AT_decl_line(0xc4)
    2358        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2359
    2360$C$DW$141       .dwtag  DW_TAG_member
    2361        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    2362        .dwattr $C$DW$141, DW_AT_name("PMAO_PRU1")
    2363        .dwattr $C$DW$141, DW_AT_TI_symbol_name("PMAO_PRU1")
    2364        .dwattr $C$DW$141, DW_AT_bit_offset(0x1e)
    2365        .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2366        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2367        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2368        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2369        .dwattr $C$DW$141, DW_AT_decl_line(0xc5)
    2370        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2371
    2372$C$DW$142       .dwtag  DW_TAG_member
    2373        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    2374        .dwattr $C$DW$142, DW_AT_name("rsvd2")
    2375        .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd2")
    2376        .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2377        .dwattr $C$DW$142, DW_AT_bit_size(0x1e)
    2378        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2379        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2380        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2381        .dwattr $C$DW$142, DW_AT_decl_line(0xc6)
    2382        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    2383
    2384        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2385        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2386        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2387        .dwendtag $C$DW$T$28
    2388
    2389$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    2390        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$28)
    2391
    2392
    2393$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2394        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2395$C$DW$143       .dwtag  DW_TAG_member
    2396        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    2397        .dwattr $C$DW$143, DW_AT_name("OCP_EN")
    2398        .dwattr $C$DW$143, DW_AT_TI_symbol_name("OCP_EN")
    2399        .dwattr $C$DW$143, DW_AT_bit_offset(0x1f)
    2400        .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2401        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   45

    2403        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2404        .dwattr $C$DW$143, DW_AT_decl_line(0xd3)
    2405        .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    2406
    2407$C$DW$144       .dwtag  DW_TAG_member
    2408        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    2409        .dwattr $C$DW$144, DW_AT_name("rsvd1")
    2410        .dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd1")
    2411        .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2412        .dwattr $C$DW$144, DW_AT_bit_size(0x1f)
    2413        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2414        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2415        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2416        .dwattr $C$DW$144, DW_AT_decl_line(0xd4)
    2417        .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    2418
    2419        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2420        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2421        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2422        .dwendtag $C$DW$T$29
    2423
    2424$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    2425        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$29)
    2426
    2427
    2428$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2429        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2430$C$DW$145       .dwtag  DW_TAG_member
    2431        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    2432        .dwattr $C$DW$145, DW_AT_name("PRU1_PAD_HP_EN")
    2433        .dwattr $C$DW$145, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2434        .dwattr $C$DW$145, DW_AT_bit_offset(0x1f)
    2435        .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2436        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2438        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2439        .dwattr $C$DW$145, DW_AT_decl_line(0xde)
    2440        .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    2441
    2442$C$DW$146       .dwtag  DW_TAG_member
    2443        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    2444        .dwattr $C$DW$146, DW_AT_name("XFR_SHIFT_EN")
    2445        .dwattr $C$DW$146, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2446        .dwattr $C$DW$146, DW_AT_bit_offset(0x1e)
    2447        .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2448        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2449        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2450        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2451        .dwattr $C$DW$146, DW_AT_decl_line(0xdf)
    2452        .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2453
    2454$C$DW$147       .dwtag  DW_TAG_member
    2455        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
    2456        .dwattr $C$DW$147, DW_AT_name("rsvd2")
    2457        .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd2")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   46

    2458        .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2459        .dwattr $C$DW$147, DW_AT_bit_size(0x1e)
    2460        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2462        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2463        .dwattr $C$DW$147, DW_AT_decl_line(0xe0)
    2464        .dwattr $C$DW$147, DW_AT_decl_column(0x0d)
    2465
    2466        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2467        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2468        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2469        .dwendtag $C$DW$T$30
    2470
    2471$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    2472        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$30)
    2473
    2474
    2475$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2476        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2477$C$DW$148       .dwtag  DW_TAG_member
    2478        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
    2479        .dwattr $C$DW$148, DW_AT_name("PIN_MUX_SEL")
    2480        .dwattr $C$DW$148, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2481        .dwattr $C$DW$148, DW_AT_bit_offset(0x18)
    2482        .dwattr $C$DW$148, DW_AT_bit_size(0x08)
    2483        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2485        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2486        .dwattr $C$DW$148, DW_AT_decl_line(0xec)
    2487        .dwattr $C$DW$148, DW_AT_decl_column(0x0d)
    2488
    2489$C$DW$149       .dwtag  DW_TAG_member
    2490        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
    2491        .dwattr $C$DW$149, DW_AT_name("rsvd2")
    2492        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd2")
    2493        .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2494        .dwattr $C$DW$149, DW_AT_bit_size(0x18)
    2495        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2496        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2497        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2498        .dwattr $C$DW$149, DW_AT_decl_line(0xed)
    2499        .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2500
    2501        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2502        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2503        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2504        .dwendtag $C$DW$T$31
    2505
    2506$C$DW$T$68      .dwtag  DW_TAG_volatile_type
    2507        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$31)
    2508
    2509
    2510$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2511        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2512$C$DW$150       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   47

    2513        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$45)
    2514        .dwattr $C$DW$150, DW_AT_name("$P$T0")
    2515        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T0")
    2516        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2518        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2519        .dwattr $C$DW$150, DW_AT_decl_line(0x29)
    2520        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2521
    2522$C$DW$151       .dwtag  DW_TAG_member
    2523        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$47)
    2524        .dwattr $C$DW$151, DW_AT_name("$P$T1")
    2525        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T1")
    2526        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2527        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2528        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2529        .dwattr $C$DW$151, DW_AT_decl_line(0x33)
    2530        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2531
    2532$C$DW$152       .dwtag  DW_TAG_member
    2533        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$49)
    2534        .dwattr $C$DW$152, DW_AT_name("$P$T2")
    2535        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T2")
    2536        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2537        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2538        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2539        .dwattr $C$DW$152, DW_AT_decl_line(0x41)
    2540        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2541
    2542$C$DW$153       .dwtag  DW_TAG_member
    2543        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$51)
    2544        .dwattr $C$DW$153, DW_AT_name("$P$T3")
    2545        .dwattr $C$DW$153, DW_AT_TI_symbol_name("$P$T3")
    2546        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2547        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2548        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2549        .dwattr $C$DW$153, DW_AT_decl_line(0x54)
    2550        .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    2551
    2552$C$DW$154       .dwtag  DW_TAG_member
    2553        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$53)
    2554        .dwattr $C$DW$154, DW_AT_name("$P$T4")
    2555        .dwattr $C$DW$154, DW_AT_TI_symbol_name("$P$T4")
    2556        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2557        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2558        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2559        .dwattr $C$DW$154, DW_AT_decl_line(0x67)
    2560        .dwattr $C$DW$154, DW_AT_decl_column(0x02)
    2561
    2562$C$DW$155       .dwtag  DW_TAG_member
    2563        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$55)
    2564        .dwattr $C$DW$155, DW_AT_name("$P$T5")
    2565        .dwattr $C$DW$155, DW_AT_TI_symbol_name("$P$T5")
    2566        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2567        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   48

    2568        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2569        .dwattr $C$DW$155, DW_AT_decl_line(0x83)
    2570        .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    2571
    2572$C$DW$156       .dwtag  DW_TAG_member
    2573        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$57)
    2574        .dwattr $C$DW$156, DW_AT_name("$P$T6")
    2575        .dwattr $C$DW$156, DW_AT_TI_symbol_name("$P$T6")
    2576        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2577        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2578        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2579        .dwattr $C$DW$156, DW_AT_decl_line(0x92)
    2580        .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    2581
    2582$C$DW$157       .dwtag  DW_TAG_member
    2583        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$59)
    2584        .dwattr $C$DW$157, DW_AT_name("$P$T7")
    2585        .dwattr $C$DW$157, DW_AT_TI_symbol_name("$P$T7")
    2586        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2587        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2588        .dwattr $C$DW$157, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2589        .dwattr $C$DW$157, DW_AT_decl_line(0xa0)
    2590        .dwattr $C$DW$157, DW_AT_decl_column(0x02)
    2591
    2592$C$DW$158       .dwtag  DW_TAG_member
    2593        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$61)
    2594        .dwattr $C$DW$158, DW_AT_name("$P$T8")
    2595        .dwattr $C$DW$158, DW_AT_TI_symbol_name("$P$T8")
    2596        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2597        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2598        .dwattr $C$DW$158, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2599        .dwattr $C$DW$158, DW_AT_decl_line(0xaf)
    2600        .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    2601
    2602$C$DW$159       .dwtag  DW_TAG_member
    2603        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
    2604        .dwattr $C$DW$159, DW_AT_name("rsvd24")
    2605        .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd24")
    2606        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2607        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2608        .dwattr $C$DW$159, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2609        .dwattr $C$DW$159, DW_AT_decl_line(0xbc)
    2610        .dwattr $C$DW$159, DW_AT_decl_column(0x0b)
    2611
    2612$C$DW$160       .dwtag  DW_TAG_member
    2613        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$63)
    2614        .dwattr $C$DW$160, DW_AT_name("$P$T9")
    2615        .dwattr $C$DW$160, DW_AT_TI_symbol_name("$P$T9")
    2616        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2617        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2618        .dwattr $C$DW$160, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2619        .dwattr $C$DW$160, DW_AT_decl_line(0xc0)
    2620        .dwattr $C$DW$160, DW_AT_decl_column(0x02)
    2621
    2622$C$DW$161       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   49

    2623        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
    2624        .dwattr $C$DW$161, DW_AT_name("rsvd2c")
    2625        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd2c")
    2626        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2627        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2628        .dwattr $C$DW$161, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2629        .dwattr $C$DW$161, DW_AT_decl_line(0xcb)
    2630        .dwattr $C$DW$161, DW_AT_decl_column(0x0b)
    2631
    2632$C$DW$162       .dwtag  DW_TAG_member
    2633        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$65)
    2634        .dwattr $C$DW$162, DW_AT_name("$P$T10")
    2635        .dwattr $C$DW$162, DW_AT_TI_symbol_name("$P$T10")
    2636        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2637        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2638        .dwattr $C$DW$162, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2639        .dwattr $C$DW$162, DW_AT_decl_line(0xcf)
    2640        .dwattr $C$DW$162, DW_AT_decl_column(0x02)
    2641
    2642$C$DW$163       .dwtag  DW_TAG_member
    2643        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$67)
    2644        .dwattr $C$DW$163, DW_AT_name("$P$T11")
    2645        .dwattr $C$DW$163, DW_AT_TI_symbol_name("$P$T11")
    2646        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2647        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2648        .dwattr $C$DW$163, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2649        .dwattr $C$DW$163, DW_AT_decl_line(0xda)
    2650        .dwattr $C$DW$163, DW_AT_decl_column(0x02)
    2651
    2652$C$DW$164       .dwtag  DW_TAG_member
    2653        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    2654        .dwattr $C$DW$164, DW_AT_name("rsvd38")
    2655        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd38")
    2656        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2657        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2658        .dwattr $C$DW$164, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2659        .dwattr $C$DW$164, DW_AT_decl_line(0xe5)
    2660        .dwattr $C$DW$164, DW_AT_decl_column(0x0b)
    2661
    2662$C$DW$165       .dwtag  DW_TAG_member
    2663        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$69)
    2664        .dwattr $C$DW$165, DW_AT_name("$P$T12")
    2665        .dwattr $C$DW$165, DW_AT_TI_symbol_name("$P$T12")
    2666        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2667        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2668        .dwattr $C$DW$165, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2669        .dwattr $C$DW$165, DW_AT_decl_line(0xe8)
    2670        .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    2671
    2672        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2673        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2674        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2675        .dwendtag $C$DW$T$35
    2676
    2677$C$DW$T$70      .dwtag  DW_TAG_typedef
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   50

    2678        .dwattr $C$DW$T$70, DW_AT_name("pruCfg")
    2679        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$35)
    2680        .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2681        .dwattr $C$DW$T$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2682        .dwattr $C$DW$T$70, DW_AT_decl_line(0xf0)
    2683        .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2684
    2685$C$DW$T$71      .dwtag  DW_TAG_volatile_type
    2686        .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2687
    2688
    2689$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2690        .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    2691$C$DW$166       .dwtag  DW_TAG_member
    2692        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$37)
    2693        .dwattr $C$DW$166, DW_AT_name("cur_reg_val")
    2694        .dwattr $C$DW$166, DW_AT_TI_symbol_name("cur_reg_val")
    2695        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2697        .dwattr $C$DW$166, DW_AT_decl_file("pru1_buslatches.h")
    2698        .dwattr $C$DW$166, DW_AT_decl_line(0x22)
    2699        .dwattr $C$DW$166, DW_AT_decl_column(0x0a)
    2700
    2701$C$DW$167       .dwtag  DW_TAG_member
    2702        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$37)
    2703        .dwattr $C$DW$167, DW_AT_name("bidi_bitwidth")
    2704        .dwattr $C$DW$167, DW_AT_TI_symbol_name("bidi_bitwidth")
    2705        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2706        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2707        .dwattr $C$DW$167, DW_AT_decl_file("pru1_buslatches.h")
    2708        .dwattr $C$DW$167, DW_AT_decl_line(0x26)
    2709        .dwattr $C$DW$167, DW_AT_decl_column(0x0a)
    2710
    2711        .dwattr $C$DW$T$38, DW_AT_decl_file("pru1_buslatches.h")
    2712        .dwattr $C$DW$T$38, DW_AT_decl_line(0x21)
    2713        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2714        .dwendtag $C$DW$T$38
    2715
    2716$C$DW$T$73      .dwtag  DW_TAG_typedef
    2717        .dwattr $C$DW$T$73, DW_AT_name("buslatches_t")
    2718        .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$38)
    2719        .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2720        .dwattr $C$DW$T$73, DW_AT_decl_file("pru1_buslatches.h")
    2721        .dwattr $C$DW$T$73, DW_AT_decl_line(0x2c)
    2722        .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    2723
    2724
    2725$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2726        .dwattr $C$DW$T$42, DW_AT_byte_size(0x03)
    2727$C$DW$168       .dwtag  DW_TAG_member
    2728        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$41)
    2729        .dwattr $C$DW$168, DW_AT_name("state")
    2730        .dwattr $C$DW$168, DW_AT_TI_symbol_name("state")
    2731        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   51

    2733        .dwattr $C$DW$168, DW_AT_decl_file("pru1_statemachine_arbitration.h")
    2734        .dwattr $C$DW$168, DW_AT_decl_line(0x22)
    2735        .dwattr $C$DW$168, DW_AT_decl_column(0x18)
    2736
    2737$C$DW$169       .dwtag  DW_TAG_member
    2738        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$36)
    2739        .dwattr $C$DW$169, DW_AT_name("priority_bit")
    2740        .dwattr $C$DW$169, DW_AT_TI_symbol_name("priority_bit")
    2741        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2742        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2743        .dwattr $C$DW$169, DW_AT_decl_file("pru1_statemachine_arbitration.h")
    2744        .dwattr $C$DW$169, DW_AT_decl_line(0x23)
    2745        .dwattr $C$DW$169, DW_AT_decl_column(0x0a)
    2746
    2747        .dwattr $C$DW$T$42, DW_AT_decl_file("pru1_statemachine_arbitration.h")
    2748        .dwattr $C$DW$T$42, DW_AT_decl_line(0x21)
    2749        .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2750        .dwendtag $C$DW$T$42
    2751
    2752$C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2753        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$42)
    2754        .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    2755
    2756$C$DW$T$75      .dwtag  DW_TAG_typedef
    2757        .dwattr $C$DW$T$75, DW_AT_name("statemachine_arbitration_t")
    2758        .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$42)
    2759        .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2760        .dwattr $C$DW$T$75, DW_AT_decl_file("pru1_statemachine_arbitration.h")
    2761        .dwattr $C$DW$T$75, DW_AT_decl_line(0x25)
    2762        .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    2763
    2764
    2765$C$DW$T$45      .dwtag  DW_TAG_union_type
    2766        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    2767$C$DW$170       .dwtag  DW_TAG_member
    2768        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$43)
    2769        .dwattr $C$DW$170, DW_AT_name("REVID")
    2770        .dwattr $C$DW$170, DW_AT_TI_symbol_name("REVID")
    2771        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2773        .dwattr $C$DW$170, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2774        .dwattr $C$DW$170, DW_AT_decl_line(0x2a)
    2775        .dwattr $C$DW$170, DW_AT_decl_column(0x15)
    2776
    2777$C$DW$171       .dwtag  DW_TAG_member
    2778        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$44)
    2779        .dwattr $C$DW$171, DW_AT_name("REVID_bit")
    2780        .dwattr $C$DW$171, DW_AT_TI_symbol_name("REVID_bit")
    2781        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2782        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2783        .dwattr $C$DW$171, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2784        .dwattr $C$DW$171, DW_AT_decl_line(0x2e)
    2785        .dwattr $C$DW$171, DW_AT_decl_column(0x05)
    2786
    2787        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   52

    2788        .dwattr $C$DW$T$45, DW_AT_decl_line(0x29)
    2789        .dwattr $C$DW$T$45, DW_AT_decl_column(0x08)
    2790        .dwendtag $C$DW$T$45
    2791
    2792
    2793$C$DW$T$47      .dwtag  DW_TAG_union_type
    2794        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2795$C$DW$172       .dwtag  DW_TAG_member
    2796        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$43)
    2797        .dwattr $C$DW$172, DW_AT_name("SYSCFG")
    2798        .dwattr $C$DW$172, DW_AT_TI_symbol_name("SYSCFG")
    2799        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2801        .dwattr $C$DW$172, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2802        .dwattr $C$DW$172, DW_AT_decl_line(0x34)
    2803        .dwattr $C$DW$172, DW_AT_decl_column(0x15)
    2804
    2805$C$DW$173       .dwtag  DW_TAG_member
    2806        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$46)
    2807        .dwattr $C$DW$173, DW_AT_name("SYSCFG_bit")
    2808        .dwattr $C$DW$173, DW_AT_TI_symbol_name("SYSCFG_bit")
    2809        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2810        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2811        .dwattr $C$DW$173, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2812        .dwattr $C$DW$173, DW_AT_decl_line(0x3c)
    2813        .dwattr $C$DW$173, DW_AT_decl_column(0x05)
    2814
    2815        .dwattr $C$DW$T$47, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2816        .dwattr $C$DW$T$47, DW_AT_decl_line(0x33)
    2817        .dwattr $C$DW$T$47, DW_AT_decl_column(0x08)
    2818        .dwendtag $C$DW$T$47
    2819
    2820
    2821$C$DW$T$49      .dwtag  DW_TAG_union_type
    2822        .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    2823$C$DW$174       .dwtag  DW_TAG_member
    2824        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$43)
    2825        .dwattr $C$DW$174, DW_AT_name("GPCFG0")
    2826        .dwattr $C$DW$174, DW_AT_TI_symbol_name("GPCFG0")
    2827        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2829        .dwattr $C$DW$174, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2830        .dwattr $C$DW$174, DW_AT_decl_line(0x42)
    2831        .dwattr $C$DW$174, DW_AT_decl_column(0x15)
    2832
    2833$C$DW$175       .dwtag  DW_TAG_member
    2834        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$48)
    2835        .dwattr $C$DW$175, DW_AT_name("GPCFG0_bit")
    2836        .dwattr $C$DW$175, DW_AT_TI_symbol_name("GPCFG0_bit")
    2837        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2839        .dwattr $C$DW$175, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2840        .dwattr $C$DW$175, DW_AT_decl_line(0x4f)
    2841        .dwattr $C$DW$175, DW_AT_decl_column(0x05)
    2842
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_arbitration.asm                                    PAGE   53

    2843        .dwattr $C$DW$T$49, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2844        .dwattr $C$DW$T$49, DW_AT_decl_line(0x41)
    2845        .dwattr $C$DW$T$49, DW_AT_decl_column(0x08)
    2846        .dwendtag $C$DW$T$49
    2847
    2848
    2849$C$DW$T$51      .dwtag  DW_TAG_union_type
    2850        .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    2851$C$DW$176       .dwtag  DW_TAG_member
    2852        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$43)
    2853        .dwattr $C$DW$176, DW_AT_name("GPCFG1")
    2854        .dwattr $C$DW$176, DW_AT_TI_symbol_name("GPCFG1")
    2855        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2857        .dwattr $C$DW$176, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2858        .dwattr $C$DW$176, DW_AT_decl_line(0x55)
    2859        .dwattr $C$DW$176, DW_AT_decl_column(0x15)
    2860
    2861$C$DW$177       .dwtag  DW_TAG_member
    2862        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$50)
    2863        .dwattr $C$DW$177, DW_AT_name("GPCFG1_bit")
    2864        .dwattr $C$DW$177, DW_AT_TI_symbol_name("GPCFG1_bit")
    2865        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2867        .dwattr $C$DW$177, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2868        .dwattr $C$DW$177, DW_AT_decl_line(0x62)
    2869        .dwattr $C$DW$177, DW_AT_decl_column(0x05)
    2870
    2871        .dwattr $C$DW$T$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2872        .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2873        .dwattr $C$DW$T$51, DW_AT_decl_column(0x08)
    2874        .dwendtag $C$DW$T$51
    2875
    2876
    2877$C$DW$T$53      .dwtag  DW_TAG_union_type
    2878        .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    2879$C$DW$178       .dwtag  DW_TAG_member
    2880        .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$43)
    2881        .dwattr $C$DW$178, DW_AT_name("CGR")
    2882        .dwattr $C$DW$178, DW_AT_TI_symbol_name("CGR")
    2883        .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884        .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2885        .dwattr $C$DW$178, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2886        .dwattr $C$DW$178, DW_AT_decl_line(0x68)
    2887        .dwattr $C$DW$178, DW_AT_decl_column(0x15)
    2888
    2889$C$DW$179       .dwtag  DW_TAG_member
    2890        .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$52)
    2891        .dwattr $C$DW$179, DW_AT_name("CGR_bit")
    2892        .dwattr $C$DW$179, DW_AT_TI_symbol_name("CGR_bit")
    2893        .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894        .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2895        .dwattr $C$DW$179, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2896        .dwattr $C$DW$179, DW_AT_decl_line(0x7e)
    2897        .dwattr $C$DW$179, DW_AT_decl_column(0x05)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:34 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
