PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:31 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_ddrmem.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12$C$DW$1 .dwtag  DW_TAG_variable
      13        .dwattr $C$DW$1, DW_AT_name("mailbox")
      14        .dwattr $C$DW$1, DW_AT_TI_symbol_name("mailbox")
      15        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$51)
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18        .dwattr $C$DW$1, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai

PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    2

      56;***************************************************************
      57
      58||ddrmem_fill_pattern||:
      59;* --------------------------------------------------------------------------*
      60;* r0_0  assigned to n
      61$C$DW$3 .dwtag  DW_TAG_variable
      62        .dwattr $C$DW$3, DW_AT_name("n")
      63        .dwattr $C$DW$3, DW_AT_TI_symbol_name("n")
      64        .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$11)
      65        .dwattr $C$DW$3, DW_AT_location[DW_OP_reg0]
      66
      67;* r1_0  assigned to wordaddr
      68$C$DW$4 .dwtag  DW_TAG_variable
      69        .dwattr $C$DW$4, DW_AT_name("wordaddr")
      70        .dwattr $C$DW$4, DW_AT_TI_symbol_name("wordaddr")
      71        .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$56)
      72        .dwattr $C$DW$4, DW_AT_location[DW_OP_reg4]
      73
      74        .dwcfi  cfa_offset, 0
      75;*** 37 -----------------------    wordaddr = (volatile unsigned short *)mailbox.ddrmem_base_physical;
      76;***    -----------------------    #pragma MUST_ITERATE(131072, 131072, 131072)
      77;***    -----------------------    #pragma LOOP_FLAGS(0u)
      78;*** 38 -----------------------    n = 0u;
      79        .dwpsn  file "pru1_ddrmem.c",line 37,column 30,is_stmt,isa 0
      80;----------------------------------------------------------------------
      81;  37 | volatile uint16_t *wordaddr = mailbox.ddrmem_base_physical->memory.word
      82;     | s;                                                                     
      83;----------------------------------------------------------------------
      84 00000000 000880240000C0!         LDI32     r0, ||mailbox||+8     ; [ALU_PRU] |37| mailbox
         00000007 00000021004024 
      85        .dwpsn  file "pru1_ddrmem.c",line 38,column 14,is_stmt,isa 0
      86;----------------------------------------------------------------------
      87;  38 | for (n = 0; n < UNIBUS_WORDCOUNT ;  n++)                               
      88;----------------------------------------------------------------------
      89 00000008 00008E240002CE          LDI32     r14, 0x00020000       ; [ALU_PRU] |38| 
         0000000f 00000000004024 
      90        .dwpsn  file "pru1_ddrmem.c",line 37,column 30,is_stmt,isa 0
      91 00000010 000000F1002081          LBBO      &r1, r0, 0, 4         ; [ALU_PRU] |37| wordaddr
      92        .dwpsn  file "pru1_ddrmem.c",line 38,column 7,is_stmt,isa 0
      93 00000014 0000002EFF8180          ZERO      &r0, 4                ; [ALU_PRU] |38| n
      94;* --------------------------------------------------------------------------*
      95;*   BEGIN LOOP ||$C$L1||
      96;*
      97;*   Loop source line                : 38
      98;*   Loop closing brace source line  : 39
      99;*   Known Minimum Trip Count        : 131072
     100;*   Known Maximum Trip Count        : 131072
     101;*   Known Max Trip Count Factor     : 131072
     102;* --------------------------------------------------------------------------*
     103 00000018                 ||$C$L1||:    
     104;***    -----------------------g2:
     105;*** 39 -----------------------    *wordaddr = n;
     106;*** 39 -----------------------    ++wordaddr;
     107;*** 38 -----------------------    if ( (++n) < 131072u ) goto g2;
     108;***    -----------------------    return;
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    3

     109        .dwpsn  file "pru1_ddrmem.c",line 39,column 3,is_stmt,isa 0
     110;----------------------------------------------------------------------
     111;  39 | *wordaddr++ = n ;                                                      
     112;----------------------------------------------------------------------
     113 00000018 000000E1000180          SBBO      &r0.w0, r1, 0, 2      ; [ALU_PRU] |39| wordaddr,n
     114 0000001c 0000000102E1E1          ADD       r1, r1, 0x02          ; [ALU_PRU] |39| wordaddr,wordaddr
     115        .dwpsn  file "pru1_ddrmem.c",line 38,column 14,is_stmt,isa 0
     116 00000020 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |38| n,n
     117 00000024 0000004EE0EEFD          QBLT      ||$C$L1||, r14, r0    ; [ALU_PRU] |38| n
     118;* --------------------------------------------------------------------------*
     119$C$DW$5 .dwtag  DW_TAG_TI_branch
     120        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     121        .dwattr $C$DW$5, DW_AT_TI_return
     122
     123 00000028 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     124        .dwattr $C$DW$2, DW_AT_TI_end_file("pru1_ddrmem.c")
     125        .dwattr $C$DW$2, DW_AT_TI_end_line(0x28)
     126        .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     127        .dwendentry
     128        .dwendtag $C$DW$2
     129
     130;*****************************************************************************
     131;* UNDEFINED EXTERNAL REFERENCES                                             *
     132;*****************************************************************************
     133        .global ||mailbox||
     134
     135;******************************************************************************
     136;* TYPE INFORMATION                                                           *
     137;******************************************************************************
     138
     139$C$DW$T$19      .dwtag  DW_TAG_structure_type
     140        .dwattr $C$DW$T$19, DW_AT_byte_size(0x40000)
     141$C$DW$6 .dwtag  DW_TAG_member
     142        .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$39)
     143        .dwattr $C$DW$6, DW_AT_name("$P$T0")
     144        .dwattr $C$DW$6, DW_AT_TI_symbol_name("$P$T0")
     145        .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     146        .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     147        .dwattr $C$DW$6, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/uni
     148        .dwattr $C$DW$6, DW_AT_decl_line(0x34)
     149        .dwattr $C$DW$6, DW_AT_decl_column(0x02)
     150
     151        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     152        .dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
     153        .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     154        .dwendtag $C$DW$T$19
     155
     156$C$DW$T$20      .dwtag  DW_TAG_typedef
     157        .dwattr $C$DW$T$20, DW_AT_name("unibus_memory_t")
     158        .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
     159        .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     160        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     161        .dwattr $C$DW$T$20, DW_AT_decl_line(0x38)
     162        .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
     163
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    4

     164
     165$C$DW$T$21      .dwtag  DW_TAG_structure_type
     166        .dwattr $C$DW$T$21, DW_AT_byte_size(0x40000)
     167$C$DW$7 .dwtag  DW_TAG_member
     168        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$20)
     169        .dwattr $C$DW$7, DW_AT_name("memory")
     170        .dwattr $C$DW$7, DW_AT_TI_symbol_name("memory")
     171        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     172        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     173        .dwattr $C$DW$7, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ddr
     174        .dwattr $C$DW$7, DW_AT_decl_line(0x17)
     175        .dwattr $C$DW$7, DW_AT_decl_column(0x12)
     176
     177        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     178        .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
     179        .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     180        .dwendtag $C$DW$T$21
     181
     182$C$DW$T$32      .dwtag  DW_TAG_typedef
     183        .dwattr $C$DW$T$32, DW_AT_name("ddrmem_t")
     184        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
     185        .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     186        .dwattr $C$DW$T$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     187        .dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
     188        .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
     189
     190$C$DW$T$33      .dwtag  DW_TAG_volatile_type
     191        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     192
     193$C$DW$T$34      .dwtag  DW_TAG_pointer_type
     194        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     195        .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
     196
     197
     198$C$DW$T$25      .dwtag  DW_TAG_structure_type
     199        .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
     200$C$DW$8 .dwtag  DW_TAG_member
     201        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$22)
     202        .dwattr $C$DW$8, DW_AT_name("eventmask")
     203        .dwattr $C$DW$8, DW_AT_TI_symbol_name("eventmask")
     204        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     205        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     206        .dwattr $C$DW$8, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     207        .dwattr $C$DW$8, DW_AT_decl_line(0x7a)
     208        .dwattr $C$DW$8, DW_AT_decl_column(0x0a)
     209
     210$C$DW$9 .dwtag  DW_TAG_member
     211        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$22)
     212        .dwattr $C$DW$9, DW_AT_name("unibus_control")
     213        .dwattr $C$DW$9, DW_AT_TI_symbol_name("unibus_control")
     214        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     215        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     216        .dwattr $C$DW$9, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     217        .dwattr $C$DW$9, DW_AT_decl_line(0x7d)
     218        .dwattr $C$DW$9, DW_AT_decl_column(0x0a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    5

     219
     220$C$DW$10        .dwtag  DW_TAG_member
     221        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$22)
     222        .dwattr $C$DW$10, DW_AT_name("device_handle")
     223        .dwattr $C$DW$10, DW_AT_TI_symbol_name("device_handle")
     224        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     225        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     226        .dwattr $C$DW$10, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     227        .dwattr $C$DW$10, DW_AT_decl_line(0x7f)
     228        .dwattr $C$DW$10, DW_AT_decl_column(0x0a)
     229
     230$C$DW$11        .dwtag  DW_TAG_member
     231        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$22)
     232        .dwattr $C$DW$11, DW_AT_name("device_register_idx")
     233        .dwattr $C$DW$11, DW_AT_TI_symbol_name("device_register_idx")
     234        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     235        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     236        .dwattr $C$DW$11, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     237        .dwattr $C$DW$11, DW_AT_decl_line(0x81)
     238        .dwattr $C$DW$11, DW_AT_decl_column(0x0a)
     239
     240$C$DW$12        .dwtag  DW_TAG_member
     241        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$23)
     242        .dwattr $C$DW$12, DW_AT_name("addr")
     243        .dwattr $C$DW$12, DW_AT_TI_symbol_name("addr")
     244        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     245        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     246        .dwattr $C$DW$12, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     247        .dwattr $C$DW$12, DW_AT_decl_line(0x83)
     248        .dwattr $C$DW$12, DW_AT_decl_column(0x0b)
     249
     250$C$DW$13        .dwtag  DW_TAG_member
     251        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$24)
     252        .dwattr $C$DW$13, DW_AT_name("data")
     253        .dwattr $C$DW$13, DW_AT_TI_symbol_name("data")
     254        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     255        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     256        .dwattr $C$DW$13, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     257        .dwattr $C$DW$13, DW_AT_decl_line(0x84)
     258        .dwattr $C$DW$13, DW_AT_decl_column(0x0b)
     259
     260$C$DW$14        .dwtag  DW_TAG_member
     261        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$22)
     262        .dwattr $C$DW$14, DW_AT_name("initialization_signals_prev")
     263        .dwattr $C$DW$14, DW_AT_TI_symbol_name("initialization_signals_prev")
     264        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     265        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     266        .dwattr $C$DW$14, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     267        .dwattr $C$DW$14, DW_AT_decl_line(0x87)
     268        .dwattr $C$DW$14, DW_AT_decl_column(0x0a)
     269
     270$C$DW$15        .dwtag  DW_TAG_member
     271        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$22)
     272        .dwattr $C$DW$15, DW_AT_name("initialization_signals_cur")
     273        .dwattr $C$DW$15, DW_AT_TI_symbol_name("initialization_signals_cur")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    6

     274        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     275        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     276        .dwattr $C$DW$15, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     277        .dwattr $C$DW$15, DW_AT_decl_line(0x88)
     278        .dwattr $C$DW$15, DW_AT_decl_column(0x0a)
     279
     280        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     281        .dwattr $C$DW$T$25, DW_AT_decl_line(0x79)
     282        .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     283        .dwendtag $C$DW$T$25
     284
     285$C$DW$T$35      .dwtag  DW_TAG_typedef
     286        .dwattr $C$DW$T$35, DW_AT_name("mailbox_events_t")
     287        .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
     288        .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     289        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     290        .dwattr $C$DW$T$35, DW_AT_decl_line(0x8b)
     291        .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
     292
     293
     294$C$DW$T$26      .dwtag  DW_TAG_structure_type
     295        .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     296$C$DW$16        .dwtag  DW_TAG_member
     297        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$23)
     298        .dwattr $C$DW$16, DW_AT_name("addr")
     299        .dwattr $C$DW$16, DW_AT_TI_symbol_name("addr")
     300        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     301        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     302        .dwattr $C$DW$16, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     303        .dwattr $C$DW$16, DW_AT_decl_line(0x4c)
     304        .dwattr $C$DW$16, DW_AT_decl_column(0x0b)
     305
     306$C$DW$17        .dwtag  DW_TAG_member
     307        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$23)
     308        .dwattr $C$DW$17, DW_AT_name("val")
     309        .dwattr $C$DW$17, DW_AT_TI_symbol_name("val")
     310        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     311        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     312        .dwattr $C$DW$17, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     313        .dwattr $C$DW$17, DW_AT_decl_line(0x4d)
     314        .dwattr $C$DW$17, DW_AT_decl_column(0x0b)
     315
     316        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     317        .dwattr $C$DW$T$26, DW_AT_decl_line(0x4b)
     318        .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     319        .dwendtag $C$DW$T$26
     320
     321$C$DW$T$40      .dwtag  DW_TAG_typedef
     322        .dwattr $C$DW$T$40, DW_AT_name("mailbox_test_t")
     323        .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$26)
     324        .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     325        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     326        .dwattr $C$DW$T$40, DW_AT_decl_line(0x4e)
     327        .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
     328
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    7

     329
     330$C$DW$T$27      .dwtag  DW_TAG_structure_type
     331        .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
     332$C$DW$18        .dwtag  DW_TAG_member
     333        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$23)
     334        .dwattr $C$DW$18, DW_AT_name("addr")
     335        .dwattr $C$DW$18, DW_AT_TI_symbol_name("addr")
     336        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     337        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     338        .dwattr $C$DW$18, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     339        .dwattr $C$DW$18, DW_AT_decl_line(0x51)
     340        .dwattr $C$DW$18, DW_AT_decl_column(0x0b)
     341
     342$C$DW$19        .dwtag  DW_TAG_member
     343        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$23)
     344        .dwattr $C$DW$19, DW_AT_name("bitmask")
     345        .dwattr $C$DW$19, DW_AT_TI_symbol_name("bitmask")
     346        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     347        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     348        .dwattr $C$DW$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     349        .dwattr $C$DW$19, DW_AT_decl_line(0x52)
     350        .dwattr $C$DW$19, DW_AT_decl_column(0x0b)
     351
     352$C$DW$20        .dwtag  DW_TAG_member
     353        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$23)
     354        .dwattr $C$DW$20, DW_AT_name("val")
     355        .dwattr $C$DW$20, DW_AT_TI_symbol_name("val")
     356        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     357        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     358        .dwattr $C$DW$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     359        .dwattr $C$DW$20, DW_AT_decl_line(0x53)
     360        .dwattr $C$DW$20, DW_AT_decl_column(0x0b)
     361
     362        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     363        .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
     364        .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     365        .dwendtag $C$DW$T$27
     366
     367$C$DW$T$41      .dwtag  DW_TAG_typedef
     368        .dwattr $C$DW$T$41, DW_AT_name("mailbox_buslatch_t")
     369        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$27)
     370        .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     371        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     372        .dwattr $C$DW$T$41, DW_AT_decl_line(0x54)
     373        .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
     374
     375
     376$C$DW$T$28      .dwtag  DW_TAG_structure_type
     377        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     378$C$DW$21        .dwtag  DW_TAG_member
     379        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     380        .dwattr $C$DW$21, DW_AT_name("addr_0_7")
     381        .dwattr $C$DW$21, DW_AT_TI_symbol_name("addr_0_7")
     382        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    8

     384        .dwattr $C$DW$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     385        .dwattr $C$DW$21, DW_AT_decl_line(0x57)
     386        .dwattr $C$DW$21, DW_AT_decl_column(0x0a)
     387
     388$C$DW$22        .dwtag  DW_TAG_member
     389        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     390        .dwattr $C$DW$22, DW_AT_name("addr_8_15")
     391        .dwattr $C$DW$22, DW_AT_TI_symbol_name("addr_8_15")
     392        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     393        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     394        .dwattr $C$DW$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     395        .dwattr $C$DW$22, DW_AT_decl_line(0x58)
     396        .dwattr $C$DW$22, DW_AT_decl_column(0x0a)
     397
     398$C$DW$23        .dwtag  DW_TAG_member
     399        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     400        .dwattr $C$DW$23, DW_AT_name("data_0_7")
     401        .dwattr $C$DW$23, DW_AT_TI_symbol_name("data_0_7")
     402        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     403        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     404        .dwattr $C$DW$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     405        .dwattr $C$DW$23, DW_AT_decl_line(0x59)
     406        .dwattr $C$DW$23, DW_AT_decl_column(0x0a)
     407
     408$C$DW$24        .dwtag  DW_TAG_member
     409        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     410        .dwattr $C$DW$24, DW_AT_name("data_8_15")
     411        .dwattr $C$DW$24, DW_AT_TI_symbol_name("data_8_15")
     412        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     413        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     414        .dwattr $C$DW$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     415        .dwattr $C$DW$24, DW_AT_decl_line(0x5a)
     416        .dwattr $C$DW$24, DW_AT_decl_column(0x0a)
     417
     418        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     419        .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
     420        .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     421        .dwendtag $C$DW$T$28
     422
     423$C$DW$T$42      .dwtag  DW_TAG_typedef
     424        .dwattr $C$DW$T$42, DW_AT_name("mailbox_buslatch_test_t")
     425        .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$28)
     426        .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     427        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     428        .dwattr $C$DW$T$42, DW_AT_decl_line(0x5b)
     429        .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
     430
     431
     432$C$DW$T$30      .dwtag  DW_TAG_structure_type
     433        .dwattr $C$DW$T$30, DW_AT_byte_size(0x40c)
     434$C$DW$25        .dwtag  DW_TAG_member
     435        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     436        .dwattr $C$DW$25, DW_AT_name("cur_status")
     437        .dwattr $C$DW$25, DW_AT_TI_symbol_name("cur_status")
     438        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE    9

     439        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     440        .dwattr $C$DW$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     441        .dwattr $C$DW$25, DW_AT_decl_line(0x61)
     442        .dwattr $C$DW$25, DW_AT_decl_column(0x0a)
     443
     444$C$DW$26        .dwtag  DW_TAG_member
     445        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     446        .dwattr $C$DW$26, DW_AT_name("control")
     447        .dwattr $C$DW$26, DW_AT_TI_symbol_name("control")
     448        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     449        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     450        .dwattr $C$DW$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     451        .dwattr $C$DW$26, DW_AT_decl_line(0x62)
     452        .dwattr $C$DW$26, DW_AT_decl_column(0x0a)
     453
     454$C$DW$27        .dwtag  DW_TAG_member
     455        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$24)
     456        .dwattr $C$DW$27, DW_AT_name("wordcount")
     457        .dwattr $C$DW$27, DW_AT_TI_symbol_name("wordcount")
     458        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     459        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     460        .dwattr $C$DW$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     461        .dwattr $C$DW$27, DW_AT_decl_line(0x63)
     462        .dwattr $C$DW$27, DW_AT_decl_column(0x0b)
     463
     464$C$DW$28        .dwtag  DW_TAG_member
     465        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     466        .dwattr $C$DW$28, DW_AT_name("cur_addr")
     467        .dwattr $C$DW$28, DW_AT_TI_symbol_name("cur_addr")
     468        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     469        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     470        .dwattr $C$DW$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     471        .dwattr $C$DW$28, DW_AT_decl_line(0x64)
     472        .dwattr $C$DW$28, DW_AT_decl_column(0x0b)
     473
     474$C$DW$29        .dwtag  DW_TAG_member
     475        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     476        .dwattr $C$DW$29, DW_AT_name("startaddr")
     477        .dwattr $C$DW$29, DW_AT_TI_symbol_name("startaddr")
     478        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     479        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     480        .dwattr $C$DW$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     481        .dwattr $C$DW$29, DW_AT_decl_line(0x65)
     482        .dwattr $C$DW$29, DW_AT_decl_column(0x0b)
     483
     484$C$DW$30        .dwtag  DW_TAG_member
     485        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$29)
     486        .dwattr $C$DW$30, DW_AT_name("words")
     487        .dwattr $C$DW$30, DW_AT_TI_symbol_name("words")
     488        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     489        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     490        .dwattr $C$DW$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     491        .dwattr $C$DW$30, DW_AT_decl_line(0x66)
     492        .dwattr $C$DW$30, DW_AT_decl_column(0x0b)
     493
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE   10

     494        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     495        .dwattr $C$DW$T$30, DW_AT_decl_line(0x5f)
     496        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     497        .dwendtag $C$DW$T$30
     498
     499$C$DW$T$43      .dwtag  DW_TAG_typedef
     500        .dwattr $C$DW$T$43, DW_AT_name("mailbox_dma_t")
     501        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$30)
     502        .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     503        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     504        .dwattr $C$DW$T$43, DW_AT_decl_line(0x67)
     505        .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
     506
     507
     508$C$DW$T$31      .dwtag  DW_TAG_structure_type
     509        .dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
     510$C$DW$31        .dwtag  DW_TAG_member
     511        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$24)
     512        .dwattr $C$DW$31, DW_AT_name("vector")
     513        .dwattr $C$DW$31, DW_AT_TI_symbol_name("vector")
     514        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     516        .dwattr $C$DW$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     517        .dwattr $C$DW$31, DW_AT_decl_line(0x6b)
     518        .dwattr $C$DW$31, DW_AT_decl_column(0x0b)
     519
     520$C$DW$32        .dwtag  DW_TAG_member
     521        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     522        .dwattr $C$DW$32, DW_AT_name("priority_bit")
     523        .dwattr $C$DW$32, DW_AT_TI_symbol_name("priority_bit")
     524        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     525        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     526        .dwattr $C$DW$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     527        .dwattr $C$DW$32, DW_AT_decl_line(0x6c)
     528        .dwattr $C$DW$32, DW_AT_decl_column(0x0a)
     529
     530        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     531        .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
     532        .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     533        .dwendtag $C$DW$T$31
     534
     535$C$DW$T$44      .dwtag  DW_TAG_typedef
     536        .dwattr $C$DW$T$44, DW_AT_name("mailbox_intr_t")
     537        .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$31)
     538        .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     539        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     540        .dwattr $C$DW$T$44, DW_AT_decl_line(0x6d)
     541        .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
     542
     543
     544$C$DW$T$36      .dwtag  DW_TAG_structure_type
     545        .dwattr $C$DW$T$36, DW_AT_byte_size(0x424)
     546$C$DW$33        .dwtag  DW_TAG_member
     547        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$23)
     548        .dwattr $C$DW$33, DW_AT_name("arm2pru_req")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE   11

     549        .dwattr $C$DW$33, DW_AT_TI_symbol_name("arm2pru_req")
     550        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     551        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     552        .dwattr $C$DW$33, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     553        .dwattr $C$DW$33, DW_AT_decl_line(0x90)
     554        .dwattr $C$DW$33, DW_AT_decl_column(0x0b)
     555
     556$C$DW$34        .dwtag  DW_TAG_member
     557        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$23)
     558        .dwattr $C$DW$34, DW_AT_name("arm2pru_resp")
     559        .dwattr $C$DW$34, DW_AT_TI_symbol_name("arm2pru_resp")
     560        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     561        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     562        .dwattr $C$DW$34, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     563        .dwattr $C$DW$34, DW_AT_decl_line(0x91)
     564        .dwattr $C$DW$34, DW_AT_decl_column(0x0b)
     565
     566$C$DW$35        .dwtag  DW_TAG_member
     567        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$34)
     568        .dwattr $C$DW$35, DW_AT_name("ddrmem_base_physical")
     569        .dwattr $C$DW$35, DW_AT_TI_symbol_name("ddrmem_base_physical")
     570        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     571        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     572        .dwattr $C$DW$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     573        .dwattr $C$DW$35, DW_AT_decl_line(0x94)
     574        .dwattr $C$DW$35, DW_AT_decl_column(0x15)
     575
     576$C$DW$36        .dwtag  DW_TAG_member
     577        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$35)
     578        .dwattr $C$DW$36, DW_AT_name("events")
     579        .dwattr $C$DW$36, DW_AT_TI_symbol_name("events")
     580        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     581        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     582        .dwattr $C$DW$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     583        .dwattr $C$DW$36, DW_AT_decl_line(0x97)
     584        .dwattr $C$DW$36, DW_AT_decl_column(0x13)
     585
     586$C$DW$37        .dwtag  DW_TAG_member
     587        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$45)
     588        .dwattr $C$DW$37, DW_AT_name("$P$T1")
     589        .dwattr $C$DW$37, DW_AT_TI_symbol_name("$P$T1")
     590        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     591        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     592        .dwattr $C$DW$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     593        .dwattr $C$DW$37, DW_AT_decl_line(0x9a)
     594        .dwattr $C$DW$37, DW_AT_decl_column(0x02)
     595
     596        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     597        .dwattr $C$DW$T$36, DW_AT_decl_line(0x8d)
     598        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
     599        .dwendtag $C$DW$T$36
     600
     601$C$DW$T$50      .dwtag  DW_TAG_typedef
     602        .dwattr $C$DW$T$50, DW_AT_name("mailbox_t")
     603        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$36)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE   12

     604        .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     605        .dwattr $C$DW$T$50, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     606        .dwattr $C$DW$T$50, DW_AT_decl_line(0xa1)
     607        .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
     608
     609$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     610        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     611
     612
     613$C$DW$T$39      .dwtag  DW_TAG_union_type
     614        .dwattr $C$DW$T$39, DW_AT_byte_size(0x40000)
     615$C$DW$38        .dwtag  DW_TAG_member
     616        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$37)
     617        .dwattr $C$DW$38, DW_AT_name("words")
     618        .dwattr $C$DW$38, DW_AT_TI_symbol_name("words")
     619        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     621        .dwattr $C$DW$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     622        .dwattr $C$DW$38, DW_AT_decl_line(0x35)
     623        .dwattr $C$DW$38, DW_AT_decl_column(0x0b)
     624
     625$C$DW$39        .dwtag  DW_TAG_member
     626        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$38)
     627        .dwattr $C$DW$39, DW_AT_name("bytes")
     628        .dwattr $C$DW$39, DW_AT_TI_symbol_name("bytes")
     629        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     631        .dwattr $C$DW$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     632        .dwattr $C$DW$39, DW_AT_decl_line(0x36)
     633        .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     634
     635        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     636        .dwattr $C$DW$T$39, DW_AT_decl_line(0x34)
     637        .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
     638        .dwendtag $C$DW$T$39
     639
     640
     641$C$DW$T$45      .dwtag  DW_TAG_union_type
     642        .dwattr $C$DW$T$45, DW_AT_byte_size(0x40c)
     643$C$DW$40        .dwtag  DW_TAG_member
     644        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$40)
     645        .dwattr $C$DW$40, DW_AT_name("mailbox_test")
     646        .dwattr $C$DW$40, DW_AT_TI_symbol_name("mailbox_test")
     647        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     649        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     650        .dwattr $C$DW$40, DW_AT_decl_line(0x9b)
     651        .dwattr $C$DW$40, DW_AT_decl_column(0x12)
     652
     653$C$DW$41        .dwtag  DW_TAG_member
     654        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$41)
     655        .dwattr $C$DW$41, DW_AT_name("buslatch")
     656        .dwattr $C$DW$41, DW_AT_TI_symbol_name("buslatch")
     657        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE   13

     659        .dwattr $C$DW$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     660        .dwattr $C$DW$41, DW_AT_decl_line(0x9c)
     661        .dwattr $C$DW$41, DW_AT_decl_column(0x16)
     662
     663$C$DW$42        .dwtag  DW_TAG_member
     664        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$42)
     665        .dwattr $C$DW$42, DW_AT_name("buslatch_test")
     666        .dwattr $C$DW$42, DW_AT_TI_symbol_name("buslatch_test")
     667        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     669        .dwattr $C$DW$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     670        .dwattr $C$DW$42, DW_AT_decl_line(0x9d)
     671        .dwattr $C$DW$42, DW_AT_decl_column(0x1b)
     672
     673$C$DW$43        .dwtag  DW_TAG_member
     674        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$43)
     675        .dwattr $C$DW$43, DW_AT_name("dma")
     676        .dwattr $C$DW$43, DW_AT_TI_symbol_name("dma")
     677        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     679        .dwattr $C$DW$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     680        .dwattr $C$DW$43, DW_AT_decl_line(0x9e)
     681        .dwattr $C$DW$43, DW_AT_decl_column(0x11)
     682
     683$C$DW$44        .dwtag  DW_TAG_member
     684        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$44)
     685        .dwattr $C$DW$44, DW_AT_name("intr")
     686        .dwattr $C$DW$44, DW_AT_TI_symbol_name("intr")
     687        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     689        .dwattr $C$DW$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     690        .dwattr $C$DW$44, DW_AT_decl_line(0x9f)
     691        .dwattr $C$DW$44, DW_AT_decl_column(0x12)
     692
     693        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     694        .dwattr $C$DW$T$45, DW_AT_decl_line(0x9a)
     695        .dwattr $C$DW$T$45, DW_AT_decl_column(0x08)
     696        .dwendtag $C$DW$T$45
     697
     698$C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     699        .dwattr $C$DW$T$2, DW_AT_name("void")
     700
     701$C$DW$T$4       .dwtag  DW_TAG_base_type
     702        .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     703        .dwattr $C$DW$T$4, DW_AT_name("bool")
     704        .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     705
     706$C$DW$T$5       .dwtag  DW_TAG_base_type
     707        .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     708        .dwattr $C$DW$T$5, DW_AT_name("signed char")
     709        .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     710
     711$C$DW$T$6       .dwtag  DW_TAG_base_type
     712        .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     713        .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:31 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_ddrmem.asm                                                      PAGE   14

     714        .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     715
     716$C$DW$T$22      .dwtag  DW_TAG_typedef
     717        .dwattr $C$DW$T$22, DW_AT_name("uint8_t")
     718        .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
     719        .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     720        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     721        .dwattr $C$DW$T$22, DW_AT_decl_line(0x3d)
     722        .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
     723
     724
     725$C$DW$T$38      .dwtag  DW_TAG_array_type
     726        .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
     727        .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     728        .dwattr $C$DW$T$38, DW_AT_byte_size(0x40000)
     729$C$DW$45        .dwtag  DW_TAG_subrange_type
     730        .dwattr $C$DW$45, DW_AT_upper_bound(0x3ffff)
     731
     732        .dwendtag $C$DW$T$38
     733
     734$C$DW$T$7       .dwtag  DW_TAG_base_type
     735        .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     736        .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     737        .dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
     738
     739$C$DW$T$8       .dwtag  DW_TAG_base_type
     740        .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     741        .dwattr $C$DW$T$8, DW_AT_name("short")
     742        .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     743
     744$C$DW$T$9       .dwtag  DW_TAG_base_type
     745        .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     746        .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     747        .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
     748
     749$C$DW$T$24      .dwtag  DW_TAG_typedef
     750        .dwattr $C$DW$T$24, DW_AT_name("uint16_t")
     751        .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$9)
     752        .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     753        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     754        .dwattr $C$DW$T$24, DW_AT_decl_line(0x3f)
     755        .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
     756
     757
     758$C$DW$T$29      .dwtag  DW_TAG_array_type
     759        .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$24)
     760        .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     761        .dwattr $C$DW$T$29, DW_AT_byte_size(0x400)
