PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:39 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_statemachine_slave.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

    1268        .dwcfi  restore_reg, 24
    1269        .dwcfi  restore_reg, 25
    1270        .dwcfi  restore_reg, 26
    1271        .dwcfi  restore_reg, 27
    1272 00000248 0000000110E2E2          ADD       r2, r2, 0x10          ; [ALU_PRU] 
    1273        .dwcfi  cfa_offset, 0
    1274$C$DW$59        .dwtag  DW_TAG_TI_branch
    1275        .dwattr $C$DW$59, DW_AT_low_pc(0x00)
    1276        .dwattr $C$DW$59, DW_AT_TI_return
    1277
    1278 0000024c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1279        .dwattr $C$DW$35, DW_AT_TI_end_file("pru1_statemachine_slave.c")
    1280        .dwattr $C$DW$35, DW_AT_TI_end_line(0xa8)
    1281        .dwattr $C$DW$35, DW_AT_TI_end_column(0x01)
    1282        .dwendentry
    1283        .dwendtag $C$DW$35
    1284
    1285 00000000                         .sect   ".text:sm_slave_start"
    1286        .clink
    1287        .global ||sm_slave_start||
    1288
    1289$C$DW$60        .dwtag  DW_TAG_subprogram
    1290        .dwattr $C$DW$60, DW_AT_name("sm_slave_start")
    1291        .dwattr $C$DW$60, DW_AT_low_pc(||sm_slave_start||)
    1292        .dwattr $C$DW$60, DW_AT_high_pc(0x00)
    1293        .dwattr $C$DW$60, DW_AT_TI_symbol_name("sm_slave_start")
    1294        .dwattr $C$DW$60, DW_AT_external
    1295        .dwattr $C$DW$60, DW_AT_TI_begin_file("pru1_statemachine_slave.c")
    1296        .dwattr $C$DW$60, DW_AT_TI_begin_line(0x3a)
    1297        .dwattr $C$DW$60, DW_AT_TI_begin_column(0x06)
    1298        .dwattr $C$DW$60, DW_AT_decl_file("pru1_statemachine_slave.c")
    1299        .dwattr $C$DW$60, DW_AT_decl_line(0x3a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   25

    1300        .dwattr $C$DW$60, DW_AT_decl_column(0x06)
    1301        .dwattr $C$DW$60, DW_AT_TI_max_frame_size(0x00)
    1302        .dwpsn  file "pru1_statemachine_slave.c",line 58,column 23,is_stmt,address ||sm_slave_start||,
    1303
    1304        .dwfde $C$DW$CIE, ||sm_slave_start||
    1305;----------------------------------------------------------------------
    1306;  58 | void sm_slave_start() {                                                
    1307;----------------------------------------------------------------------
    1308
    1309;***************************************************************
    1310;* FNAME: sm_slave_start                FR SIZE:   0           *
    1311;*                                                             *
    1312;* FUNCTION ENVIRONMENT                                        *
    1313;*                                                             *
    1314;* FUNCTION PROPERTIES                                         *
    1315;*                            0 Auto,  0 SOE     *
    1316;***************************************************************
    1317
    1318 00000000                 ||sm_slave_start||:
    1319;* --------------------------------------------------------------------------*
    1320        .dwcfi  cfa_offset, 0
    1321;*** 59 -----------------------    sm_slave.state = &sm_slave_state_1;
    1322;***    -----------------------    return;
    1323        .dwpsn  file "pru1_statemachine_slave.c",line 59,column 2,is_stmt,isa 0
    1324;----------------------------------------------------------------------
    1325;  59 | sm_slave.state = &sm_slave_state_1;                                    
    1326;  60 | // next call to sm_slave.state() starts state machine                  
    1327;----------------------------------------------------------------------
    1328 00000000 000000240000E0!         LDI       r0, ||sm_slave||      ; [ALU_PRU] |59| sm_slave
    1329 00000004 00000024000081!         LDI       r1.w0, $CODE(||sm_slave_state_1||) ; [ALU_PRU] |59| sm_slave_state_1
    1330 00000008 000000E1000081          SBBO      &r1.w0, r0, 0, 2      ; [ALU_PRU] |59| 
    1331$C$DW$61        .dwtag  DW_TAG_TI_branch
    1332        .dwattr $C$DW$61, DW_AT_low_pc(0x00)
    1333        .dwattr $C$DW$61, DW_AT_TI_return
    1334
    1335 0000000c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
    1336        .dwattr $C$DW$60, DW_AT_TI_end_file("pru1_statemachine_slave.c")
    1337        .dwattr $C$DW$60, DW_AT_TI_end_line(0x3d)
    1338        .dwattr $C$DW$60, DW_AT_TI_end_column(0x01)
    1339        .dwendentry
    1340        .dwendtag $C$DW$60
    1341
    1342;*****************************************************************************
    1343;* UNDEFINED EXTERNAL REFERENCES                                             *
    1344;*****************************************************************************
    1345        .global ||mailbox||
    1346        .global ||buslatches||
    1347        .global ||iopageregisters_read||
    1348        .global ||buslatches_pru0_dataout||
    1349        .global ||iopageregisters_write_w||
    1350        .global ||iopageregisters_write_b||
    1351
    1352;******************************************************************************
    1353;* TYPE INFORMATION                                                           *
    1354;******************************************************************************
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   26

    1355
    1356$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1357        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1358$C$DW$62        .dwtag  DW_TAG_member
    1359        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1360        .dwattr $C$DW$62, DW_AT_name("REVID")
    1361        .dwattr $C$DW$62, DW_AT_TI_symbol_name("REVID")
    1362        .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
    1363        .dwattr $C$DW$62, DW_AT_bit_size(0x20)
    1364        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1366        .dwattr $C$DW$62, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1367        .dwattr $C$DW$62, DW_AT_decl_line(0x2d)
    1368        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1369
    1370        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1371        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1372        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1373        .dwendtag $C$DW$T$19
    1374
    1375$C$DW$T$60      .dwtag  DW_TAG_volatile_type
    1376        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    1377
    1378
    1379$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1380        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1381$C$DW$63        .dwtag  DW_TAG_member
    1382        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1383        .dwattr $C$DW$63, DW_AT_name("IDLE_MODE")
    1384        .dwattr $C$DW$63, DW_AT_TI_symbol_name("IDLE_MODE")
    1385        .dwattr $C$DW$63, DW_AT_bit_offset(0x1e)
    1386        .dwattr $C$DW$63, DW_AT_bit_size(0x02)
    1387        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1389        .dwattr $C$DW$63, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1390        .dwattr $C$DW$63, DW_AT_decl_line(0x37)
    1391        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1392
    1393$C$DW$64        .dwtag  DW_TAG_member
    1394        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1395        .dwattr $C$DW$64, DW_AT_name("STANDBY_MODE")
    1396        .dwattr $C$DW$64, DW_AT_TI_symbol_name("STANDBY_MODE")
    1397        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c)
    1398        .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1399        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1401        .dwattr $C$DW$64, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1402        .dwattr $C$DW$64, DW_AT_decl_line(0x38)
    1403        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1404
    1405$C$DW$65        .dwtag  DW_TAG_member
    1406        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1407        .dwattr $C$DW$65, DW_AT_name("STANDBY_INIT")
    1408        .dwattr $C$DW$65, DW_AT_TI_symbol_name("STANDBY_INIT")
    1409        .dwattr $C$DW$65, DW_AT_bit_offset(0x1b)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   27

    1410        .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1411        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1413        .dwattr $C$DW$65, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1414        .dwattr $C$DW$65, DW_AT_decl_line(0x39)
    1415        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1416
    1417$C$DW$66        .dwtag  DW_TAG_member
    1418        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1419        .dwattr $C$DW$66, DW_AT_name("SUB_MWAIT")
    1420        .dwattr $C$DW$66, DW_AT_TI_symbol_name("SUB_MWAIT")
    1421        .dwattr $C$DW$66, DW_AT_bit_offset(0x1a)
    1422        .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1423        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1425        .dwattr $C$DW$66, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1426        .dwattr $C$DW$66, DW_AT_decl_line(0x3a)
    1427        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1428
    1429$C$DW$67        .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1431        .dwattr $C$DW$67, DW_AT_name("rsvd6")
    1432        .dwattr $C$DW$67, DW_AT_TI_symbol_name("rsvd6")
    1433        .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
    1434        .dwattr $C$DW$67, DW_AT_bit_size(0x1a)
    1435        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1437        .dwattr $C$DW$67, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1438        .dwattr $C$DW$67, DW_AT_decl_line(0x3b)
    1439        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1440
    1441        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1442        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1443        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1444        .dwendtag $C$DW$T$20
    1445
    1446$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    1447        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$20)
    1448
    1449
    1450$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1451        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1452$C$DW$68        .dwtag  DW_TAG_member
    1453        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1454        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_MODE")
    1455        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1456        .dwattr $C$DW$68, DW_AT_bit_offset(0x1e)
    1457        .dwattr $C$DW$68, DW_AT_bit_size(0x02)
    1458        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1460        .dwattr $C$DW$68, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1461        .dwattr $C$DW$68, DW_AT_decl_line(0x45)
    1462        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1463
    1464$C$DW$69        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   28

    1465        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1466        .dwattr $C$DW$69, DW_AT_name("PRU0_GPI_CLK_MODE")
    1467        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1468        .dwattr $C$DW$69, DW_AT_bit_offset(0x1d)
    1469        .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1470        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1472        .dwattr $C$DW$69, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1473        .dwattr $C$DW$69, DW_AT_decl_line(0x46)
    1474        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1475
    1476$C$DW$70        .dwtag  DW_TAG_member
    1477        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1478        .dwattr $C$DW$70, DW_AT_name("PRU0_GPI_DIV0")
    1479        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1480        .dwattr $C$DW$70, DW_AT_bit_offset(0x18)
    1481        .dwattr $C$DW$70, DW_AT_bit_size(0x05)
    1482        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1484        .dwattr $C$DW$70, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1485        .dwattr $C$DW$70, DW_AT_decl_line(0x47)
    1486        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1487
    1488$C$DW$71        .dwtag  DW_TAG_member
    1489        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1490        .dwattr $C$DW$71, DW_AT_name("PRU0_GPI_DIV1")
    1491        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1492        .dwattr $C$DW$71, DW_AT_bit_offset(0x13)
    1493        .dwattr $C$DW$71, DW_AT_bit_size(0x05)
    1494        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1496        .dwattr $C$DW$71, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1497        .dwattr $C$DW$71, DW_AT_decl_line(0x48)
    1498        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1499
    1500$C$DW$72        .dwtag  DW_TAG_member
    1501        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1502        .dwattr $C$DW$72, DW_AT_name("PRU0_GPI_SB")
    1503        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1504        .dwattr $C$DW$72, DW_AT_bit_offset(0x12)
    1505        .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1506        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1508        .dwattr $C$DW$72, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1509        .dwattr $C$DW$72, DW_AT_decl_line(0x49)
    1510        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1511
    1512$C$DW$73        .dwtag  DW_TAG_member
    1513        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1514        .dwattr $C$DW$73, DW_AT_name("PRU0_GPO_MODE")
    1515        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1516        .dwattr $C$DW$73, DW_AT_bit_offset(0x11)
    1517        .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1518        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   29

    1520        .dwattr $C$DW$73, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1521        .dwattr $C$DW$73, DW_AT_decl_line(0x4a)
    1522        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1523
    1524$C$DW$74        .dwtag  DW_TAG_member
    1525        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1526        .dwattr $C$DW$74, DW_AT_name("PRU0_GPO_DIV0")
    1527        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1528        .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
    1529        .dwattr $C$DW$74, DW_AT_bit_size(0x05)
    1530        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1532        .dwattr $C$DW$74, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1533        .dwattr $C$DW$74, DW_AT_decl_line(0x4b)
    1534        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1535
    1536$C$DW$75        .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$75, DW_AT_name("PRU0_GPO_DIV1")
    1539        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1540        .dwattr $C$DW$75, DW_AT_bit_offset(0x07)
    1541        .dwattr $C$DW$75, DW_AT_bit_size(0x05)
    1542        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1544        .dwattr $C$DW$75, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1545        .dwattr $C$DW$75, DW_AT_decl_line(0x4c)
    1546        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1547
    1548$C$DW$76        .dwtag  DW_TAG_member
    1549        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1550        .dwattr $C$DW$76, DW_AT_name("PRU0_GPO_SH_SEL")
    1551        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1552        .dwattr $C$DW$76, DW_AT_bit_offset(0x06)
    1553        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1554        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1556        .dwattr $C$DW$76, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1557        .dwattr $C$DW$76, DW_AT_decl_line(0x4d)
    1558        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1559
    1560$C$DW$77        .dwtag  DW_TAG_member
    1561        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1562        .dwattr $C$DW$77, DW_AT_name("rsvd26")
    1563        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd26")
    1564        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1565        .dwattr $C$DW$77, DW_AT_bit_size(0x06)
    1566        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1568        .dwattr $C$DW$77, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1569        .dwattr $C$DW$77, DW_AT_decl_line(0x4e)
    1570        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1571
    1572        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1573        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1574        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   30

    1575        .dwendtag $C$DW$T$21
    1576
    1577$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    1578        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$21)
    1579
    1580
    1581$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1582        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1583$C$DW$78        .dwtag  DW_TAG_member
    1584        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1585        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_MODE")
    1586        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1587        .dwattr $C$DW$78, DW_AT_bit_offset(0x1e)
    1588        .dwattr $C$DW$78, DW_AT_bit_size(0x02)
    1589        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1591        .dwattr $C$DW$78, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1592        .dwattr $C$DW$78, DW_AT_decl_line(0x58)
    1593        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1594
    1595$C$DW$79        .dwtag  DW_TAG_member
    1596        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1597        .dwattr $C$DW$79, DW_AT_name("PRU1_GPI_CLK_MODE")
    1598        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1599        .dwattr $C$DW$79, DW_AT_bit_offset(0x1d)
    1600        .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1601        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$79, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1604        .dwattr $C$DW$79, DW_AT_decl_line(0x59)
    1605        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1606
    1607$C$DW$80        .dwtag  DW_TAG_member
    1608        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1609        .dwattr $C$DW$80, DW_AT_name("PRU1_GPI_DIV0")
    1610        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1611        .dwattr $C$DW$80, DW_AT_bit_offset(0x18)
    1612        .dwattr $C$DW$80, DW_AT_bit_size(0x05)
    1613        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1615        .dwattr $C$DW$80, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1616        .dwattr $C$DW$80, DW_AT_decl_line(0x5a)
    1617        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1618
    1619$C$DW$81        .dwtag  DW_TAG_member
    1620        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1621        .dwattr $C$DW$81, DW_AT_name("PRU1_GPI_DIV1")
    1622        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1623        .dwattr $C$DW$81, DW_AT_bit_offset(0x13)
    1624        .dwattr $C$DW$81, DW_AT_bit_size(0x05)
    1625        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1627        .dwattr $C$DW$81, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1628        .dwattr $C$DW$81, DW_AT_decl_line(0x5b)
    1629        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   31

    1630
    1631$C$DW$82        .dwtag  DW_TAG_member
    1632        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1633        .dwattr $C$DW$82, DW_AT_name("PRU1_GPI_SB")
    1634        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1635        .dwattr $C$DW$82, DW_AT_bit_offset(0x12)
    1636        .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1637        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1639        .dwattr $C$DW$82, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1640        .dwattr $C$DW$82, DW_AT_decl_line(0x5c)
    1641        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1642
    1643$C$DW$83        .dwtag  DW_TAG_member
    1644        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1645        .dwattr $C$DW$83, DW_AT_name("PRU1_GPO_MODE")
    1646        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1647        .dwattr $C$DW$83, DW_AT_bit_offset(0x11)
    1648        .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1649        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1651        .dwattr $C$DW$83, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1652        .dwattr $C$DW$83, DW_AT_decl_line(0x5d)
    1653        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1654
    1655$C$DW$84        .dwtag  DW_TAG_member
    1656        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1657        .dwattr $C$DW$84, DW_AT_name("PRU1_GPO_DIV0")
    1658        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1659        .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1660        .dwattr $C$DW$84, DW_AT_bit_size(0x05)
    1661        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1663        .dwattr $C$DW$84, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1664        .dwattr $C$DW$84, DW_AT_decl_line(0x5e)
    1665        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1666
    1667$C$DW$85        .dwtag  DW_TAG_member
    1668        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1669        .dwattr $C$DW$85, DW_AT_name("PRU1_GPO_DIV1")
    1670        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1671        .dwattr $C$DW$85, DW_AT_bit_offset(0x07)
    1672        .dwattr $C$DW$85, DW_AT_bit_size(0x05)
    1673        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1675        .dwattr $C$DW$85, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1676        .dwattr $C$DW$85, DW_AT_decl_line(0x5f)
    1677        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1678
    1679$C$DW$86        .dwtag  DW_TAG_member
    1680        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1681        .dwattr $C$DW$86, DW_AT_name("PRU1_GPO_SH_SEL")
    1682        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1683        .dwattr $C$DW$86, DW_AT_bit_offset(0x06)
    1684        .dwattr $C$DW$86, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   32

    1685        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1687        .dwattr $C$DW$86, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1688        .dwattr $C$DW$86, DW_AT_decl_line(0x60)
    1689        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1690
    1691$C$DW$87        .dwtag  DW_TAG_member
    1692        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1693        .dwattr $C$DW$87, DW_AT_name("rsvd26")
    1694        .dwattr $C$DW$87, DW_AT_TI_symbol_name("rsvd26")
    1695        .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1696        .dwattr $C$DW$87, DW_AT_bit_size(0x06)
    1697        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1699        .dwattr $C$DW$87, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1700        .dwattr $C$DW$87, DW_AT_decl_line(0x61)
    1701        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1702
    1703        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1704        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1705        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1706        .dwendtag $C$DW$T$22
    1707
    1708$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    1709        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$22)
    1710
    1711
    1712$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1713        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1714$C$DW$88        .dwtag  DW_TAG_member
    1715        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1716        .dwattr $C$DW$88, DW_AT_name("PRU0_CLK_STOP_REQ")
    1717        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1718        .dwattr $C$DW$88, DW_AT_bit_offset(0x1f)
    1719        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1720        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1722        .dwattr $C$DW$88, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1723        .dwattr $C$DW$88, DW_AT_decl_line(0x6b)
    1724        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1725
    1726$C$DW$89        .dwtag  DW_TAG_member
    1727        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1728        .dwattr $C$DW$89, DW_AT_name("PRU0_CLK_STOP_ACK")
    1729        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1730        .dwattr $C$DW$89, DW_AT_bit_offset(0x1e)
    1731        .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1732        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1734        .dwattr $C$DW$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1735        .dwattr $C$DW$89, DW_AT_decl_line(0x6c)
    1736        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1737
    1738$C$DW$90        .dwtag  DW_TAG_member
    1739        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   33

    1740        .dwattr $C$DW$90, DW_AT_name("PRU0_CLK_EN")
    1741        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1742        .dwattr $C$DW$90, DW_AT_bit_offset(0x1d)
    1743        .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1744        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1746        .dwattr $C$DW$90, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1747        .dwattr $C$DW$90, DW_AT_decl_line(0x6d)
    1748        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1749
    1750$C$DW$91        .dwtag  DW_TAG_member
    1751        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1752        .dwattr $C$DW$91, DW_AT_name("PRU1_CLK_STOP_REQ")
    1753        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1754        .dwattr $C$DW$91, DW_AT_bit_offset(0x1c)
    1755        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1756        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1758        .dwattr $C$DW$91, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1759        .dwattr $C$DW$91, DW_AT_decl_line(0x6e)
    1760        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1761
    1762$C$DW$92        .dwtag  DW_TAG_member
    1763        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1764        .dwattr $C$DW$92, DW_AT_name("PRU1_CLK_STOP_ACK")
    1765        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1766        .dwattr $C$DW$92, DW_AT_bit_offset(0x1b)
    1767        .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1768        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1770        .dwattr $C$DW$92, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1771        .dwattr $C$DW$92, DW_AT_decl_line(0x6f)
    1772        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1773
    1774$C$DW$93        .dwtag  DW_TAG_member
    1775        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1776        .dwattr $C$DW$93, DW_AT_name("PRU1_CLK_EN")
    1777        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1778        .dwattr $C$DW$93, DW_AT_bit_offset(0x1a)
    1779        .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1780        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1782        .dwattr $C$DW$93, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1783        .dwattr $C$DW$93, DW_AT_decl_line(0x70)
    1784        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1785
    1786$C$DW$94        .dwtag  DW_TAG_member
    1787        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1788        .dwattr $C$DW$94, DW_AT_name("INTC_CLK_STOP_REQ")
    1789        .dwattr $C$DW$94, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1790        .dwattr $C$DW$94, DW_AT_bit_offset(0x19)
    1791        .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1792        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1794        .dwattr $C$DW$94, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   34

    1795        .dwattr $C$DW$94, DW_AT_decl_line(0x71)
    1796        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1797
    1798$C$DW$95        .dwtag  DW_TAG_member
    1799        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1800        .dwattr $C$DW$95, DW_AT_name("INTC_CLK_STOP_ACK")
    1801        .dwattr $C$DW$95, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1802        .dwattr $C$DW$95, DW_AT_bit_offset(0x18)
    1803        .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1804        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1806        .dwattr $C$DW$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1807        .dwattr $C$DW$95, DW_AT_decl_line(0x72)
    1808        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1809
    1810$C$DW$96        .dwtag  DW_TAG_member
    1811        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1812        .dwattr $C$DW$96, DW_AT_name("INTC_CLK_EN")
    1813        .dwattr $C$DW$96, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1814        .dwattr $C$DW$96, DW_AT_bit_offset(0x17)
    1815        .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1816        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1818        .dwattr $C$DW$96, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1819        .dwattr $C$DW$96, DW_AT_decl_line(0x73)
    1820        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1821
    1822$C$DW$97        .dwtag  DW_TAG_member
    1823        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1824        .dwattr $C$DW$97, DW_AT_name("UART_CLK_STOP_REQ")
    1825        .dwattr $C$DW$97, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1826        .dwattr $C$DW$97, DW_AT_bit_offset(0x16)
    1827        .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1828        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1830        .dwattr $C$DW$97, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1831        .dwattr $C$DW$97, DW_AT_decl_line(0x74)
    1832        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1833
    1834$C$DW$98        .dwtag  DW_TAG_member
    1835        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1836        .dwattr $C$DW$98, DW_AT_name("UART_CLK_STOP_ACK")
    1837        .dwattr $C$DW$98, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1838        .dwattr $C$DW$98, DW_AT_bit_offset(0x15)
    1839        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1840        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1842        .dwattr $C$DW$98, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1843        .dwattr $C$DW$98, DW_AT_decl_line(0x75)
    1844        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1845
    1846$C$DW$99        .dwtag  DW_TAG_member
    1847        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1848        .dwattr $C$DW$99, DW_AT_name("UART_CLK_EN")
    1849        .dwattr $C$DW$99, DW_AT_TI_symbol_name("UART_CLK_EN")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   35

    1850        .dwattr $C$DW$99, DW_AT_bit_offset(0x14)
    1851        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1852        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1854        .dwattr $C$DW$99, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile
    1855        .dwattr $C$DW$99, DW_AT_decl_line(0x76)
    1856        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1857
    1858$C$DW$100       .dwtag  DW_TAG_member
    1859        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1860        .dwattr $C$DW$100, DW_AT_name("ECAP_CLK_STOP_REQ")
    1861        .dwattr $C$DW$100, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1862        .dwattr $C$DW$100, DW_AT_bit_offset(0x13)
    1863        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1864        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1866        .dwattr $C$DW$100, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1867        .dwattr $C$DW$100, DW_AT_decl_line(0x77)
    1868        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1869
    1870$C$DW$101       .dwtag  DW_TAG_member
    1871        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1872        .dwattr $C$DW$101, DW_AT_name("ECAP_CLK_STOP_ACK")
    1873        .dwattr $C$DW$101, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1874        .dwattr $C$DW$101, DW_AT_bit_offset(0x12)
    1875        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1876        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1878        .dwattr $C$DW$101, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1879        .dwattr $C$DW$101, DW_AT_decl_line(0x78)
    1880        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1881
    1882$C$DW$102       .dwtag  DW_TAG_member
    1883        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1884        .dwattr $C$DW$102, DW_AT_name("ECAP_CLK_EN")
    1885        .dwattr $C$DW$102, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1886        .dwattr $C$DW$102, DW_AT_bit_offset(0x11)
    1887        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1888        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1890        .dwattr $C$DW$102, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1891        .dwattr $C$DW$102, DW_AT_decl_line(0x79)
    1892        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1893
    1894$C$DW$103       .dwtag  DW_TAG_member
    1895        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1896        .dwattr $C$DW$103, DW_AT_name("IEP_CLK_STOP_REQ")
    1897        .dwattr $C$DW$103, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1898        .dwattr $C$DW$103, DW_AT_bit_offset(0x10)
    1899        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1900        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1902        .dwattr $C$DW$103, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1903        .dwattr $C$DW$103, DW_AT_decl_line(0x7a)
    1904        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   36

    1905
    1906$C$DW$104       .dwtag  DW_TAG_member
    1907        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1908        .dwattr $C$DW$104, DW_AT_name("IEP_CLK_STOP_ACK")
    1909        .dwattr $C$DW$104, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1910        .dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
    1911        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1912        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1914        .dwattr $C$DW$104, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1915        .dwattr $C$DW$104, DW_AT_decl_line(0x7b)
    1916        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1917
    1918$C$DW$105       .dwtag  DW_TAG_member
    1919        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1920        .dwattr $C$DW$105, DW_AT_name("IEP_CLK_EN")
    1921        .dwattr $C$DW$105, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1922        .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1923        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1924        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1926        .dwattr $C$DW$105, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1927        .dwattr $C$DW$105, DW_AT_decl_line(0x7c)
    1928        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1929
    1930$C$DW$106       .dwtag  DW_TAG_member
    1931        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1932        .dwattr $C$DW$106, DW_AT_name("rsvd18")
    1933        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd18")
    1934        .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    1935        .dwattr $C$DW$106, DW_AT_bit_size(0x0e)
    1936        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1938        .dwattr $C$DW$106, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1939        .dwattr $C$DW$106, DW_AT_decl_line(0x7d)
    1940        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1941
    1942        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    1943        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1944        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1945        .dwendtag $C$DW$T$23
    1946
    1947$C$DW$T$68      .dwtag  DW_TAG_volatile_type
    1948        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    1949
    1950
    1951$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1952        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1953$C$DW$107       .dwtag  DW_TAG_member
    1954        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1955        .dwattr $C$DW$107, DW_AT_name("PRU0_IMEM_PE_RAW")
    1956        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1957        .dwattr $C$DW$107, DW_AT_bit_offset(0x1c)
    1958        .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1959        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   37

    1960        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1961        .dwattr $C$DW$107, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1962        .dwattr $C$DW$107, DW_AT_decl_line(0x87)
    1963        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1964
    1965$C$DW$108       .dwtag  DW_TAG_member
    1966        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1967        .dwattr $C$DW$108, DW_AT_name("PRU0_DMEM_PE_RAW")
    1968        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1969        .dwattr $C$DW$108, DW_AT_bit_offset(0x18)
    1970        .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1971        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1973        .dwattr $C$DW$108, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1974        .dwattr $C$DW$108, DW_AT_decl_line(0x88)
    1975        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1976
    1977$C$DW$109       .dwtag  DW_TAG_member
    1978        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1979        .dwattr $C$DW$109, DW_AT_name("PRU1_IMEM_PE_RAW")
    1980        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1981        .dwattr $C$DW$109, DW_AT_bit_offset(0x14)
    1982        .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1983        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1985        .dwattr $C$DW$109, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1986        .dwattr $C$DW$109, DW_AT_decl_line(0x89)
    1987        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1988
    1989$C$DW$110       .dwtag  DW_TAG_member
    1990        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1991        .dwattr $C$DW$110, DW_AT_name("PRU1_DMEM_PE_RAW")
    1992        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1993        .dwattr $C$DW$110, DW_AT_bit_offset(0x10)
    1994        .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1995        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1997        .dwattr $C$DW$110, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    1998        .dwattr $C$DW$110, DW_AT_decl_line(0x8a)
    1999        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    2000
    2001$C$DW$111       .dwtag  DW_TAG_member
    2002        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    2003        .dwattr $C$DW$111, DW_AT_name("RAM_PE_RAW")
    2004        .dwattr $C$DW$111, DW_AT_TI_symbol_name("RAM_PE_RAW")
    2005        .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    2006        .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    2007        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2009        .dwattr $C$DW$111, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2010        .dwattr $C$DW$111, DW_AT_decl_line(0x8b)
    2011        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    2012
    2013$C$DW$112       .dwtag  DW_TAG_member
    2014        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   38

    2015        .dwattr $C$DW$112, DW_AT_name("rsvd20")
    2016        .dwattr $C$DW$112, DW_AT_TI_symbol_name("rsvd20")
    2017        .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    2018        .dwattr $C$DW$112, DW_AT_bit_size(0x0c)
    2019        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2020        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2021        .dwattr $C$DW$112, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2022        .dwattr $C$DW$112, DW_AT_decl_line(0x8c)
    2023        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    2024
    2025        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2026        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    2027        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    2028        .dwendtag $C$DW$T$24
    2029
    2030$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    2031        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$24)
    2032
    2033
    2034$C$DW$T$25      .dwtag  DW_TAG_structure_type
    2035        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    2036$C$DW$113       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    2038        .dwattr $C$DW$113, DW_AT_name("PRU0_IMEM_PE")
    2039        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    2040        .dwattr $C$DW$113, DW_AT_bit_offset(0x1c)
    2041        .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    2042        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2044        .dwattr $C$DW$113, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2045        .dwattr $C$DW$113, DW_AT_decl_line(0x96)
    2046        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    2047
    2048$C$DW$114       .dwtag  DW_TAG_member
    2049        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    2050        .dwattr $C$DW$114, DW_AT_name("PRU0_DMEM_PE")
    2051        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    2052        .dwattr $C$DW$114, DW_AT_bit_offset(0x18)
    2053        .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    2054        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2056        .dwattr $C$DW$114, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2057        .dwattr $C$DW$114, DW_AT_decl_line(0x97)
    2058        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    2059
    2060$C$DW$115       .dwtag  DW_TAG_member
    2061        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    2062        .dwattr $C$DW$115, DW_AT_name("PRU1_IMEM_PE")
    2063        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    2064        .dwattr $C$DW$115, DW_AT_bit_offset(0x14)
    2065        .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    2066        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2068        .dwattr $C$DW$115, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2069        .dwattr $C$DW$115, DW_AT_decl_line(0x98)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   39

    2070        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    2071
    2072$C$DW$116       .dwtag  DW_TAG_member
    2073        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    2074        .dwattr $C$DW$116, DW_AT_name("PRU1_DMEM_PE")
    2075        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    2076        .dwattr $C$DW$116, DW_AT_bit_offset(0x10)
    2077        .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    2078        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2080        .dwattr $C$DW$116, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2081        .dwattr $C$DW$116, DW_AT_decl_line(0x99)
    2082        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    2083
    2084$C$DW$117       .dwtag  DW_TAG_member
    2085        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    2086        .dwattr $C$DW$117, DW_AT_name("RAM_PE")
    2087        .dwattr $C$DW$117, DW_AT_TI_symbol_name("RAM_PE")
    2088        .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    2089        .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    2090        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2092        .dwattr $C$DW$117, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2093        .dwattr $C$DW$117, DW_AT_decl_line(0x9a)
    2094        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    2095
    2096$C$DW$118       .dwtag  DW_TAG_member
    2097        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    2098        .dwattr $C$DW$118, DW_AT_name("rsvd20")
    2099        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd20")
    2100        .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2101        .dwattr $C$DW$118, DW_AT_bit_size(0x0c)
    2102        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2104        .dwattr $C$DW$118, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2105        .dwattr $C$DW$118, DW_AT_decl_line(0x9b)
    2106        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    2107
    2108        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2109        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    2110        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    2111        .dwendtag $C$DW$T$25
    2112
    2113$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    2114        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
    2115
    2116
    2117$C$DW$T$26      .dwtag  DW_TAG_structure_type
    2118        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2119$C$DW$119       .dwtag  DW_TAG_member
    2120        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    2121        .dwattr $C$DW$119, DW_AT_name("PRU0_IMEM_PE_SET")
    2122        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    2123        .dwattr $C$DW$119, DW_AT_bit_offset(0x1c)
    2124        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   40

    2125        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2127        .dwattr $C$DW$119, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2128        .dwattr $C$DW$119, DW_AT_decl_line(0xa4)
    2129        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    2130
    2131$C$DW$120       .dwtag  DW_TAG_member
    2132        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    2133        .dwattr $C$DW$120, DW_AT_name("PRU0_DMEM_PE_SET")
    2134        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    2135        .dwattr $C$DW$120, DW_AT_bit_offset(0x18)
    2136        .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    2137        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2139        .dwattr $C$DW$120, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2140        .dwattr $C$DW$120, DW_AT_decl_line(0xa5)
    2141        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    2142
    2143$C$DW$121       .dwtag  DW_TAG_member
    2144        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    2145        .dwattr $C$DW$121, DW_AT_name("PRU1_IMEM_PE_SET")
    2146        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    2147        .dwattr $C$DW$121, DW_AT_bit_offset(0x14)
    2148        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    2149        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2151        .dwattr $C$DW$121, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2152        .dwattr $C$DW$121, DW_AT_decl_line(0xa6)
    2153        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2154
    2155$C$DW$122       .dwtag  DW_TAG_member
    2156        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    2157        .dwattr $C$DW$122, DW_AT_name("PRU1_DMEM_PE_SET")
    2158        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    2159        .dwattr $C$DW$122, DW_AT_bit_offset(0x10)
    2160        .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    2161        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2163        .dwattr $C$DW$122, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2164        .dwattr $C$DW$122, DW_AT_decl_line(0xa7)
    2165        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    2166
    2167$C$DW$123       .dwtag  DW_TAG_member
    2168        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    2169        .dwattr $C$DW$123, DW_AT_name("RAM_PE_SET")
    2170        .dwattr $C$DW$123, DW_AT_TI_symbol_name("RAM_PE_SET")
    2171        .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    2172        .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    2173        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2175        .dwattr $C$DW$123, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2176        .dwattr $C$DW$123, DW_AT_decl_line(0xa8)
    2177        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    2178
    2179$C$DW$124       .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   41

    2180        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2181        .dwattr $C$DW$124, DW_AT_name("rsvd20")
    2182        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd20")
    2183        .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2184        .dwattr $C$DW$124, DW_AT_bit_size(0x0c)
    2185        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2187        .dwattr $C$DW$124, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2188        .dwattr $C$DW$124, DW_AT_decl_line(0xa9)
    2189        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2190
    2191        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2192        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    2193        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    2194        .dwendtag $C$DW$T$26
    2195
    2196$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    2197        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$26)
    2198
    2199
    2200$C$DW$T$27      .dwtag  DW_TAG_structure_type
    2201        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2202$C$DW$125       .dwtag  DW_TAG_member
    2203        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2204        .dwattr $C$DW$125, DW_AT_name("PRU0_IMEM_PE_CLR")
    2205        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    2206        .dwattr $C$DW$125, DW_AT_bit_offset(0x1c)
    2207        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    2208        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2210        .dwattr $C$DW$125, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2211        .dwattr $C$DW$125, DW_AT_decl_line(0xb3)
    2212        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    2213
    2214$C$DW$126       .dwtag  DW_TAG_member
    2215        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2216        .dwattr $C$DW$126, DW_AT_name("PRU0_DMEM_PE_CLR")
    2217        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    2218        .dwattr $C$DW$126, DW_AT_bit_offset(0x18)
    2219        .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    2220        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2222        .dwattr $C$DW$126, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2223        .dwattr $C$DW$126, DW_AT_decl_line(0xb4)
    2224        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2225
    2226$C$DW$127       .dwtag  DW_TAG_member
    2227        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2228        .dwattr $C$DW$127, DW_AT_name("PRU1_IMEM_PE_CLR")
    2229        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    2230        .dwattr $C$DW$127, DW_AT_bit_offset(0x14)
    2231        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    2232        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2234        .dwattr $C$DW$127, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   42

    2235        .dwattr $C$DW$127, DW_AT_decl_line(0xb5)
    2236        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2237
    2238$C$DW$128       .dwtag  DW_TAG_member
    2239        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2240        .dwattr $C$DW$128, DW_AT_name("PRU1_DMEM_PE_CLR")
    2241        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    2242        .dwattr $C$DW$128, DW_AT_bit_offset(0x10)
    2243        .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    2244        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2246        .dwattr $C$DW$128, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2247        .dwattr $C$DW$128, DW_AT_decl_line(0xb6)
    2248        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2249
    2250$C$DW$129       .dwtag  DW_TAG_member
    2251        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2252        .dwattr $C$DW$129, DW_AT_name("rsvd16")
    2253        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd16")
    2254        .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2255        .dwattr $C$DW$129, DW_AT_bit_size(0x10)
    2256        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2258        .dwattr $C$DW$129, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2259        .dwattr $C$DW$129, DW_AT_decl_line(0xb7)
    2260        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2261
    2262        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2263        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    2264        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    2265        .dwendtag $C$DW$T$27
    2266
    2267$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    2268        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$27)
    2269
    2270
    2271$C$DW$T$28      .dwtag  DW_TAG_structure_type
    2272        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2273$C$DW$130       .dwtag  DW_TAG_member
    2274        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2275        .dwattr $C$DW$130, DW_AT_name("PMAO_PRU0")
    2276        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PMAO_PRU0")
    2277        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f)
    2278        .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2279        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2281        .dwattr $C$DW$130, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2282        .dwattr $C$DW$130, DW_AT_decl_line(0xc4)
    2283        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2284
    2285$C$DW$131       .dwtag  DW_TAG_member
    2286        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2287        .dwattr $C$DW$131, DW_AT_name("PMAO_PRU1")
    2288        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PMAO_PRU1")
    2289        .dwattr $C$DW$131, DW_AT_bit_offset(0x1e)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   43

    2290        .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2291        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2293        .dwattr $C$DW$131, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2294        .dwattr $C$DW$131, DW_AT_decl_line(0xc5)
    2295        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2296
    2297$C$DW$132       .dwtag  DW_TAG_member
    2298        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2299        .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2300        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd2")
    2301        .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2302        .dwattr $C$DW$132, DW_AT_bit_size(0x1e)
    2303        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$132, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2306        .dwattr $C$DW$132, DW_AT_decl_line(0xc6)
    2307        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2308
    2309        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2310        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    2311        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    2312        .dwendtag $C$DW$T$28
    2313
    2314$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    2315        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$28)
    2316
    2317
    2318$C$DW$T$29      .dwtag  DW_TAG_structure_type
    2319        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2320$C$DW$133       .dwtag  DW_TAG_member
    2321        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2322        .dwattr $C$DW$133, DW_AT_name("OCP_EN")
    2323        .dwattr $C$DW$133, DW_AT_TI_symbol_name("OCP_EN")
    2324        .dwattr $C$DW$133, DW_AT_bit_offset(0x1f)
    2325        .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2326        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2328        .dwattr $C$DW$133, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2329        .dwattr $C$DW$133, DW_AT_decl_line(0xd3)
    2330        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2331
    2332$C$DW$134       .dwtag  DW_TAG_member
    2333        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2334        .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2335        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd1")
    2336        .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2337        .dwattr $C$DW$134, DW_AT_bit_size(0x1f)
    2338        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2340        .dwattr $C$DW$134, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2341        .dwattr $C$DW$134, DW_AT_decl_line(0xd4)
    2342        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2343
    2344        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   44

    2345        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    2346        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    2347        .dwendtag $C$DW$T$29
    2348
    2349$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    2350        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$29)
    2351
    2352
    2353$C$DW$T$30      .dwtag  DW_TAG_structure_type
    2354        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2355$C$DW$135       .dwtag  DW_TAG_member
    2356        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2357        .dwattr $C$DW$135, DW_AT_name("PRU1_PAD_HP_EN")
    2358        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    2359        .dwattr $C$DW$135, DW_AT_bit_offset(0x1f)
    2360        .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2361        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2363        .dwattr $C$DW$135, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2364        .dwattr $C$DW$135, DW_AT_decl_line(0xde)
    2365        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2366
    2367$C$DW$136       .dwtag  DW_TAG_member
    2368        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2369        .dwattr $C$DW$136, DW_AT_name("XFR_SHIFT_EN")
    2370        .dwattr $C$DW$136, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    2371        .dwattr $C$DW$136, DW_AT_bit_offset(0x1e)
    2372        .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2373        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2375        .dwattr $C$DW$136, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2376        .dwattr $C$DW$136, DW_AT_decl_line(0xdf)
    2377        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2378
    2379$C$DW$137       .dwtag  DW_TAG_member
    2380        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2381        .dwattr $C$DW$137, DW_AT_name("rsvd2")
    2382        .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd2")
    2383        .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2384        .dwattr $C$DW$137, DW_AT_bit_size(0x1e)
    2385        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2387        .dwattr $C$DW$137, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2388        .dwattr $C$DW$137, DW_AT_decl_line(0xe0)
    2389        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2390
    2391        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2392        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    2393        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    2394        .dwendtag $C$DW$T$30
    2395
    2396$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    2397        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$30)
    2398
    2399
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   45

    2400$C$DW$T$31      .dwtag  DW_TAG_structure_type
    2401        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2402$C$DW$138       .dwtag  DW_TAG_member
    2403        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2404        .dwattr $C$DW$138, DW_AT_name("PIN_MUX_SEL")
    2405        .dwattr $C$DW$138, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    2406        .dwattr $C$DW$138, DW_AT_bit_offset(0x18)
    2407        .dwattr $C$DW$138, DW_AT_bit_size(0x08)
    2408        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2409        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2410        .dwattr $C$DW$138, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2411        .dwattr $C$DW$138, DW_AT_decl_line(0xec)
    2412        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2413
    2414$C$DW$139       .dwtag  DW_TAG_member
    2415        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2416        .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2417        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd2")
    2418        .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2419        .dwattr $C$DW$139, DW_AT_bit_size(0x18)
    2420        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2422        .dwattr $C$DW$139, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2423        .dwattr $C$DW$139, DW_AT_decl_line(0xed)
    2424        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2425
    2426        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2427        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    2428        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    2429        .dwendtag $C$DW$T$31
    2430
    2431$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    2432        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$31)
    2433
    2434
    2435$C$DW$T$35      .dwtag  DW_TAG_structure_type
    2436        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    2437$C$DW$140       .dwtag  DW_TAG_member
    2438        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$61)
    2439        .dwattr $C$DW$140, DW_AT_name("$P$T0")
    2440        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T0")
    2441        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2443        .dwattr $C$DW$140, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2444        .dwattr $C$DW$140, DW_AT_decl_line(0x29)
    2445        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2446
    2447$C$DW$141       .dwtag  DW_TAG_member
    2448        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$63)
    2449        .dwattr $C$DW$141, DW_AT_name("$P$T1")
    2450        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T1")
    2451        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2452        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2453        .dwattr $C$DW$141, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2454        .dwattr $C$DW$141, DW_AT_decl_line(0x33)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   46

    2455        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2456
    2457$C$DW$142       .dwtag  DW_TAG_member
    2458        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$65)
    2459        .dwattr $C$DW$142, DW_AT_name("$P$T2")
    2460        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T2")
    2461        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2462        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2463        .dwattr $C$DW$142, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2464        .dwattr $C$DW$142, DW_AT_decl_line(0x41)
    2465        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2466
    2467$C$DW$143       .dwtag  DW_TAG_member
    2468        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$67)
    2469        .dwattr $C$DW$143, DW_AT_name("$P$T3")
    2470        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T3")
    2471        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2472        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2473        .dwattr $C$DW$143, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2474        .dwattr $C$DW$143, DW_AT_decl_line(0x54)
    2475        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2476
    2477$C$DW$144       .dwtag  DW_TAG_member
    2478        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$69)
    2479        .dwattr $C$DW$144, DW_AT_name("$P$T4")
    2480        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T4")
    2481        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2482        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2483        .dwattr $C$DW$144, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2484        .dwattr $C$DW$144, DW_AT_decl_line(0x67)
    2485        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2486
    2487$C$DW$145       .dwtag  DW_TAG_member
    2488        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$71)
    2489        .dwattr $C$DW$145, DW_AT_name("$P$T5")
    2490        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T5")
    2491        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2492        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2493        .dwattr $C$DW$145, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2494        .dwattr $C$DW$145, DW_AT_decl_line(0x83)
    2495        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2496
    2497$C$DW$146       .dwtag  DW_TAG_member
    2498        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$73)
    2499        .dwattr $C$DW$146, DW_AT_name("$P$T6")
    2500        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T6")
    2501        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2502        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2503        .dwattr $C$DW$146, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2504        .dwattr $C$DW$146, DW_AT_decl_line(0x92)
    2505        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2506
    2507$C$DW$147       .dwtag  DW_TAG_member
    2508        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$75)
    2509        .dwattr $C$DW$147, DW_AT_name("$P$T7")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   47

    2510        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T7")
    2511        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2512        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2513        .dwattr $C$DW$147, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2514        .dwattr $C$DW$147, DW_AT_decl_line(0xa0)
    2515        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2516
    2517$C$DW$148       .dwtag  DW_TAG_member
    2518        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$77)
    2519        .dwattr $C$DW$148, DW_AT_name("$P$T8")
    2520        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T8")
    2521        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2522        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2523        .dwattr $C$DW$148, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2524        .dwattr $C$DW$148, DW_AT_decl_line(0xaf)
    2525        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2526
    2527$C$DW$149       .dwtag  DW_TAG_member
    2528        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
    2529        .dwattr $C$DW$149, DW_AT_name("rsvd24")
    2530        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd24")
    2531        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2532        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2533        .dwattr $C$DW$149, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2534        .dwattr $C$DW$149, DW_AT_decl_line(0xbc)
    2535        .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    2536
    2537$C$DW$150       .dwtag  DW_TAG_member
    2538        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$79)
    2539        .dwattr $C$DW$150, DW_AT_name("$P$T9")
    2540        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T9")
    2541        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2542        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2543        .dwattr $C$DW$150, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2544        .dwattr $C$DW$150, DW_AT_decl_line(0xc0)
    2545        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2546
    2547$C$DW$151       .dwtag  DW_TAG_member
    2548        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$33)
    2549        .dwattr $C$DW$151, DW_AT_name("rsvd2c")
    2550        .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd2c")
    2551        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2552        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2553        .dwattr $C$DW$151, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2554        .dwattr $C$DW$151, DW_AT_decl_line(0xcb)
    2555        .dwattr $C$DW$151, DW_AT_decl_column(0x0b)
    2556
    2557$C$DW$152       .dwtag  DW_TAG_member
    2558        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$81)
    2559        .dwattr $C$DW$152, DW_AT_name("$P$T10")
    2560        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T10")
    2561        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2562        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2563        .dwattr $C$DW$152, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2564        .dwattr $C$DW$152, DW_AT_decl_line(0xcf)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   48

    2565        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2566
    2567$C$DW$153       .dwtag  DW_TAG_member
    2568        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$83)
    2569        .dwattr $C$DW$153, DW_AT_name("$P$T11")
    2570        .dwattr $C$DW$153, DW_AT_TI_symbol_name("$P$T11")
    2571        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2572        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2573        .dwattr $C$DW$153, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2574        .dwattr $C$DW$153, DW_AT_decl_line(0xda)
    2575        .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    2576
    2577$C$DW$154       .dwtag  DW_TAG_member
    2578        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$34)
    2579        .dwattr $C$DW$154, DW_AT_name("rsvd38")
    2580        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd38")
    2581        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2582        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2583        .dwattr $C$DW$154, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2584        .dwattr $C$DW$154, DW_AT_decl_line(0xe5)
    2585        .dwattr $C$DW$154, DW_AT_decl_column(0x0b)
    2586
    2587$C$DW$155       .dwtag  DW_TAG_member
    2588        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$85)
    2589        .dwattr $C$DW$155, DW_AT_name("$P$T12")
    2590        .dwattr $C$DW$155, DW_AT_TI_symbol_name("$P$T12")
    2591        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2592        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2593        .dwattr $C$DW$155, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compil
    2594        .dwattr $C$DW$155, DW_AT_decl_line(0xe8)
    2595        .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    2596
    2597        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2598        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2599        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2600        .dwendtag $C$DW$T$35
    2601
    2602$C$DW$T$95      .dwtag  DW_TAG_typedef
    2603        .dwattr $C$DW$T$95, DW_AT_name("pruCfg")
    2604        .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$35)
    2605        .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2606        .dwattr $C$DW$T$95, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
    2607        .dwattr $C$DW$T$95, DW_AT_decl_line(0xf0)
    2608        .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2609
    2610$C$DW$T$96      .dwtag  DW_TAG_volatile_type
    2611        .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    2612
    2613
    2614$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2615        .dwattr $C$DW$T$36, DW_AT_byte_size(0x40000)
    2616$C$DW$156       .dwtag  DW_TAG_member
    2617        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$88)
    2618        .dwattr $C$DW$156, DW_AT_name("$P$T13")
    2619        .dwattr $C$DW$156, DW_AT_TI_symbol_name("$P$T13")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   49

    2620        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2622        .dwattr $C$DW$156, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/u
    2623        .dwattr $C$DW$156, DW_AT_decl_line(0x34)
    2624        .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    2625
    2626        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2627        .dwattr $C$DW$T$36, DW_AT_decl_line(0x33)
    2628        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2629        .dwendtag $C$DW$T$36
    2630
    2631$C$DW$T$37      .dwtag  DW_TAG_typedef
    2632        .dwattr $C$DW$T$37, DW_AT_name("unibus_memory_t")
    2633        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2634        .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2635        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2636        .dwattr $C$DW$T$37, DW_AT_decl_line(0x38)
    2637        .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    2638
    2639
    2640$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2641        .dwattr $C$DW$T$38, DW_AT_byte_size(0x40000)
    2642$C$DW$157       .dwtag  DW_TAG_member
    2643        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$37)
    2644        .dwattr $C$DW$157, DW_AT_name("memory")
    2645        .dwattr $C$DW$157, DW_AT_TI_symbol_name("memory")
    2646        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2647        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2648        .dwattr $C$DW$157, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/d
    2649        .dwattr $C$DW$157, DW_AT_decl_line(0x17)
    2650        .dwattr $C$DW$157, DW_AT_decl_column(0x12)
    2651
    2652        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2653        .dwattr $C$DW$T$38, DW_AT_decl_line(0x14)
    2654        .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    2655        .dwendtag $C$DW$T$38
    2656
    2657$C$DW$T$48      .dwtag  DW_TAG_typedef
    2658        .dwattr $C$DW$T$48, DW_AT_name("ddrmem_t")
    2659        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$38)
    2660        .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2661        .dwattr $C$DW$T$48, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2662        .dwattr $C$DW$T$48, DW_AT_decl_line(0x18)
    2663        .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    2664
    2665$C$DW$T$49      .dwtag  DW_TAG_volatile_type
    2666        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2667
    2668$C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2669        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2670        .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2671
    2672
    2673$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2674        .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   50

    2675$C$DW$158       .dwtag  DW_TAG_member
    2676        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$39)
    2677        .dwattr $C$DW$158, DW_AT_name("eventmask")
    2678        .dwattr $C$DW$158, DW_AT_TI_symbol_name("eventmask")
    2679        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2681        .dwattr $C$DW$158, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2682        .dwattr $C$DW$158, DW_AT_decl_line(0x7a)
    2683        .dwattr $C$DW$158, DW_AT_decl_column(0x0a)
    2684
    2685$C$DW$159       .dwtag  DW_TAG_member
    2686        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$39)
    2687        .dwattr $C$DW$159, DW_AT_name("unibus_control")
    2688        .dwattr $C$DW$159, DW_AT_TI_symbol_name("unibus_control")
    2689        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2690        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2691        .dwattr $C$DW$159, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2692        .dwattr $C$DW$159, DW_AT_decl_line(0x7d)
    2693        .dwattr $C$DW$159, DW_AT_decl_column(0x0a)
    2694
    2695$C$DW$160       .dwtag  DW_TAG_member
    2696        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$39)
    2697        .dwattr $C$DW$160, DW_AT_name("device_handle")
    2698        .dwattr $C$DW$160, DW_AT_TI_symbol_name("device_handle")
    2699        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2700        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2701        .dwattr $C$DW$160, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2702        .dwattr $C$DW$160, DW_AT_decl_line(0x7f)
    2703        .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2704
    2705$C$DW$161       .dwtag  DW_TAG_member
    2706        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$39)
    2707        .dwattr $C$DW$161, DW_AT_name("device_register_idx")
    2708        .dwattr $C$DW$161, DW_AT_TI_symbol_name("device_register_idx")
    2709        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2710        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2711        .dwattr $C$DW$161, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2712        .dwattr $C$DW$161, DW_AT_decl_line(0x81)
    2713        .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2714
    2715$C$DW$162       .dwtag  DW_TAG_member
    2716        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
    2717        .dwattr $C$DW$162, DW_AT_name("addr")
    2718        .dwattr $C$DW$162, DW_AT_TI_symbol_name("addr")
    2719        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2720        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2721        .dwattr $C$DW$162, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2722        .dwattr $C$DW$162, DW_AT_decl_line(0x83)
    2723        .dwattr $C$DW$162, DW_AT_decl_column(0x0b)
    2724
    2725$C$DW$163       .dwtag  DW_TAG_member
    2726        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    2727        .dwattr $C$DW$163, DW_AT_name("data")
    2728        .dwattr $C$DW$163, DW_AT_TI_symbol_name("data")
    2729        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   51

    2730        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2731        .dwattr $C$DW$163, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2732        .dwattr $C$DW$163, DW_AT_decl_line(0x84)
    2733        .dwattr $C$DW$163, DW_AT_decl_column(0x0b)
    2734
    2735$C$DW$164       .dwtag  DW_TAG_member
    2736        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$39)
    2737        .dwattr $C$DW$164, DW_AT_name("initialization_signals_prev")
    2738        .dwattr $C$DW$164, DW_AT_TI_symbol_name("initialization_signals_prev")
    2739        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2740        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2741        .dwattr $C$DW$164, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2742        .dwattr $C$DW$164, DW_AT_decl_line(0x87)
    2743        .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    2744
    2745$C$DW$165       .dwtag  DW_TAG_member
    2746        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$39)
    2747        .dwattr $C$DW$165, DW_AT_name("initialization_signals_cur")
    2748        .dwattr $C$DW$165, DW_AT_TI_symbol_name("initialization_signals_cur")
    2749        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2750        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2751        .dwattr $C$DW$165, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2752        .dwattr $C$DW$165, DW_AT_decl_line(0x88)
    2753        .dwattr $C$DW$165, DW_AT_decl_column(0x0a)
    2754
    2755        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2756        .dwattr $C$DW$T$41, DW_AT_decl_line(0x79)
    2757        .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    2758        .dwendtag $C$DW$T$41
    2759
    2760$C$DW$T$51      .dwtag  DW_TAG_typedef
    2761        .dwattr $C$DW$T$51, DW_AT_name("mailbox_events_t")
    2762        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$41)
    2763        .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2764        .dwattr $C$DW$T$51, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2765        .dwattr $C$DW$T$51, DW_AT_decl_line(0x8b)
    2766        .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2767
    2768
    2769$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2770        .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    2771$C$DW$166       .dwtag  DW_TAG_member
    2772        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
    2773        .dwattr $C$DW$166, DW_AT_name("addr")
    2774        .dwattr $C$DW$166, DW_AT_TI_symbol_name("addr")
    2775        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2777        .dwattr $C$DW$166, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2778        .dwattr $C$DW$166, DW_AT_decl_line(0x4c)
    2779        .dwattr $C$DW$166, DW_AT_decl_column(0x0b)
    2780
    2781$C$DW$167       .dwtag  DW_TAG_member
    2782        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2783        .dwattr $C$DW$167, DW_AT_name("val")
    2784        .dwattr $C$DW$167, DW_AT_TI_symbol_name("val")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:39 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_statemachine_slave.asm                                          PAGE   52

    2785        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2786        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2787        .dwattr $C$DW$167, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2788        .dwattr $C$DW$167, DW_AT_decl_line(0x4d)
    2789        .dwattr $C$DW$167, DW_AT_decl_column(0x0b)
    2790
    2791        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2792        .dwattr $C$DW$T$42, DW_AT_decl_line(0x4b)
    2793        .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2794        .dwendtag $C$DW$T$42
    2795
    2796$C$DW$T$89      .dwtag  DW_TAG_typedef
    2797        .dwattr $C$DW$T$89, DW_AT_name("mailbox_test_t")
    2798        .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$42)
    2799        .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2800        .dwattr $C$DW$T$89, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
    2801        .dwattr $C$DW$T$89, DW_AT_decl_line(0x4e)
    2802        .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2803
    2804
    2805$C$DW$T$43      .dwtag  DW_TAG_structure_type
    2806        .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    2807$C$DW$168       .dwtag  DW_TAG_member
    2808        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    2809        .dwattr $C$DW$168, DW_AT_name("addr")
    2810        .dwattr $C$DW$168, DW_AT_TI_symbol_name("addr")
    2811        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2813        .dwattr $C$DW$168, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/m
    2814        .dwattr $C$DW$168, DW_AT_decl_line(0x51)
    2815        .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    2816
    2817$C$DW$169       .dwtag  DW_TAG_member
    2818        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2819        .dwattr $C$DW$169, DW_AT_name("bitmask")
    2820        .dwattr $C$DW$169, DW_AT_TI_symbol_name("bitmask")
