PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.1 *
       3;* Date/Time created: Sun Mar 31 20:55:29 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_arm_mailbox.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.1 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/pru1")
      12        .global ||mailbox||
      13 00000000                 ||mailbox||:    .usect  ".mailbox_arm_sec",1060,1
      14$C$DW$1 .dwtag  DW_TAG_variable
      15        .dwattr $C$DW$1, DW_AT_name("mailbox")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("mailbox")
      17        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||mailbox||]
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$47)
      19        .dwattr $C$DW$1, DW_AT_external
      20        .dwattr $C$DW$1, DW_AT_decl_file("pru1_arm_mailbox.c")
      21        .dwattr $C$DW$1, DW_AT_decl_line(0x25)
      22        .dwattr $C$DW$1, DW_AT_decl_column(0x18)
      23
      24;       /home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//bin/optpru --gen
      25;       /home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compile/ti-cgt-pru_2.3.1//bin/acpiapru -@/
      26
      27;******************************************************************************
      28;* TYPE INFORMATION                                                           *
      29;******************************************************************************
      30
      31$C$DW$T$19      .dwtag  DW_TAG_structure_type
      32        .dwattr $C$DW$T$19, DW_AT_byte_size(0x40000)
      33$C$DW$2 .dwtag  DW_TAG_member
      34        .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$39)
      35        .dwattr $C$DW$2, DW_AT_name("$P$T0")
      36        .dwattr $C$DW$2, DW_AT_TI_symbol_name("$P$T0")
      37        .dwattr $C$DW$2, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      38        .dwattr $C$DW$2, DW_AT_accessibility(DW_ACCESS_public)
      39        .dwattr $C$DW$2, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/uni
      40        .dwattr $C$DW$2, DW_AT_decl_line(0x34)
      41        .dwattr $C$DW$2, DW_AT_decl_column(0x02)
      42
      43        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
      44        .dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
      45        .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
      46        .dwendtag $C$DW$T$19
      47
      48$C$DW$T$20      .dwtag  DW_TAG_typedef
      49        .dwattr $C$DW$T$20, DW_AT_name("unibus_memory_t")
      50        .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
      51        .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
      52        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
      53        .dwattr $C$DW$T$20, DW_AT_decl_line(0x38)
      54        .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
      55
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    2

      56
      57$C$DW$T$21      .dwtag  DW_TAG_structure_type
      58        .dwattr $C$DW$T$21, DW_AT_byte_size(0x40000)
      59$C$DW$3 .dwtag  DW_TAG_member
      60        .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$20)
      61        .dwattr $C$DW$3, DW_AT_name("memory")
      62        .dwattr $C$DW$3, DW_AT_TI_symbol_name("memory")
      63        .dwattr $C$DW$3, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      64        .dwattr $C$DW$3, DW_AT_accessibility(DW_ACCESS_public)
      65        .dwattr $C$DW$3, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ddr
      66        .dwattr $C$DW$3, DW_AT_decl_line(0x17)
      67        .dwattr $C$DW$3, DW_AT_decl_column(0x12)
      68
      69        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
      70        .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
      71        .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
      72        .dwendtag $C$DW$T$21
      73
      74$C$DW$T$32      .dwtag  DW_TAG_typedef
      75        .dwattr $C$DW$T$32, DW_AT_name("ddrmem_t")
      76        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
      77        .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
      78        .dwattr $C$DW$T$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
      79        .dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
      80        .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
      81
      82$C$DW$T$33      .dwtag  DW_TAG_volatile_type
      83        .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
      84
      85$C$DW$T$34      .dwtag  DW_TAG_pointer_type
      86        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
      87        .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
      88
      89
      90$C$DW$T$25      .dwtag  DW_TAG_structure_type
      91        .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
      92$C$DW$4 .dwtag  DW_TAG_member
      93        .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$22)
      94        .dwattr $C$DW$4, DW_AT_name("eventmask")
      95        .dwattr $C$DW$4, DW_AT_TI_symbol_name("eventmask")
      96        .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      97        .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
      98        .dwattr $C$DW$4, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
      99        .dwattr $C$DW$4, DW_AT_decl_line(0x7a)
     100        .dwattr $C$DW$4, DW_AT_decl_column(0x0a)
     101
     102$C$DW$5 .dwtag  DW_TAG_member
     103        .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$22)
     104        .dwattr $C$DW$5, DW_AT_name("unibus_control")
     105        .dwattr $C$DW$5, DW_AT_TI_symbol_name("unibus_control")
     106        .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     107        .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     108        .dwattr $C$DW$5, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     109        .dwattr $C$DW$5, DW_AT_decl_line(0x7d)
     110        .dwattr $C$DW$5, DW_AT_decl_column(0x0a)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    3

     111
     112$C$DW$6 .dwtag  DW_TAG_member
     113        .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$22)
     114        .dwattr $C$DW$6, DW_AT_name("device_handle")
     115        .dwattr $C$DW$6, DW_AT_TI_symbol_name("device_handle")
     116        .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     117        .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     118        .dwattr $C$DW$6, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     119        .dwattr $C$DW$6, DW_AT_decl_line(0x7f)
     120        .dwattr $C$DW$6, DW_AT_decl_column(0x0a)
     121
     122$C$DW$7 .dwtag  DW_TAG_member
     123        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$22)
     124        .dwattr $C$DW$7, DW_AT_name("device_register_idx")
     125        .dwattr $C$DW$7, DW_AT_TI_symbol_name("device_register_idx")
     126        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     127        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     128        .dwattr $C$DW$7, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     129        .dwattr $C$DW$7, DW_AT_decl_line(0x81)
     130        .dwattr $C$DW$7, DW_AT_decl_column(0x0a)
     131
     132$C$DW$8 .dwtag  DW_TAG_member
     133        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$23)
     134        .dwattr $C$DW$8, DW_AT_name("addr")
     135        .dwattr $C$DW$8, DW_AT_TI_symbol_name("addr")
     136        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     137        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     138        .dwattr $C$DW$8, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     139        .dwattr $C$DW$8, DW_AT_decl_line(0x83)
     140        .dwattr $C$DW$8, DW_AT_decl_column(0x0b)
     141
     142$C$DW$9 .dwtag  DW_TAG_member
     143        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$24)
     144        .dwattr $C$DW$9, DW_AT_name("data")
     145        .dwattr $C$DW$9, DW_AT_TI_symbol_name("data")
     146        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     147        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     148        .dwattr $C$DW$9, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/mai
     149        .dwattr $C$DW$9, DW_AT_decl_line(0x84)
     150        .dwattr $C$DW$9, DW_AT_decl_column(0x0b)
     151
     152$C$DW$10        .dwtag  DW_TAG_member
     153        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$22)
     154        .dwattr $C$DW$10, DW_AT_name("initialization_signals_prev")
     155        .dwattr $C$DW$10, DW_AT_TI_symbol_name("initialization_signals_prev")
     156        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     157        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     158        .dwattr $C$DW$10, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     159        .dwattr $C$DW$10, DW_AT_decl_line(0x87)
     160        .dwattr $C$DW$10, DW_AT_decl_column(0x0a)
     161
     162$C$DW$11        .dwtag  DW_TAG_member
     163        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$22)
     164        .dwattr $C$DW$11, DW_AT_name("initialization_signals_cur")
     165        .dwattr $C$DW$11, DW_AT_TI_symbol_name("initialization_signals_cur")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    4

     166        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     167        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     168        .dwattr $C$DW$11, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     169        .dwattr $C$DW$11, DW_AT_decl_line(0x88)
     170        .dwattr $C$DW$11, DW_AT_decl_column(0x0a)
     171
     172        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     173        .dwattr $C$DW$T$25, DW_AT_decl_line(0x79)
     174        .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     175        .dwendtag $C$DW$T$25
     176
     177$C$DW$T$35      .dwtag  DW_TAG_typedef
     178        .dwattr $C$DW$T$35, DW_AT_name("mailbox_events_t")
     179        .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
     180        .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     181        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     182        .dwattr $C$DW$T$35, DW_AT_decl_line(0x8b)
     183        .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
     184
     185
     186$C$DW$T$26      .dwtag  DW_TAG_structure_type
     187        .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     188$C$DW$12        .dwtag  DW_TAG_member
     189        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$23)
     190        .dwattr $C$DW$12, DW_AT_name("addr")
     191        .dwattr $C$DW$12, DW_AT_TI_symbol_name("addr")
     192        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     193        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     194        .dwattr $C$DW$12, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     195        .dwattr $C$DW$12, DW_AT_decl_line(0x4c)
     196        .dwattr $C$DW$12, DW_AT_decl_column(0x0b)
     197
     198$C$DW$13        .dwtag  DW_TAG_member
     199        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$23)
     200        .dwattr $C$DW$13, DW_AT_name("val")
     201        .dwattr $C$DW$13, DW_AT_TI_symbol_name("val")
     202        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     203        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     204        .dwattr $C$DW$13, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     205        .dwattr $C$DW$13, DW_AT_decl_line(0x4d)
     206        .dwattr $C$DW$13, DW_AT_decl_column(0x0b)
     207
     208        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     209        .dwattr $C$DW$T$26, DW_AT_decl_line(0x4b)
     210        .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     211        .dwendtag $C$DW$T$26
     212
     213$C$DW$T$40      .dwtag  DW_TAG_typedef
     214        .dwattr $C$DW$T$40, DW_AT_name("mailbox_test_t")
     215        .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$26)
     216        .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     217        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     218        .dwattr $C$DW$T$40, DW_AT_decl_line(0x4e)
     219        .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
     220
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    5

     221
     222$C$DW$T$27      .dwtag  DW_TAG_structure_type
     223        .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
     224$C$DW$14        .dwtag  DW_TAG_member
     225        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$23)
     226        .dwattr $C$DW$14, DW_AT_name("addr")
     227        .dwattr $C$DW$14, DW_AT_TI_symbol_name("addr")
     228        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     230        .dwattr $C$DW$14, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     231        .dwattr $C$DW$14, DW_AT_decl_line(0x51)
     232        .dwattr $C$DW$14, DW_AT_decl_column(0x0b)
     233
     234$C$DW$15        .dwtag  DW_TAG_member
     235        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$23)
     236        .dwattr $C$DW$15, DW_AT_name("bitmask")
     237        .dwattr $C$DW$15, DW_AT_TI_symbol_name("bitmask")
     238        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     239        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     240        .dwattr $C$DW$15, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     241        .dwattr $C$DW$15, DW_AT_decl_line(0x52)
     242        .dwattr $C$DW$15, DW_AT_decl_column(0x0b)
     243
     244$C$DW$16        .dwtag  DW_TAG_member
     245        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$23)
     246        .dwattr $C$DW$16, DW_AT_name("val")
     247        .dwattr $C$DW$16, DW_AT_TI_symbol_name("val")
     248        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     249        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     250        .dwattr $C$DW$16, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     251        .dwattr $C$DW$16, DW_AT_decl_line(0x53)
     252        .dwattr $C$DW$16, DW_AT_decl_column(0x0b)
     253
     254        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     255        .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
     256        .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     257        .dwendtag $C$DW$T$27
     258
     259$C$DW$T$41      .dwtag  DW_TAG_typedef
     260        .dwattr $C$DW$T$41, DW_AT_name("mailbox_buslatch_t")
     261        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$27)
     262        .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     263        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     264        .dwattr $C$DW$T$41, DW_AT_decl_line(0x54)
     265        .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
     266
     267
     268$C$DW$T$28      .dwtag  DW_TAG_structure_type
     269        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     270$C$DW$17        .dwtag  DW_TAG_member
     271        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$22)
     272        .dwattr $C$DW$17, DW_AT_name("addr_0_7")
     273        .dwattr $C$DW$17, DW_AT_TI_symbol_name("addr_0_7")
     274        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     275        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    6

     276        .dwattr $C$DW$17, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     277        .dwattr $C$DW$17, DW_AT_decl_line(0x57)
     278        .dwattr $C$DW$17, DW_AT_decl_column(0x0a)
     279
     280$C$DW$18        .dwtag  DW_TAG_member
     281        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$22)
     282        .dwattr $C$DW$18, DW_AT_name("addr_8_15")
     283        .dwattr $C$DW$18, DW_AT_TI_symbol_name("addr_8_15")
     284        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     285        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     286        .dwattr $C$DW$18, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     287        .dwattr $C$DW$18, DW_AT_decl_line(0x58)
     288        .dwattr $C$DW$18, DW_AT_decl_column(0x0a)
     289
     290$C$DW$19        .dwtag  DW_TAG_member
     291        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$22)
     292        .dwattr $C$DW$19, DW_AT_name("data_0_7")
     293        .dwattr $C$DW$19, DW_AT_TI_symbol_name("data_0_7")
     294        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     295        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     296        .dwattr $C$DW$19, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     297        .dwattr $C$DW$19, DW_AT_decl_line(0x59)
     298        .dwattr $C$DW$19, DW_AT_decl_column(0x0a)
     299
     300$C$DW$20        .dwtag  DW_TAG_member
     301        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     302        .dwattr $C$DW$20, DW_AT_name("data_8_15")
     303        .dwattr $C$DW$20, DW_AT_TI_symbol_name("data_8_15")
     304        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     305        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     306        .dwattr $C$DW$20, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     307        .dwattr $C$DW$20, DW_AT_decl_line(0x5a)
     308        .dwattr $C$DW$20, DW_AT_decl_column(0x0a)
     309
     310        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     311        .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
     312        .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     313        .dwendtag $C$DW$T$28
     314
     315$C$DW$T$42      .dwtag  DW_TAG_typedef
     316        .dwattr $C$DW$T$42, DW_AT_name("mailbox_buslatch_test_t")
     317        .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$28)
     318        .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     319        .dwattr $C$DW$T$42, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     320        .dwattr $C$DW$T$42, DW_AT_decl_line(0x5b)
     321        .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
     322
     323
     324$C$DW$T$30      .dwtag  DW_TAG_structure_type
     325        .dwattr $C$DW$T$30, DW_AT_byte_size(0x40c)
     326$C$DW$21        .dwtag  DW_TAG_member
     327        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     328        .dwattr $C$DW$21, DW_AT_name("cur_status")
     329        .dwattr $C$DW$21, DW_AT_TI_symbol_name("cur_status")
     330        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    7

     331        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     332        .dwattr $C$DW$21, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     333        .dwattr $C$DW$21, DW_AT_decl_line(0x61)
     334        .dwattr $C$DW$21, DW_AT_decl_column(0x0a)
     335
     336$C$DW$22        .dwtag  DW_TAG_member
     337        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     338        .dwattr $C$DW$22, DW_AT_name("control")
     339        .dwattr $C$DW$22, DW_AT_TI_symbol_name("control")
     340        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     341        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     342        .dwattr $C$DW$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     343        .dwattr $C$DW$22, DW_AT_decl_line(0x62)
     344        .dwattr $C$DW$22, DW_AT_decl_column(0x0a)
     345
     346$C$DW$23        .dwtag  DW_TAG_member
     347        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$24)
     348        .dwattr $C$DW$23, DW_AT_name("wordcount")
     349        .dwattr $C$DW$23, DW_AT_TI_symbol_name("wordcount")
     350        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     351        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     352        .dwattr $C$DW$23, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     353        .dwattr $C$DW$23, DW_AT_decl_line(0x63)
     354        .dwattr $C$DW$23, DW_AT_decl_column(0x0b)
     355
     356$C$DW$24        .dwtag  DW_TAG_member
     357        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$23)
     358        .dwattr $C$DW$24, DW_AT_name("cur_addr")
     359        .dwattr $C$DW$24, DW_AT_TI_symbol_name("cur_addr")
     360        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     361        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     362        .dwattr $C$DW$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     363        .dwattr $C$DW$24, DW_AT_decl_line(0x64)
     364        .dwattr $C$DW$24, DW_AT_decl_column(0x0b)
     365
     366$C$DW$25        .dwtag  DW_TAG_member
     367        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$23)
     368        .dwattr $C$DW$25, DW_AT_name("startaddr")
     369        .dwattr $C$DW$25, DW_AT_TI_symbol_name("startaddr")
     370        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     371        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     372        .dwattr $C$DW$25, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     373        .dwattr $C$DW$25, DW_AT_decl_line(0x65)
     374        .dwattr $C$DW$25, DW_AT_decl_column(0x0b)
     375
     376$C$DW$26        .dwtag  DW_TAG_member
     377        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$29)
     378        .dwattr $C$DW$26, DW_AT_name("words")
     379        .dwattr $C$DW$26, DW_AT_TI_symbol_name("words")
     380        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     381        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     382        .dwattr $C$DW$26, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     383        .dwattr $C$DW$26, DW_AT_decl_line(0x66)
     384        .dwattr $C$DW$26, DW_AT_decl_column(0x0b)
     385
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    8

     386        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     387        .dwattr $C$DW$T$30, DW_AT_decl_line(0x5f)
     388        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     389        .dwendtag $C$DW$T$30
     390
     391$C$DW$T$43      .dwtag  DW_TAG_typedef
     392        .dwattr $C$DW$T$43, DW_AT_name("mailbox_dma_t")
     393        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$30)
     394        .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     395        .dwattr $C$DW$T$43, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     396        .dwattr $C$DW$T$43, DW_AT_decl_line(0x67)
     397        .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
     398
     399
     400$C$DW$T$31      .dwtag  DW_TAG_structure_type
     401        .dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
     402$C$DW$27        .dwtag  DW_TAG_member
     403        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$24)
     404        .dwattr $C$DW$27, DW_AT_name("vector")
     405        .dwattr $C$DW$27, DW_AT_TI_symbol_name("vector")
     406        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     407        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     408        .dwattr $C$DW$27, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     409        .dwattr $C$DW$27, DW_AT_decl_line(0x6b)
     410        .dwattr $C$DW$27, DW_AT_decl_column(0x0b)
     411
     412$C$DW$28        .dwtag  DW_TAG_member
     413        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$22)
     414        .dwattr $C$DW$28, DW_AT_name("priority_bit")
     415        .dwattr $C$DW$28, DW_AT_TI_symbol_name("priority_bit")
     416        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     417        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     418        .dwattr $C$DW$28, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     419        .dwattr $C$DW$28, DW_AT_decl_line(0x6c)
     420        .dwattr $C$DW$28, DW_AT_decl_column(0x0a)
     421
     422        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     423        .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
     424        .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     425        .dwendtag $C$DW$T$31
     426
     427$C$DW$T$44      .dwtag  DW_TAG_typedef
     428        .dwattr $C$DW$T$44, DW_AT_name("mailbox_intr_t")
     429        .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$31)
     430        .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     431        .dwattr $C$DW$T$44, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     432        .dwattr $C$DW$T$44, DW_AT_decl_line(0x6d)
     433        .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
     434
     435
     436$C$DW$T$36      .dwtag  DW_TAG_structure_type
     437        .dwattr $C$DW$T$36, DW_AT_byte_size(0x424)
     438$C$DW$29        .dwtag  DW_TAG_member
     439        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     440        .dwattr $C$DW$29, DW_AT_name("arm2pru_req")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE    9

     441        .dwattr $C$DW$29, DW_AT_TI_symbol_name("arm2pru_req")
     442        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     444        .dwattr $C$DW$29, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     445        .dwattr $C$DW$29, DW_AT_decl_line(0x90)
     446        .dwattr $C$DW$29, DW_AT_decl_column(0x0b)
     447
     448$C$DW$30        .dwtag  DW_TAG_member
     449        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     450        .dwattr $C$DW$30, DW_AT_name("arm2pru_resp")
     451        .dwattr $C$DW$30, DW_AT_TI_symbol_name("arm2pru_resp")
     452        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     453        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     454        .dwattr $C$DW$30, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     455        .dwattr $C$DW$30, DW_AT_decl_line(0x91)
     456        .dwattr $C$DW$30, DW_AT_decl_column(0x0b)
     457
     458$C$DW$31        .dwtag  DW_TAG_member
     459        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$34)
     460        .dwattr $C$DW$31, DW_AT_name("ddrmem_base_physical")
     461        .dwattr $C$DW$31, DW_AT_TI_symbol_name("ddrmem_base_physical")
     462        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     463        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     464        .dwattr $C$DW$31, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     465        .dwattr $C$DW$31, DW_AT_decl_line(0x94)
     466        .dwattr $C$DW$31, DW_AT_decl_column(0x15)
     467
     468$C$DW$32        .dwtag  DW_TAG_member
     469        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$35)
     470        .dwattr $C$DW$32, DW_AT_name("events")
     471        .dwattr $C$DW$32, DW_AT_TI_symbol_name("events")
     472        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     473        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     474        .dwattr $C$DW$32, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     475        .dwattr $C$DW$32, DW_AT_decl_line(0x97)
     476        .dwattr $C$DW$32, DW_AT_decl_column(0x13)
     477
     478$C$DW$33        .dwtag  DW_TAG_member
     479        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$45)
     480        .dwattr $C$DW$33, DW_AT_name("$P$T1")
     481        .dwattr $C$DW$33, DW_AT_TI_symbol_name("$P$T1")
     482        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     483        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     484        .dwattr $C$DW$33, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     485        .dwattr $C$DW$33, DW_AT_decl_line(0x9a)
     486        .dwattr $C$DW$33, DW_AT_decl_column(0x02)
     487
     488        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     489        .dwattr $C$DW$T$36, DW_AT_decl_line(0x8d)
     490        .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
     491        .dwendtag $C$DW$T$36
     492
     493$C$DW$T$46      .dwtag  DW_TAG_typedef
     494        .dwattr $C$DW$T$46, DW_AT_name("mailbox_t")
     495        .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$36)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE   10

     496        .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     497        .dwattr $C$DW$T$46, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     498        .dwattr $C$DW$T$46, DW_AT_decl_line(0xa1)
     499        .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
     500
     501$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     502        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
     503
     504
     505$C$DW$T$39      .dwtag  DW_TAG_union_type
     506        .dwattr $C$DW$T$39, DW_AT_byte_size(0x40000)
     507$C$DW$34        .dwtag  DW_TAG_member
     508        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$37)
     509        .dwattr $C$DW$34, DW_AT_name("words")
     510        .dwattr $C$DW$34, DW_AT_TI_symbol_name("words")
     511        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     513        .dwattr $C$DW$34, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     514        .dwattr $C$DW$34, DW_AT_decl_line(0x35)
     515        .dwattr $C$DW$34, DW_AT_decl_column(0x0b)
     516
     517$C$DW$35        .dwtag  DW_TAG_member
     518        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$38)
     519        .dwattr $C$DW$35, DW_AT_name("bytes")
     520        .dwattr $C$DW$35, DW_AT_TI_symbol_name("bytes")
     521        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     523        .dwattr $C$DW$35, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/un
     524        .dwattr $C$DW$35, DW_AT_decl_line(0x36)
     525        .dwattr $C$DW$35, DW_AT_decl_column(0x0b)
     526
     527        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     528        .dwattr $C$DW$T$39, DW_AT_decl_line(0x34)
     529        .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
     530        .dwendtag $C$DW$T$39
     531
     532
     533$C$DW$T$45      .dwtag  DW_TAG_union_type
     534        .dwattr $C$DW$T$45, DW_AT_byte_size(0x40c)
     535$C$DW$36        .dwtag  DW_TAG_member
     536        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$40)
     537        .dwattr $C$DW$36, DW_AT_name("mailbox_test")
     538        .dwattr $C$DW$36, DW_AT_TI_symbol_name("mailbox_test")
     539        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     541        .dwattr $C$DW$36, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     542        .dwattr $C$DW$36, DW_AT_decl_line(0x9b)
     543        .dwattr $C$DW$36, DW_AT_decl_column(0x12)
     544
     545$C$DW$37        .dwtag  DW_TAG_member
     546        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$41)
     547        .dwattr $C$DW$37, DW_AT_name("buslatch")
     548        .dwattr $C$DW$37, DW_AT_TI_symbol_name("buslatch")
     549        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE   11

     551        .dwattr $C$DW$37, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     552        .dwattr $C$DW$37, DW_AT_decl_line(0x9c)
     553        .dwattr $C$DW$37, DW_AT_decl_column(0x16)
     554
     555$C$DW$38        .dwtag  DW_TAG_member
     556        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$42)
     557        .dwattr $C$DW$38, DW_AT_name("buslatch_test")
     558        .dwattr $C$DW$38, DW_AT_TI_symbol_name("buslatch_test")
     559        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     561        .dwattr $C$DW$38, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     562        .dwattr $C$DW$38, DW_AT_decl_line(0x9d)
     563        .dwattr $C$DW$38, DW_AT_decl_column(0x1b)
     564
     565$C$DW$39        .dwtag  DW_TAG_member
     566        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$43)
     567        .dwattr $C$DW$39, DW_AT_name("dma")
     568        .dwattr $C$DW$39, DW_AT_TI_symbol_name("dma")
     569        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     571        .dwattr $C$DW$39, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     572        .dwattr $C$DW$39, DW_AT_decl_line(0x9e)
     573        .dwattr $C$DW$39, DW_AT_decl_column(0x11)
     574
     575$C$DW$40        .dwtag  DW_TAG_member
     576        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$44)
     577        .dwattr $C$DW$40, DW_AT_name("intr")
     578        .dwattr $C$DW$40, DW_AT_TI_symbol_name("intr")
     579        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     581        .dwattr $C$DW$40, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/ma
     582        .dwattr $C$DW$40, DW_AT_decl_line(0x9f)
     583        .dwattr $C$DW$40, DW_AT_decl_column(0x12)
     584
     585        .dwattr $C$DW$T$45, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/10.01_base/2_src/shared/
     586        .dwattr $C$DW$T$45, DW_AT_decl_line(0x9a)
     587        .dwattr $C$DW$T$45, DW_AT_decl_column(0x08)
     588        .dwendtag $C$DW$T$45
     589
     590$C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     591        .dwattr $C$DW$T$2, DW_AT_name("void")
     592
     593$C$DW$T$4       .dwtag  DW_TAG_base_type
     594        .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     595        .dwattr $C$DW$T$4, DW_AT_name("bool")
     596        .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     597
     598$C$DW$T$5       .dwtag  DW_TAG_base_type
     599        .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     600        .dwattr $C$DW$T$5, DW_AT_name("signed char")
     601        .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     602
     603$C$DW$T$6       .dwtag  DW_TAG_base_type
     604        .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     605        .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
PRU Assembler Unix v2.3.1 Sun Mar 31 20:55:29 2019

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
pru1_arm_mailbox.asm                                                 PAGE   12

     606        .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     607
     608$C$DW$T$22      .dwtag  DW_TAG_typedef
     609        .dwattr $C$DW$T$22, DW_AT_name("uint8_t")
     610        .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
     611        .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     612        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     613        .dwattr $C$DW$T$22, DW_AT_decl_line(0x3d)
     614        .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
     615
     616
     617$C$DW$T$38      .dwtag  DW_TAG_array_type
     618        .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
     619        .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     620        .dwattr $C$DW$T$38, DW_AT_byte_size(0x40000)
     621$C$DW$41        .dwtag  DW_TAG_subrange_type
     622        .dwattr $C$DW$41, DW_AT_upper_bound(0x3ffff)
     623
     624        .dwendtag $C$DW$T$38
     625
     626$C$DW$T$7       .dwtag  DW_TAG_base_type
     627        .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     628        .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     629        .dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
     630
     631$C$DW$T$8       .dwtag  DW_TAG_base_type
     632        .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     633        .dwattr $C$DW$T$8, DW_AT_name("short")
     634        .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     635
     636$C$DW$T$9       .dwtag  DW_TAG_base_type
     637        .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     638        .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     639        .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
     640
     641$C$DW$T$24      .dwtag  DW_TAG_typedef
     642        .dwattr $C$DW$T$24, DW_AT_name("uint16_t")
     643        .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$9)
     644        .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     645        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/joerg/retrocmp/dec/UniBone/91_3rd_party/pru-c-compi
     646        .dwattr $C$DW$T$24, DW_AT_decl_line(0x3f)
     647        .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
     648
     649
     650$C$DW$T$29      .dwtag  DW_TAG_array_type
     651        .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$24)
     652        .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     653        .dwattr $C$DW$T$29, DW_AT_byte_size(0x400)
